{"isDeprecatedLicenseId":true,"standardLicenseTemplate":"                    GNU GENERAL PUBLIC LICENSE\r\n                     Version 1, February 1989\r\n\r\n Copyright (C) 1989 Free Software Foundation, Inc.\r\n                    51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA\r\n Everyone is permitted to copy and distribute verbatim copies\r\n of this license document, but changing it is not allowed.\r\n\r\n                            Preamble\r\n\r\n  The license agreements of most software companies try to keep users\r\nat the mercy of those companies.  By contrast, our General Public\r\nLicense is intended to guarantee your freedom to share and change free\r\nsoftware--to make sure the software is free for all its users.  The\r\nGeneral Public License applies to the Free Software Foundation's\r\nsoftware and to any other program whose authors commit to using it.\r\nYou can use it for your programs, too.\r\n\r\n  When we speak of free software, we are referring to freedom, not\r\nprice.  Specifically, the General Public License is designed to make\r\nsure that you have the freedom to give away or sell copies of free\r\nsoftware, that you receive source code or can get it if you want it,\r\nthat you can change the software or use pieces of it in new free\r\nprograms; and that you know you can do these things.\r\n\r\n  To protect your rights, we need to make restrictions that forbid\r\nanyone to deny you these rights or to ask you to surrender the rights.\r\nThese restrictions translate to certain responsibilities for you if you\r\ndistribute copies of the software, or if you modify it.\r\n\r\n  For example, if you distribute copies of a such a program, whether\r\ngratis or for a fee, you must give the recipients all the rights that\r\nyou have.  You must make sure that they, too, receive or can get the\r\nsource code.  And you must tell them their rights.\r\n\r\n  We protect your rights with two steps: (1) copyright the software, and\r\n(2) offer you this license which gives you legal permission to copy,\r\ndistribute and\/or modify the software.\r\n\r\n  Also, for each author's protection and ours, we want to make certain\r\nthat everyone understands that there is no warranty for this free\r\nsoftware.  If the software is modified by someone else and passed on, we\r\nwant its recipients to know that what they have is not the original, so\r\nthat any problems introduced by others will not reflect on the original\r\nauthors' reputations.\r\n\r\n  The precise terms and conditions for copying, distribution and\r\nmodification follow.\r\n\r\n                    GNU GENERAL PUBLIC LICENSE\r\n   TERMS AND CONDITIONS FOR COPYING, DISTRIBUTION AND MODIFICATION\r\n\r\n  0. This License Agreement applies to any program or other work which\r\ncontains a notice placed by the copyright holder saying it may be\r\ndistributed under the terms of this General Public License.  The\r\n\"Program\", below, refers to any such program or work, and a \"work based\r\non the Program\" means either the Program or any work containing the\r\nProgram or a portion of it, either verbatim or with modifications.  Each\r\nlicensee is addressed as \"you\".\r\n\r\n  1. You may copy and distribute verbatim copies of the Program's source\r\ncode as you receive it, in any medium, provided that you conspicuously and\r\nappropriately publish on each copy an appropriate copyright notice and\r\ndisclaimer of warranty; keep intact all the notices that refer to this\r\nGeneral Public License and to the absence of any warranty; and give any\r\nother recipients of the Program a copy of this General Public License\r\nalong with the Program.  You may charge a fee for the physical act of\r\ntransferring a copy.\r\n\r\n  2. You may modify your copy or copies of the Program or any portion of\r\nit, and copy and distribute such modifications under the terms of Paragraph\r\n1 above, provided that you also do the following:\r\n\r\n    a) cause the modified files to carry prominent notices stating that\r\n    you changed the files and the date of any change; and\r\n\r\n    b) cause the whole of any work that you distribute or publish, that\r\n    in whole or in part contains the Program or any part thereof, either\r\n    with or without modifications, to be licensed at no charge to all\r\n    third parties under the terms of this General Public License (except\r\n    that you may choose to grant warranty protection to some or all\r\n    third parties, at your option).\r\n\r\n    c) If the modified program normally reads commands interactively when\r\n    run, you must cause it, when started running for such interactive use\r\n    in the simplest and most usual way, to print or display an\r\n    announcement including an appropriate copyright notice and a notice\r\n    that there is no warranty (or else, saying that you provide a\r\n    warranty) and that users may redistribute the program under these\r\n    conditions, and telling the user how to view a copy of this General\r\n    Public License.\r\n\r\n    d) You may charge a fee for the physical act of transferring a\r\n    copy, and you may at your option offer warranty protection in\r\n    exchange for a fee.\r\n\r\nMere aggregation of another independent work with the Program (or its\r\nderivative) on a volume of a storage or distribution medium does not bring\r\nthe other work under the scope of these terms.\r\n\r\n  3. You may copy and distribute the Program (or a portion or derivative of\r\nit, under Paragraph 2) in object code or executable form under the terms of\r\nParagraphs 1 and 2 above provided that you also do one of the following:\r\n\r\n    a) accompany it with the complete corresponding machine-readable\r\n    source code, which must be distributed under the terms of\r\n    Paragraphs 1 and 2 above; or,\r\n\r\n    b) accompany it with a written offer, valid for at least three\r\n    years, to give any third party free (except for a nominal charge\r\n    for the cost of distribution) a complete machine-readable copy of the\r\n    corresponding source code, to be distributed under the terms of\r\n    Paragraphs 1 and 2 above; or,\r\n\r\n    c) accompany it with the information you received as to where the\r\n    corresponding source code may be obtained.  (This alternative is\r\n    allowed only for noncommercial distribution and only if you\r\n    received the program in object code or executable form alone.)\r\n\r\nSource code for a work means the preferred form of the work for making\r\nmodifications to it.  For an executable file, complete source code means\r\nall the source code for all modules it contains; but, as a special\r\nexception, it need not include source code for modules which are standard\r\nlibraries that accompany the operating system on which the executable\r\nfile runs, or for standard header files or definitions files that\r\naccompany that operating system.\r\n\r\n  4. You may not copy, modify, sublicense, distribute or transfer the\r\nProgram except as expressly provided under this General Public License.\r\nAny attempt otherwise to copy, modify, sublicense, distribute or transfer\r\nthe Program is void, and will automatically terminate your rights to use\r\nthe Program under this License.  However, parties who have received\r\ncopies, or rights to use copies, from you under this General Public\r\nLicense will not have their licenses terminated so long as such parties\r\nremain in full compliance.\r\n\r\n  5. By copying, distributing or modifying the Program (or any work based\r\non the Program) you indicate your acceptance of this license to do so,\r\nand all its terms and conditions.\r\n\r\n  6. Each time you redistribute the Program (or any work based on the\r\nProgram), the recipient automatically receives a license from the original\r\nlicensor to copy, distribute or modify the Program subject to these\r\nterms and conditions.  You may not impose any further restrictions on the\r\nrecipients' exercise of the rights granted herein.\r\n\r\n  7. The Free Software Foundation may publish revised and\/or new versions\r\nof the General Public License from time to time.  Such new versions will\r\nbe similar in spirit to the present version, but may differ in detail to\r\naddress new problems or concerns.\r\n\r\nEach version is given a distinguishing version number.  If the Program\r\nspecifies a version number of the license which applies to it and \"any\r\nlater version\", you have the option of following the terms and conditions\r\neither of that version or of any later version published by the Free\r\nSoftware Foundation.  If the Program does not specify a version number of\r\nthe license, you may choose any version ever published by the Free Software\r\nFoundation.\r\n\r\n  8. If you wish to incorporate parts of the Program into other free\r\nprograms whose distribution conditions are different, write to the author\r\nto ask for permission.  For software which is copyrighted by the Free\r\nSoftware Foundation, write to the Free Software Foundation; we sometimes\r\nmake exceptions for this.  Our decision will be guided by the two goals\r\nof preserving the free status of all derivatives of our free software and\r\nof promoting the sharing and reuse of software generally.\r\n\r\n                            NO WARRANTY\r\n\r\n  9. BECAUSE THE PROGRAM IS LICENSED FREE OF CHARGE, THERE IS NO WARRANTY\r\nFOR THE PROGRAM, TO THE EXTENT PERMITTED BY APPLICABLE LAW.  EXCEPT WHEN\r\nOTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND\/OR OTHER PARTIES\r\nPROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED\r\nOR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\r\nMERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.  THE ENTIRE RISK AS\r\nTO THE QUALITY AND PERFORMANCE OF THE PROGRAM IS WITH YOU.  SHOULD THE\r\nPROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF ALL NECESSARY SERVICING,\r\nREPAIR OR CORRECTION.\r\n\r\n  10. IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\r\nWILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY AND\/OR\r\nREDISTRIBUTE THE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES,\r\nINCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING\r\nOUT OF THE USE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED\r\nTO LOSS OF DATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY\r\nYOU OR THIRD PARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER\r\nPROGRAMS), EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE\r\nPOSSIBILITY OF SUCH DAMAGES.\r\n\r\n                     END OF TERMS AND CONDITIONS\r\n\r\n        Appendix: How to Apply These Terms to Your New Programs\r\n\r\n  If you develop a new program, and you want it to be of the greatest\r\npossible use to humanity, the best way to achieve this is to make it\r\nfree software which everyone can redistribute and change under these\r\nterms.\r\n\r\n  To do so, attach the following notices to the program.  It is safest to\r\nattach them to the start of each source file to most effectively convey\r\nthe exclusion of warranty; and each file should have at least the\r\n\"copyright\" line and a pointer to where the full notice is found.\r\n\r\n    <one line to give the program's name and a brief idea of what it does.>\r\n    Copyright (C) 19yy  <name of author>\r\n\r\n    This program is free software; you can redistribute it and\/or modify\r\n    it under the terms of the GNU General Public License as published by\r\n    the Free Software Foundation; either version 1, or (at your option)\r\n    any later version.\r\n\r\n    This program is distributed in the hope that it will be useful,\r\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\r\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\r\n    GNU General Public License for more details.\r\n\r\n    You should have received a copy of the GNU General Public License\r\n    along with this program; if not, write to the Free Software\r\n    Foundation, Inc., 675 Mass Ave, Cambridge, MA 02139, USA.\r\n\r\nAlso add information on how to contact you by electronic and paper mail.\r\n\r\nIf the program is interactive, make it output a short notice like this\r\nwhen it starts in an interactive mode:\r\n\r\n    Gnomovision version 69, Copyright (C) 19xx name of author\r\n    Gnomovision comes with ABSOLUTELY NO WARRANTY; for details type `show w'.\r\n    This is free software, and you are welcome to redistribute it\r\n    under certain conditions; type `show c' for details.\r\n\r\nThe hypothetical commands `show w' and `show c' should show the\r\nappropriate parts of the General Public License.  Of course, the\r\ncommands you use may be called something other than `show w' and `show\r\nc'; they could even be mouse-clicks or menu items--whatever suits your\r\nprogram.\r\n\r\nYou should also get your employer (if you work as a programmer) or your\r\nschool, if any, to sign a \"copyright disclaimer\" for the program, if\r\nnecessary.  Here a sample; alter the names:\r\n\r\n  Yoyodyne, Inc., hereby disclaims all copyright interest in the\r\n  program `Gnomovision' (a program to direct compilers to make passes\r\n  at assemblers) written by James Hacker.\r\n\r\n  <signature of Ty Coon>, 1 April 1989\r\n  Ty Coon, President of Vice\r\n\r\nThat's all there is to it!","licenseId":"GPL-1.0+","isOsiApproved":false,"licenseComments":"DEPRECATED: Use License Expression Syntax to create equivalent license.","name":"GNU General Public License v1.0 or later","licenseText":"                    GNU GENERAL PUBLIC LICENSE\r\n                     Version 1, February 1989\r\n\r\n Copyright (C) 1989 Free Software Foundation, Inc.\r\n                    51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA\r\n Everyone is permitted to copy and distribute verbatim copies\r\n of this license document, but changing it is not allowed.\r\n\r\n                            Preamble\r\n\r\n  The license agreements of most software companies try to keep users\r\nat the mercy of those companies.  By contrast, our General Public\r\nLicense is intended to guarantee your freedom to share and change free\r\nsoftware--to make sure the software is free for all its users.  The\r\nGeneral Public License applies to the Free Software Foundation's\r\nsoftware and to any other program whose authors commit to using it.\r\nYou can use it for your programs, too.\r\n\r\n  When we speak of free software, we are referring to freedom, not\r\nprice.  Specifically, the General Public License is designed to make\r\nsure that you have the freedom to give away or sell copies of free\r\nsoftware, that you receive source code or can get it if you want it,\r\nthat you can change the software or use pieces of it in new free\r\nprograms; and that you know you can do these things.\r\n\r\n  To protect your rights, we need to make restrictions that forbid\r\nanyone to deny you these rights or to ask you to surrender the rights.\r\nThese restrictions translate to certain responsibilities for you if you\r\ndistribute copies of the software, or if you modify it.\r\n\r\n  For example, if you distribute copies of a such a program, whether\r\ngratis or for a fee, you must give the recipients all the rights that\r\nyou have.  You must make sure that they, too, receive or can get the\r\nsource code.  And you must tell them their rights.\r\n\r\n  We protect your rights with two steps: (1) copyright the software, and\r\n(2) offer you this license which gives you legal permission to copy,\r\ndistribute and\/or modify the software.\r\n\r\n  Also, for each author's protection and ours, we want to make certain\r\nthat everyone understands that there is no warranty for this free\r\nsoftware.  If the software is modified by someone else and passed on, we\r\nwant its recipients to know that what they have is not the original, so\r\nthat any problems introduced by others will not reflect on the original\r\nauthors' reputations.\r\n\r\n  The precise terms and conditions for copying, distribution and\r\nmodification follow.\r\n\r\n                    GNU GENERAL PUBLIC LICENSE\r\n   TERMS AND CONDITIONS FOR COPYING, DISTRIBUTION AND MODIFICATION\r\n\r\n  0. This License Agreement applies to any program or other work which\r\ncontains a notice placed by the copyright holder saying it may be\r\ndistributed under the terms of this General Public License.  The\r\n\"Program\", below, refers to any such program or work, and a \"work based\r\non the Program\" means either the Program or any work containing the\r\nProgram or a portion of it, either verbatim or with modifications.  Each\r\nlicensee is addressed as \"you\".\r\n\r\n  1. You may copy and distribute verbatim copies of the Program's source\r\ncode as you receive it, in any medium, provided that you conspicuously and\r\nappropriately publish on each copy an appropriate copyright notice and\r\ndisclaimer of warranty; keep intact all the notices that refer to this\r\nGeneral Public License and to the absence of any warranty; and give any\r\nother recipients of the Program a copy of this General Public License\r\nalong with the Program.  You may charge a fee for the physical act of\r\ntransferring a copy.\r\n\r\n  2. You may modify your copy or copies of the Program or any portion of\r\nit, and copy and distribute such modifications under the terms of Paragraph\r\n1 above, provided that you also do the following:\r\n\r\n    a) cause the modified files to carry prominent notices stating that\r\n    you changed the files and the date of any change; and\r\n\r\n    b) cause the whole of any work that you distribute or publish, that\r\n    in whole or in part contains the Program or any part thereof, either\r\n    with or without modifications, to be licensed at no charge to all\r\n    third parties under the terms of this General Public License (except\r\n    that you may choose to grant warranty protection to some or all\r\n    third parties, at your option).\r\n\r\n    c) If the modified program normally reads commands interactively when\r\n    run, you must cause it, when started running for such interactive use\r\n    in the simplest and most usual way, to print or display an\r\n    announcement including an appropriate copyright notice and a notice\r\n    that there is no warranty (or else, saying that you provide a\r\n    warranty) and that users may redistribute the program under these\r\n    conditions, and telling the user how to view a copy of this General\r\n    Public License.\r\n\r\n    d) You may charge a fee for the physical act of transferring a\r\n    copy, and you may at your option offer warranty protection in\r\n    exchange for a fee.\r\n\r\nMere aggregation of another independent work with the Program (or its\r\nderivative) on a volume of a storage or distribution medium does not bring\r\nthe other work under the scope of these terms.\r\n\r\n  3. You may copy and distribute the Program (or a portion or derivative of\r\nit, under Paragraph 2) in object code or executable form under the terms of\r\nParagraphs 1 and 2 above provided that you also do one of the following:\r\n\r\n    a) accompany it with the complete corresponding machine-readable\r\n    source code, which must be distributed under the terms of\r\n    Paragraphs 1 and 2 above; or,\r\n\r\n    b) accompany it with a written offer, valid for at least three\r\n    years, to give any third party free (except for a nominal charge\r\n    for the cost of distribution) a complete machine-readable copy of the\r\n    corresponding source code, to be distributed under the terms of\r\n    Paragraphs 1 and 2 above; or,\r\n\r\n    c) accompany it with the information you received as to where the\r\n    corresponding source code may be obtained.  (This alternative is\r\n    allowed only for noncommercial distribution and only if you\r\n    received the program in object code or executable form alone.)\r\n\r\nSource code for a work means the preferred form of the work for making\r\nmodifications to it.  For an executable file, complete source code means\r\nall the source code for all modules it contains; but, as a special\r\nexception, it need not include source code for modules which are standard\r\nlibraries that accompany the operating system on which the executable\r\nfile runs, or for standard header files or definitions files that\r\naccompany that operating system.\r\n\r\n  4. You may not copy, modify, sublicense, distribute or transfer the\r\nProgram except as expressly provided under this General Public License.\r\nAny attempt otherwise to copy, modify, sublicense, distribute or transfer\r\nthe Program is void, and will automatically terminate your rights to use\r\nthe Program under this License.  However, parties who have received\r\ncopies, or rights to use copies, from you under this General Public\r\nLicense will not have their licenses terminated so long as such parties\r\nremain in full compliance.\r\n\r\n  5. By copying, distributing or modifying the Program (or any work based\r\non the Program) you indicate your acceptance of this license to do so,\r\nand all its terms and conditions.\r\n\r\n  6. Each time you redistribute the Program (or any work based on the\r\nProgram), the recipient automatically receives a license from the original\r\nlicensor to copy, distribute or modify the Program subject to these\r\nterms and conditions.  You may not impose any further restrictions on the\r\nrecipients' exercise of the rights granted herein.\r\n\r\n  7. The Free Software Foundation may publish revised and\/or new versions\r\nof the General Public License from time to time.  Such new versions will\r\nbe similar in spirit to the present version, but may differ in detail to\r\naddress new problems or concerns.\r\n\r\nEach version is given a distinguishing version number.  If the Program\r\nspecifies a version number of the license which applies to it and \"any\r\nlater version\", you have the option of following the terms and conditions\r\neither of that version or of any later version published by the Free\r\nSoftware Foundation.  If the Program does not specify a version number of\r\nthe license, you may choose any version ever published by the Free Software\r\nFoundation.\r\n\r\n  8. If you wish to incorporate parts of the Program into other free\r\nprograms whose distribution conditions are different, write to the author\r\nto ask for permission.  For software which is copyrighted by the Free\r\nSoftware Foundation, write to the Free Software Foundation; we sometimes\r\nmake exceptions for this.  Our decision will be guided by the two goals\r\nof preserving the free status of all derivatives of our free software and\r\nof promoting the sharing and reuse of software generally.\r\n\r\n                            NO WARRANTY\r\n\r\n  9. BECAUSE THE PROGRAM IS LICENSED FREE OF CHARGE, THERE IS NO WARRANTY\r\nFOR THE PROGRAM, TO THE EXTENT PERMITTED BY APPLICABLE LAW.  EXCEPT WHEN\r\nOTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND\/OR OTHER PARTIES\r\nPROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED\r\nOR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\r\nMERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.  THE ENTIRE RISK AS\r\nTO THE QUALITY AND PERFORMANCE OF THE PROGRAM IS WITH YOU.  SHOULD THE\r\nPROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF ALL NECESSARY SERVICING,\r\nREPAIR OR CORRECTION.\r\n\r\n  10. IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\r\nWILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY AND\/OR\r\nREDISTRIBUTE THE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES,\r\nINCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING\r\nOUT OF THE USE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED\r\nTO LOSS OF DATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY\r\nYOU OR THIRD PARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER\r\nPROGRAMS), EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE\r\nPOSSIBILITY OF SUCH DAMAGES.\r\n\r\n                     END OF TERMS AND CONDITIONS\r\n\r\n        Appendix: How to Apply These Terms to Your New Programs\r\n\r\n  If you develop a new program, and you want it to be of the greatest\r\npossible use to humanity, the best way to achieve this is to make it\r\nfree software which everyone can redistribute and change under these\r\nterms.\r\n\r\n  To do so, attach the following notices to the program.  It is safest to\r\nattach them to the start of each source file to most effectively convey\r\nthe exclusion of warranty; and each file should have at least the\r\n\"copyright\" line and a pointer to where the full notice is found.\r\n\r\n    <one line to give the program's name and a brief idea of what it does.>\r\n    Copyright (C) 19yy  <name of author>\r\n\r\n    This program is free software; you can redistribute it and\/or modify\r\n    it under the terms of the GNU General Public License as published by\r\n    the Free Software Foundation; either version 1, or (at your option)\r\n    any later version.\r\n\r\n    This program is distributed in the hope that it will be useful,\r\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\r\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\r\n    GNU General Public License for more details.\r\n\r\n    You should have received a copy of the GNU General Public License\r\n    along with this program; if not, write to the Free Software\r\n    Foundation, Inc., 675 Mass Ave, Cambridge, MA 02139, USA.\r\n\r\nAlso add information on how to contact you by electronic and paper mail.\r\n\r\nIf the program is interactive, make it output a short notice like this\r\nwhen it starts in an interactive mode:\r\n\r\n    Gnomovision version 69, Copyright (C) 19xx name of author\r\n    Gnomovision comes with ABSOLUTELY NO WARRANTY; for details type `show w'.\r\n    This is free software, and you are welcome to redistribute it\r\n    under certain conditions; type `show c' for details.\r\n\r\nThe hypothetical commands `show w' and `show c' should show the\r\nappropriate parts of the General Public License.  Of course, the\r\ncommands you use may be called something other than `show w' and `show\r\nc'; they could even be mouse-clicks or menu items--whatever suits your\r\nprogram.\r\n\r\nYou should also get your employer (if you work as a programmer) or your\r\nschool, if any, to sign a \"copyright disclaimer\" for the program, if\r\nnecessary.  Here a sample; alter the names:\r\n\r\n  Yoyodyne, Inc., hereby disclaims all copyright interest in the\r\n  program `Gnomovision' (a program to direct compilers to make passes\r\n  at assemblers) written by James Hacker.\r\n\r\n  <signature of Ty Coon>, 1 April 1989\r\n  Ty Coon, President of Vice\r\n\r\nThat's all there is to it!","seeAlso":["http:\/\/www.gnu.org\/licenses\/old-licenses\/gpl-1.0-standalone.html"],"standardLicenseHeader":"Copyright (C) {{year}}  {{name of author}}\n\nThis program is free software; you can redistribute it and\/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 1, or (at your option) any later version.\n\nThis program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License for more details.\n\nYou should have received a copy of the GNU General Public License along with this program; if not, write to the Free Software Foundation, Inc., 675 Mass Ave, Cambridge, MA 02139, USA."}