{"isDeprecatedLicenseId":false,"standardLicenseTemplate":"IBM Public License Version 1.0\r\n\r\nTHE ACCOMPANYING PROGRAM IS PROVIDED UNDER THE TERMS OF THIS IBM\r\nPUBLIC LICENSE (\"AGREEMENT\"). ANY USE, REPRODUCTION OR DISTRIBUTION\r\nOF THE PROGRAM CONSTITUTES RECIPIENT'S ACCEPTANCE OF THIS AGREEMENT.\r\n\r\n1. DEFINITIONS\r\n\"Contribution\" means:\r\n\r\na.  in the case of International Business Machines Corporation (\"IBM\"), the Original Program, and\r\n\r\nb.  in the case of each Contributor,\r\n\ti.  changes to the Program, and\r\n\tii.  additions to the Program;\r\nwhere such changes and\/or additions to the Program originate from and\r\nare distributed by that particular Contributor. A Contribution\r\n'originates' from a Contributor if it was added to the Program by\r\nsuch Contributor itself or anyone acting on such Contributor's\r\nbehalf. Contributions do not include additions to the Program which:\r\n(i) are separate modules of software distributed in conjunction with\r\nthe Program under their own license agreement, and (ii) are not\r\nderivative works of the Program.\r\n\r\n\"Contributor\" means IBM and any other entity that distributes the Program.\r\n\r\n\"Licensed Patents \" mean patent claims licensable by a\r\nContributor which are necessarily infringed by the use or sale of its\r\nContribution alone or when combined with the Program.\r\n\r\n\"Original Program\" means the original version of the software\r\naccompanying this Agreement as released by IBM, including source\r\ncode, object code and documentation, if any.\r\n\r\n\"Program\" means the Original Program and Contributions.\r\n\r\n\"Recipient\" means anyone who receives the Program under this\r\nAgreement, including all Contributors.\r\n\r\n2. GRANT OF RIGHTS\r\na.  Subject to the terms of this Agreement, each Contributor hereby\r\ngrants Recipient a non-exclusive, worldwide, royalty-free copyright\r\nlicense to reproduce, prepare derivative works of, publicly display,\r\npublicly perform, distribute and sublicense the Contribution of such\r\nContributor, if any, and such derivative works, in source code and\r\nobject code form.\r\n\r\nb.  Subject to the terms of this Agreement, each Contributor hereby\r\ngrants Recipient a non-exclusive, worldwide, royalty-free patent\r\nlicense under Licensed Patents to make, use, sell, offer to sell,\r\nimport and otherwise transfer the Contribution of such Contributor,\r\nif any, in source code and object code form. This patent license\r\nshall apply to the combination of the Contribution and the Program\r\nif, at the time the Contribution is added by the Contributor, such\r\naddition of the Contribution causes such combination to be covered by\r\nthe Licensed Patents. The patent license shall not apply to any\r\nother combinations which include the Contribution. No hardware per\r\nse is licensed hereunder.\r\n\r\nc.  Recipient understands that although each Contributor grants the\r\nlicenses to its Contributions set forth herein, no assurances are\r\nprovided by any Contributor that the Program does not infringe the\r\npatent or other intellectual property rights of any other entity.\r\nEach Contributor disclaims any liability to Recipient for claims\r\nbrought by any other entity based on infringement of intellectual\r\nproperty rights or otherwise. As a condition to exercising the\r\nrights and licenses granted hereunder, each Recipient hereby assumes\r\nsole responsibility to secure any other intellectual property rights\r\nneeded, if any. For example, if a third party patent license is\r\nrequired to allow Recipient to distribute the Program, it is\r\nRecipient's responsibility to acquire that license before\r\ndistributing the Program.\r\n\r\nd.  Each Contributor represents that to its knowledge it has\r\nsufficient copyright rights in its Contribution, if any, to grant the\r\ncopyright license set forth in this Agreement.\r\n\r\n3. REQUIREMENTS\r\nA Contributor may choose to distribute\r\nthe Program in object code form under its own license agreement,\r\nprovided that:\r\n\r\na.  it complies with the terms and conditions of this Agreement; and\r\nb.  its license agreement:\r\n\ti.  effectively disclaims on behalf of all Contributors all warranties\r\n\tand conditions, express and implied, including warranties or\r\n\tconditions of title and non-infringement, and implied warranties or\r\n\tconditions of merchantability and fitness for a particular purpose;\r\n\tii.  effectively excludes on behalf of all Contributors all liability\r\n\tfor damages, including direct, indirect, special, incidental and\r\n\tconsequential damages, such as lost profits;\r\n\tiii.  states that any provisions which differ from this Agreement are\r\n\toffered by that Contributor alone and not by any other party; and\r\n\tiv.  states that source code for the Program is available from such\r\n\tContributor, and informs licensees how to obtain it in a reasonable\r\n\tmanner on or through a medium customarily used for software exchange.\r\n\r\nWhen the Program is made available in source code form:\r\na.  it must be made available under this Agreement; and\r\nb.  a copy of this Agreement must be included with each copy of the\r\nProgram.\r\n\r\nEach Contributor must include the following in a conspicuous location in the Program:\r\n\r\n\tCopyright (C) 1996, 1999 International Business Machines Corporation and others. All Rights Reserved.\r\n\r\nIn addition, each Contributor must identify itself as the originator\r\nof its Contribution, if any, in a manner that reasonably allows\r\nsubsequent Recipients to identify the originator of the Contribution.\r\n\r\n4. COMMERCIAL DISTRIBUTION\r\nCommercial distributors of software may accept certain\r\nresponsibilities with respect to end users, business partners and the\r\nlike. While this license is intended to facilitate the commercial\r\nuse of the Program, the Contributor who includes the Program in a\r\ncommercial product offering should do so in a manner which does not\r\ncreate potential liability for other Contributors. Therefore, if a\r\nContributor includes the Program in a commercial product offering,\r\nsuch Contributor (\"Commercial Contributor\") hereby agrees to defend\r\nand indemnify every other Contributor (\"Indemnified Contributor\")\r\nagainst any losses, damages and costs (collectively \"Losses\") arising\r\nfrom claims, lawsuits and other legal actions brought by a third\r\nparty against the Indemnified Contributor to the extent caused by the\r\nacts or omissions of such Commercial Contributor in connection with\r\nits distribution of the Program in a commercial product offering.\r\nThe obligations in this section do not apply to any claims or Losses\r\nrelating to any actual or alleged intellectual property infringement.\r\nIn order to qualify, an Indemnified Contributor must: a) promptly\r\nnotify the Commercial Contributor in writing of such claim, and b)\r\nallow the Commercial Contributor to control, and cooperate with the\r\nCommercial Contributor in, the defense and any related settlement\r\nnegotiations. The Indemnified Contributor may participate in any\r\nsuch claim at its own expense.\r\n\r\nFor example, a Contributor might include the Program in a commercial\r\nproduct offering, Product X. That Contributor is then a Commercial\r\nContributor. If that Commercial Contributor then makes performance\r\nclaims, or offers warranties related to Product X, those performance\r\nclaims and warranties are such Commercial Contributor's\r\nresponsibility alone. Under this section, the Commercial Contributor\r\nwould have to defend claims against the other Contributors related to\r\nthose performance claims and warranties, and if a court requires any\r\nother Contributor to pay any damages as a result, the Commercial\r\nContributor must pay those damages.\r\n\r\n5. NO WARRANTY\r\nEXCEPT AS EXPRESSLY SET FORTH IN THIS AGREEMENT, THE PROGRAM IS\r\nPROVIDED ON AN \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY\r\nKIND, EITHER EXPRESS OR IMPLIED INCLUDING, WITHOUT LIMITATION, ANY\r\nWARRANTIES OR CONDITIONS OF TITLE, NON-INFRINGEMENT, MERCHANTABILITY\r\nOR FITNESS FOR A PARTICULAR PURPOSE. Each Recipient is solely\r\nresponsible for determining the appropriateness of using and\r\ndistributing the Program and assumes all risks associated with its\r\nexercise of rights under this Agreement, including but not limited to\r\nthe risks and costs of program errors, compliance with applicable\r\nlaws, damage to or loss of data, programs or equipment, and\r\nunavailability or interruption of operations.\r\n\r\n6. DISCLAIMER OF LIABILITY\r\nEXCEPT AS EXPRESSLY SET FORTH IN THIS AGREEMENT, NEITHER RECIPIENT\r\nNOR ANY CONTRIBUTORS SHALL HAVE ANY LIABILITY FOR ANY DIRECT,\r\nINDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES\r\n(INCLUDING WITHOUT LIMITATION LOST PROFITS), HOWEVER CAUSED AND ON\r\nANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR\r\nTORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF\r\nTHE USE OR DISTRIBUTION OF THE PROGRAM OR THE EXERCISE OF ANY RIGHTS\r\nGRANTED HEREUNDER, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\r\n\r\n7. GENERAL\r\nIf any provision of this Agreement is invalid or unenforceable under\r\napplicable law, it shall not affect the validity or enforceability of\r\nthe remainder of the terms of this Agreement, and without further\r\naction by the parties hereto, such provision shall be reformed to the\r\nminimum extent necessary to make such provision valid and enforceable.\r\n\r\nIf Recipient institutes patent litigation against a Contributor with\r\nrespect to a patent applicable to software (including a cross-claim\r\nor counterclaim in a lawsuit), then any patent licenses granted by\r\nthat Contributor to such Recipient under this Agreement shall\r\nterminate as of the date such litigation is filed. In addition, if\r\nRecipient institutes patent litigation against any entity (including\r\na cross-claim or counterclaim in a lawsuit) alleging that the Program\r\nitself (excluding combinations of the Program with other software or\r\nhardware) infringes such Recipient's patent(s), then such Recipient's\r\nrights granted under Section 2(b) shall terminate as of the date such\r\nlitigation is filed.\r\n\r\nAll Recipient's rights under this Agreement shall terminate if it\r\nfails to comply with any of the material terms or conditions of this\r\nAgreement and does not cure such failure in a reasonable period of\r\ntime after becoming aware of such noncompliance. If all Recipient's\r\nrights under this Agreement terminate, Recipient agrees to cease use\r\nand distribution of the Program as soon as reasonably practicable.\r\nHowever, Recipient's obligations under this Agreement and any\r\nlicenses granted by Recipient relating to the Program shall continue\r\nand survive.\r\n\r\nIBM may publish new versions (including revisions) of this Agreement\r\nfrom time to time. Each new version of the Agreement will be given a\r\ndistinguishing version number. The Program (including Contributions)\r\nmay always be distributed subject to the version of the Agreement\r\nunder which it was received. In addition, after a new version of the\r\nAgreement is published, Contributor may elect to distribute the\r\nProgram (including its Contributions) under the new version. No one\r\nother than IBM has the right to modify this Agreement. Except as\r\nexpressly stated in Sections 2(a) and 2(b) above, Recipient receives\r\nno rights or licenses to the intellectual property of any Contributor\r\nunder this Agreement, whether expressly, by implication, estoppel or\r\notherwise. All rights in the Program not expressly granted under\r\nthis Agreement are reserved.\r\n\r\nThis Agreement is governed by the laws of the State of New York and\r\nthe intellectual property laws of the United States of America. No\r\nparty to this Agreement will bring a legal action under this\r\nAgreement more than one year after the cause of action arose. Each\r\nparty waives its rights to a jury trial in any resulting litigation.","licenseId":"IPL-1.0","isOsiApproved":true,"licenseComments":"This license was superseded by CPL.","name":"IBM Public License v1.0","licenseText":"IBM Public License Version 1.0\r\n\r\nTHE ACCOMPANYING PROGRAM IS PROVIDED UNDER THE TERMS OF THIS IBM\r\nPUBLIC LICENSE (\"AGREEMENT\"). ANY USE, REPRODUCTION OR DISTRIBUTION\r\nOF THE PROGRAM CONSTITUTES RECIPIENT'S ACCEPTANCE OF THIS AGREEMENT.\r\n\r\n1. DEFINITIONS\r\n\"Contribution\" means:\r\n\r\na.  in the case of International Business Machines Corporation (\"IBM\"), the Original Program, and\r\n\r\nb.  in the case of each Contributor,\r\n\ti.  changes to the Program, and\r\n\tii.  additions to the Program;\r\nwhere such changes and\/or additions to the Program originate from and\r\nare distributed by that particular Contributor. A Contribution\r\n'originates' from a Contributor if it was added to the Program by\r\nsuch Contributor itself or anyone acting on such Contributor's\r\nbehalf. Contributions do not include additions to the Program which:\r\n(i) are separate modules of software distributed in conjunction with\r\nthe Program under their own license agreement, and (ii) are not\r\nderivative works of the Program.\r\n\r\n\"Contributor\" means IBM and any other entity that distributes the Program.\r\n\r\n\"Licensed Patents \" mean patent claims licensable by a\r\nContributor which are necessarily infringed by the use or sale of its\r\nContribution alone or when combined with the Program.\r\n\r\n\"Original Program\" means the original version of the software\r\naccompanying this Agreement as released by IBM, including source\r\ncode, object code and documentation, if any.\r\n\r\n\"Program\" means the Original Program and Contributions.\r\n\r\n\"Recipient\" means anyone who receives the Program under this\r\nAgreement, including all Contributors.\r\n\r\n2. GRANT OF RIGHTS\r\na.  Subject to the terms of this Agreement, each Contributor hereby\r\ngrants Recipient a non-exclusive, worldwide, royalty-free copyright\r\nlicense to reproduce, prepare derivative works of, publicly display,\r\npublicly perform, distribute and sublicense the Contribution of such\r\nContributor, if any, and such derivative works, in source code and\r\nobject code form.\r\n\r\nb.  Subject to the terms of this Agreement, each Contributor hereby\r\ngrants Recipient a non-exclusive, worldwide, royalty-free patent\r\nlicense under Licensed Patents to make, use, sell, offer to sell,\r\nimport and otherwise transfer the Contribution of such Contributor,\r\nif any, in source code and object code form. This patent license\r\nshall apply to the combination of the Contribution and the Program\r\nif, at the time the Contribution is added by the Contributor, such\r\naddition of the Contribution causes such combination to be covered by\r\nthe Licensed Patents. The patent license shall not apply to any\r\nother combinations which include the Contribution. No hardware per\r\nse is licensed hereunder.\r\n\r\nc.  Recipient understands that although each Contributor grants the\r\nlicenses to its Contributions set forth herein, no assurances are\r\nprovided by any Contributor that the Program does not infringe the\r\npatent or other intellectual property rights of any other entity.\r\nEach Contributor disclaims any liability to Recipient for claims\r\nbrought by any other entity based on infringement of intellectual\r\nproperty rights or otherwise. As a condition to exercising the\r\nrights and licenses granted hereunder, each Recipient hereby assumes\r\nsole responsibility to secure any other intellectual property rights\r\nneeded, if any. For example, if a third party patent license is\r\nrequired to allow Recipient to distribute the Program, it is\r\nRecipient's responsibility to acquire that license before\r\ndistributing the Program.\r\n\r\nd.  Each Contributor represents that to its knowledge it has\r\nsufficient copyright rights in its Contribution, if any, to grant the\r\ncopyright license set forth in this Agreement.\r\n\r\n3. REQUIREMENTS\r\nA Contributor may choose to distribute\r\nthe Program in object code form under its own license agreement,\r\nprovided that:\r\n\r\na.  it complies with the terms and conditions of this Agreement; and\r\nb.  its license agreement:\r\n\ti.  effectively disclaims on behalf of all Contributors all warranties\r\n\tand conditions, express and implied, including warranties or\r\n\tconditions of title and non-infringement, and implied warranties or\r\n\tconditions of merchantability and fitness for a particular purpose;\r\n\tii.  effectively excludes on behalf of all Contributors all liability\r\n\tfor damages, including direct, indirect, special, incidental and\r\n\tconsequential damages, such as lost profits;\r\n\tiii.  states that any provisions which differ from this Agreement are\r\n\toffered by that Contributor alone and not by any other party; and\r\n\tiv.  states that source code for the Program is available from such\r\n\tContributor, and informs licensees how to obtain it in a reasonable\r\n\tmanner on or through a medium customarily used for software exchange.\r\n\r\nWhen the Program is made available in source code form:\r\na.  it must be made available under this Agreement; and\r\nb.  a copy of this Agreement must be included with each copy of the\r\nProgram.\r\n\r\nEach Contributor must include the following in a conspicuous location in the Program:\r\n\r\n\tCopyright (C) 1996, 1999 International Business Machines Corporation and others. All Rights Reserved.\r\n\r\nIn addition, each Contributor must identify itself as the originator\r\nof its Contribution, if any, in a manner that reasonably allows\r\nsubsequent Recipients to identify the originator of the Contribution.\r\n\r\n4. COMMERCIAL DISTRIBUTION\r\nCommercial distributors of software may accept certain\r\nresponsibilities with respect to end users, business partners and the\r\nlike. While this license is intended to facilitate the commercial\r\nuse of the Program, the Contributor who includes the Program in a\r\ncommercial product offering should do so in a manner which does not\r\ncreate potential liability for other Contributors. Therefore, if a\r\nContributor includes the Program in a commercial product offering,\r\nsuch Contributor (\"Commercial Contributor\") hereby agrees to defend\r\nand indemnify every other Contributor (\"Indemnified Contributor\")\r\nagainst any losses, damages and costs (collectively \"Losses\") arising\r\nfrom claims, lawsuits and other legal actions brought by a third\r\nparty against the Indemnified Contributor to the extent caused by the\r\nacts or omissions of such Commercial Contributor in connection with\r\nits distribution of the Program in a commercial product offering.\r\nThe obligations in this section do not apply to any claims or Losses\r\nrelating to any actual or alleged intellectual property infringement.\r\nIn order to qualify, an Indemnified Contributor must: a) promptly\r\nnotify the Commercial Contributor in writing of such claim, and b)\r\nallow the Commercial Contributor to control, and cooperate with the\r\nCommercial Contributor in, the defense and any related settlement\r\nnegotiations. The Indemnified Contributor may participate in any\r\nsuch claim at its own expense.\r\n\r\nFor example, a Contributor might include the Program in a commercial\r\nproduct offering, Product X. That Contributor is then a Commercial\r\nContributor. If that Commercial Contributor then makes performance\r\nclaims, or offers warranties related to Product X, those performance\r\nclaims and warranties are such Commercial Contributor's\r\nresponsibility alone. Under this section, the Commercial Contributor\r\nwould have to defend claims against the other Contributors related to\r\nthose performance claims and warranties, and if a court requires any\r\nother Contributor to pay any damages as a result, the Commercial\r\nContributor must pay those damages.\r\n\r\n5. NO WARRANTY\r\nEXCEPT AS EXPRESSLY SET FORTH IN THIS AGREEMENT, THE PROGRAM IS\r\nPROVIDED ON AN \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY\r\nKIND, EITHER EXPRESS OR IMPLIED INCLUDING, WITHOUT LIMITATION, ANY\r\nWARRANTIES OR CONDITIONS OF TITLE, NON-INFRINGEMENT, MERCHANTABILITY\r\nOR FITNESS FOR A PARTICULAR PURPOSE. Each Recipient is solely\r\nresponsible for determining the appropriateness of using and\r\ndistributing the Program and assumes all risks associated with its\r\nexercise of rights under this Agreement, including but not limited to\r\nthe risks and costs of program errors, compliance with applicable\r\nlaws, damage to or loss of data, programs or equipment, and\r\nunavailability or interruption of operations.\r\n\r\n6. DISCLAIMER OF LIABILITY\r\nEXCEPT AS EXPRESSLY SET FORTH IN THIS AGREEMENT, NEITHER RECIPIENT\r\nNOR ANY CONTRIBUTORS SHALL HAVE ANY LIABILITY FOR ANY DIRECT,\r\nINDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES\r\n(INCLUDING WITHOUT LIMITATION LOST PROFITS), HOWEVER CAUSED AND ON\r\nANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR\r\nTORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF\r\nTHE USE OR DISTRIBUTION OF THE PROGRAM OR THE EXERCISE OF ANY RIGHTS\r\nGRANTED HEREUNDER, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\r\n\r\n7. GENERAL\r\nIf any provision of this Agreement is invalid or unenforceable under\r\napplicable law, it shall not affect the validity or enforceability of\r\nthe remainder of the terms of this Agreement, and without further\r\naction by the parties hereto, such provision shall be reformed to the\r\nminimum extent necessary to make such provision valid and enforceable.\r\n\r\nIf Recipient institutes patent litigation against a Contributor with\r\nrespect to a patent applicable to software (including a cross-claim\r\nor counterclaim in a lawsuit), then any patent licenses granted by\r\nthat Contributor to such Recipient under this Agreement shall\r\nterminate as of the date such litigation is filed. In addition, if\r\nRecipient institutes patent litigation against any entity (including\r\na cross-claim or counterclaim in a lawsuit) alleging that the Program\r\nitself (excluding combinations of the Program with other software or\r\nhardware) infringes such Recipient's patent(s), then such Recipient's\r\nrights granted under Section 2(b) shall terminate as of the date such\r\nlitigation is filed.\r\n\r\nAll Recipient's rights under this Agreement shall terminate if it\r\nfails to comply with any of the material terms or conditions of this\r\nAgreement and does not cure such failure in a reasonable period of\r\ntime after becoming aware of such noncompliance. If all Recipient's\r\nrights under this Agreement terminate, Recipient agrees to cease use\r\nand distribution of the Program as soon as reasonably practicable.\r\nHowever, Recipient's obligations under this Agreement and any\r\nlicenses granted by Recipient relating to the Program shall continue\r\nand survive.\r\n\r\nIBM may publish new versions (including revisions) of this Agreement\r\nfrom time to time. Each new version of the Agreement will be given a\r\ndistinguishing version number. The Program (including Contributions)\r\nmay always be distributed subject to the version of the Agreement\r\nunder which it was received. In addition, after a new version of the\r\nAgreement is published, Contributor may elect to distribute the\r\nProgram (including its Contributions) under the new version. No one\r\nother than IBM has the right to modify this Agreement. Except as\r\nexpressly stated in Sections 2(a) and 2(b) above, Recipient receives\r\nno rights or licenses to the intellectual property of any Contributor\r\nunder this Agreement, whether expressly, by implication, estoppel or\r\notherwise. All rights in the Program not expressly granted under\r\nthis Agreement are reserved.\r\n\r\nThis Agreement is governed by the laws of the State of New York and\r\nthe intellectual property laws of the United States of America. No\r\nparty to this Agreement will bring a legal action under this\r\nAgreement more than one year after the cause of action arose. Each\r\nparty waives its rights to a jury trial in any resulting litigation.","seeAlso":["http:\/\/www.opensource.org\/licenses\/IPL-1.0"],"standardLicenseHeader":""}