
      <div class="optional-license-text">
         <p>CONTRAT DE LICENCE DE LOGICIEL LIBRE CeCILL</p>

      </div>
      <div class="optional-license-text">
         <p>Avertissement 
        <br />

Ce contrat est une licence de logiciel libre issue d'une concertation entre ses auteurs afin que le
             respect de deux grands principes pr&eacute;side &agrave; sa r&eacute;daction: 
      </p>

         
<ul style="list-style:none">
<li>
               
<var class="replacable-license-text">&bull;</var>
          d'une part, sa conformit&eacute; au droit fran&ccedil;ais, tant au regard du droit de la responsabilit&eacute; civile
             que du droit de la propri&eacute;t&eacute; intellectuelle et de la protection qu'il offre aux auteurs et
             titulaires des droits patrimoniaux sur un logiciel.
        </li>
<li>
               
<var class="replacable-license-text">&bull;</var>
          d'autre part, le respect des principes de diffusion des logiciels libres: acc&egrave;s au code source,
             droits &eacute;tendus conf&eacute;r&eacute;s aux utilisateurs.
        </li>
</ul>
         <p>Les auteurs de la licence CeCILL1 sont:</p>

         <p>Commissariat &agrave; l'Energie Atomique &ndash; CEA, &eacute;tablissement public de caract&egrave;re scientifique technique et
         industriel, dont le si&egrave;ge est situ&eacute; 31-33 rue de la F&eacute;d&eacute;ration, 75752 PARIS cedex 15.</p>

         <p>Centre National de la Recherche Scientifique &ndash; CNRS, &eacute;tablissement public &agrave; caract&egrave;re scientifique et
         technologique, dont le si&egrave;ge est situ&eacute; 3 rue Michel-Ange 75794 Paris cedex 16.</p>

         <p>Institut National de Recherche en Informatique et en Automatique &ndash; INRIA, &eacute;tablissement public &agrave;
         caract&egrave;re scientifique et technologique, dont le si&egrave;ge est situ&eacute; Domaine de Voluceau, Rocquencourt, BP
         105, 78153 Le Chesnay cedex.</p>

      </div>
      <p>PREAMBULE</p>

      <p>Ce contrat est une licence de logiciel libre dont l'objectif est de conf&eacute;rer aux utilisateurs la libert&eacute;
         de modification et de redistribution du logiciel r&eacute;gi par cette licence dans le cadre d'un mod&egrave;le de
         diffusion &laquo;open source&raquo;.</p>

      <p>L'exercice de ces libert&eacute;s est assorti de certains devoirs &agrave; la charge des utilisateurs afin de pr&eacute;server
         ce statut au cours des redistributions ult&eacute;rieures.</p>

      <p>L'accessibilit&eacute; au code source et les droits de copie, de modification et de redistribution qui en
         d&eacute;coulent ont pour contrepartie de n'offrir aux utilisateurs qu'une garantie limit&eacute;e et de ne faire
         peser sur l'auteur du logiciel, le titulaire des droits patrimoniaux et les conc&eacute;dants successifs
         qu'une responsabilit&eacute; restreinte.</p>

      <p>A cet &eacute;gard l'attention de l'utilisateur est attir&eacute;e sur les risques associ&eacute;s au chargement, &agrave;
         l'utilisation, &agrave; la modification et/ou au d&eacute;veloppement et &agrave; la reproduction du logiciel par
         l'utilisateur &eacute;tant donn&eacute; sa sp&eacute;cificit&eacute; de logiciel libre, qui peut le rendre complexe &agrave; manipuler et
         qui le r&eacute;serve donc &agrave; des d&eacute;veloppeurs et des professionnels avertis poss&eacute;dant des connaissances
         informatiques approfondies. Les utilisateurs sont donc invit&eacute;s &agrave; charger et tester l'ad&eacute;quation du
         Logiciel &agrave; leurs besoins dans des conditions permettant d'assurer la s&eacute;curit&eacute; de leurs syst&egrave;mes et ou
         de leurs donn&eacute;es et, plus g&eacute;n&eacute;ralement, &agrave; l'utiliser et l'exploiter dans les m&ecirc;me conditions de
         s&eacute;curit&eacute;. Ce contrat peut &ecirc;tre reproduit et diffus&eacute; librement, sous r&eacute;serve de le conserver en l'&eacute;tat,
         sans ajout ni suppression de clauses.</p>

      <p>Ce contrat est susceptible de s'appliquer &agrave; tout logiciel dont le titulaire des droits patrimoniaux
         d&eacute;cide de soumettre l'exploitation aux dispositions qu'il contient.</p>


      <p>Article 1er - DEFINITIONS</p>

      <p>Dans ce contrat, les termes suivants, lorsqu'ils seront &eacute;crits avec une lettre capitale, auront la
         signification suivante:</p>

      <p>Contrat: d&eacute;signe le pr&eacute;sent contrat de licence, ses &eacute;ventuelles versions post&eacute;rieures et annexes.</p>

      <p>Logiciel: d&eacute;signe le logiciel sous sa forme de Code Objet et/ou de Code Source et le cas &eacute;ch&eacute;ant sa
         documentation, dans leur &eacute;tat au moment de l'acceptation du 
        <br />

Contrat par le Licenci&eacute;. 
      </p>

      <p>Logiciel Initial: d&eacute;signe le Logiciel sous sa forme de Code Source et de Code Objet et le cas &eacute;ch&eacute;ant sa
         documentation, dans leur &eacute;tat au moment de leur premi&egrave;re diffusion sous les termes du Contrat.</p>

      <p>Logiciel Modifi&eacute;: d&eacute;signe le Logiciel modifi&eacute; par au moins une Contribution.</p>

      <p>Code Source: d&eacute;signe l'ensemble des instructions et des lignes de programme du Logiciel et auquel l'acc&egrave;s
         est n&eacute;cessaire en vue de modifier le Logiciel.</p>

      <p>Code Objet: d&eacute;signe les fichiers binaires issus de la compilation du Code Source.</p>

      <p>Titulaire : d&eacute;signe le d&eacute;tenteur des droits patrimoniaux d'auteur sur le Logiciel Initial.</p>

      <p>Licenci&eacute;(s): d&eacute;signe le ou les utilisateur(s) du Logiciel ayant accept&eacute; le Contrat.</p>

      <p>Contributeur: d&eacute;signe le Licenci&eacute; auteur d'au moins une Contribution.</p>

      <p>Conc&eacute;dant: d&eacute;signe le Titulaire ou toute personne physique ou morale distribuant le Logiciel sous le
         Contrat.</p>

      <p>Contributions: d&eacute;signe l'ensemble des modifications, corrections, traductions, adaptations et/ou
         nouvelles fonctionnalit&eacute;s int&eacute;gr&eacute;es dans le Logiciel par tout</p>

      <p>Contributeur, ainsi que les Modules Statiques.</p>

      <p>Module: d&eacute;signe un ensemble de fichiers sources y compris leur documentation qui, une fois compil&eacute; sous
         forme ex&eacute;cutable, permet de r&eacute;aliser des fonctionnalit&eacute;s ou 
        <br />

services suppl&eacute;mentaires &agrave; ceux fournis par le Logiciel. 
      </p>

      <p>Module Dynamique: d&eacute;signe tout Module, cr&eacute;&eacute; par le Contributeur, ind&eacute;pendant du Logiciel, tel que ce
         Module et le Logiciel sont sous forme de deux ex&eacute;cutables ind&eacute;pendants qui s'ex&eacute;cutent dans un espace
         d'adressage ind&eacute;pendant, l'un appelant l'autre au moment de leur ex&eacute;cution.</p>

      <p>Module Statique: d&eacute;signe tout Module cr&eacute;&eacute; par le Contributeur et li&eacute; au Logiciel par un lien statique
         rendant leur code objet d&eacute;pendant l'un de l'autre. Ce Module et le Logiciel auquel il est li&eacute;, sont
         regroup&eacute;s en un seul ex&eacute;cutable.</p>

      <p>Parties: d&eacute;signe collectivement le Licenci&eacute; et le Conc&eacute;dant.</p>

      <p>Ces termes s'entendent au singulier comme au pluriel.</p>

      <p>Article 2 - OBJET</p>

      <p>Le Contrat a pour objet la concession par le Conc&eacute;dant au Licenci&eacute; d'une Licence non exclusive,
         transf&eacute;rable et mondiale du Logiciel telle que d&eacute;finie ci-apr&egrave;s &agrave; l'article 5 pour toute la dur&eacute;e de
         protection des droits portant sur ce Logiciel.</p>

      <p>Article 3 - ACCEPTATION</p>

      
<ul style="list-style:none">
<li>
            
<var class="replacable-license-text">3.1.</var>
          L'acceptation par le Licenci&eacute; des termes du Contrat est r&eacute;put&eacute;e acquise du fait du premier des
             faits suivants:
          
<ul style="list-style:none">
<li>
                  
<var class="replacable-license-text">&bull;</var>
              (i) le chargement du Logiciel par tout moyen notamment par t&eacute;l&eacute;chargement &agrave; partir d'un
                 serveur distant ou par chargement &agrave; partir d'un support physique;
            </li>
<li>
                  
<var class="replacable-license-text">&bull;</var>
              (ii) le premier exercice par le Licenci&eacute; de l'un quelconque des droits conc&eacute;d&eacute;s par le Contrat.
            </li>
</ul>
        </li>
<li>
            
<var class="replacable-license-text">3.2.</var>
          Un exemplaire du Contrat, contenant notamment un avertissement relatif aux sp&eacute;cificit&eacute;s du
             Logiciel, &agrave; la restriction de garantie et &agrave; la limitation &agrave; un usage par des utilisateurs
             exp&eacute;riment&eacute;s a &eacute;t&eacute; mis &agrave; disposition du Licenci&eacute; pr&eacute;alablement &agrave; son acceptation telle que
             d&eacute;finie &agrave; l'article 3.1 ci dessus et le Licenci&eacute; reconna&icirc;t en avoir pris connaissances.
        </li>
</ul>
      <p>Article 4 - ENTREE EN VIGUEUR ET DUREE</p>

      
<ul style="list-style:none">
<li>
            
<var class="replacable-license-text">4.1.</var>
          ENTREE EN VIGUEUR
          <p>Le Contrat entre en vigueur &agrave; la date de son acceptation par le Licenci&eacute; telle que d&eacute;finie en 3.1.</p>

        </li>
<li>
            
<var class="replacable-license-text">4.2.</var>
          DUREE
          <p>Le Contrat produira ses effets pendant toute la dur&eacute;e l&eacute;gale de protection des droits
             patrimoniaux portant sur le Logiciel.</p>

        </li>
</ul>
      <p>Article 5 - ETENDUE DES DROITS CONCEDES</p>

      <p>Le Conc&eacute;dant conc&egrave;de au Licenci&eacute;, qui accepte, les droits suivants sur le Logiciel pour toutes
         destinations et pour la dur&eacute;e du Contrat dans les conditions ci-apr&egrave;s d&eacute;taill&eacute;es.</p>

      <p>Par ailleurs, le Conc&eacute;dant conc&egrave;de au Licenci&eacute; &agrave; titre gracieux les droits d'exploitation du ou
         des brevets qu'il d&eacute;tient sur tout ou partie des inventions 
         <br />

impl&eacute;ment&eacute;es dans le Logiciel. 
      </p>

      
<ul style="list-style:none">
<li>
            
<var class="replacable-license-text">5.1.</var>
          DROITS D'UTILISATION 
          <p>Le Licenci&eacute; est autoris&eacute; &agrave; utiliser le Logiciel, sans restriction quant aux domaines
             d'application, &eacute;tant ci-apr&egrave;s pr&eacute;cis&eacute; que cela comporte:
          </p>

            
<ul style="list-style:none">
<li>
                  
<var class="replacable-license-text">1.</var>
              la reproduction permanente ou provisoire du Logiciel en tout ou partie par tout moyen et sous
                 toute forme.
            </li>
<li>
                  
<var class="replacable-license-text">2.</var>
              le chargement, l'affichage, l'ex&eacute;cution, ou le stockage du Logiciel sur tout support.
            </li>
<li>
                  
<var class="replacable-license-text">3.</var>
              la possibilit&eacute; d'en observer, d'en &eacute;tudier, ou d'en tester le fonctionnement afin de
                 d&eacute;terminer les id&eacute;es et principes qui sont &agrave; la base de n'importe quel &eacute;l&eacute;ment de ce
                 Logiciel; et ceci, lorsque le Licenci&eacute; effectue toute op&eacute;ration de chargement,
                 d'affichage, d'ex&eacute;cution, de transmission ou de stockage du Logiciel qu'il est en droit
                 d'effectuer en vertu du Contrat.
            </li>
</ul>
        </li>
<li>
            
<var class="replacable-license-text">5.2.</var>
          DROIT D'APPORTER DES CONTRIBUTIONS
          <p>Le droit d'apporter des Contributions comporte le droit de traduire, d'adapter, d'arranger ou
             d'apporter toute autre modification du Logiciel et le droit de reproduire le Logiciel en
             r&eacute;sultant.</p>

            <p>Le Licenci&eacute; est autoris&eacute; &agrave; apporter toute Contribution au Logiciel sous r&eacute;serve de mentionner, de
             fa&ccedil;on explicite, son nom en tant qu'auteur de cette Contribution et la date de cr&eacute;ation de
             celle-ci.</p>

        </li>
<li>
            
<var class="replacable-license-text">5.3.</var>
          DROITS DE DISTRIBUTION ET DE DIFFUSION
          <p>Le droit de distribution et de diffusion comporte notamment le droit de transmettre et de
             communiquer le Logiciel au public sur tout support et par tout moyen ainsi que le droit de
             mettre sur le march&eacute; &agrave; titre on&eacute;reux ou gratuit, un ou des exemplaires du Logiciel par tout
             proc&eacute;d&eacute;.</p>

            <p>Le Licenci&eacute; est autoris&eacute; &agrave; redistribuer des copies du Logiciel, modifi&eacute; ou non, &agrave; des tiers dans
             les conditions ci-apr&egrave;s d&eacute;taill&eacute;es.</p>

            
<ul style="list-style:none">
<li>
                  
<var class="replacable-license-text">5.3.1.</var>
              REDISTRIBUTION DU LOGICIEL SANS MODIFICATION
              <p>Le Licenci&eacute; est autoris&eacute; &agrave; redistribuer des copies conformes du Logiciel, sous forme de
                 Code Source ou de Code Objet, &agrave; condition que cette redistribution respecte les
                 dispositions du Contrat dans leur totalit&eacute; et soit accompagn&eacute;e: 
              </p>

                  
<ul style="list-style:none">
<li>
                        
<var class="replacable-license-text">1.</var>
                  d'un exemplaire du Contrat,
                </li>
<li>
                        
<var class="replacable-license-text">2.</var>
                  d'un avertissement relatif &agrave; la restriction de garantie et de responsabilit&eacute; du Conc&eacute;dant
                     telle que pr&eacute;vue aux articles 8 et 9, 
                     <br />

         et que, dans le cas o&ugrave; seul le Code Objet du Logiciel est redistribu&eacute;, le Licenci&eacute;
                     permette aux futurs Licenci&eacute;s d'acc&eacute;der facilement au Code Source complet du
                     Logiciel en indiquant les modalit&eacute;s d'acc&egrave;s, &eacute;tant entendu que le co&ucirc;t additionnel
                     d'acquisition du Code Source ne devra pas exc&eacute;der le simple co&ucirc;t de transfert des
                     donn&eacute;es. 
                  
                </li>
</ul>
               </li>
<li>
                  
<var class="replacable-license-text">5.3.2.</var>
              REDISTRIBUTION DU LOGICIEL MODIFIE
              <p>Lorsque le Licenci&eacute; apporte une Contribution au Logiciel, les conditions de
                redistribution du Logiciel Modifi&eacute; sont alors soumises &agrave; l'int&eacute;gralit&eacute; des
                dispositions du Contrat. 
                <br />

      Le Licenci&eacute; est autoris&eacute; &agrave; redistribuer le Logiciel Modifi&eacute;, sous forme de Code Source
                ou de Code Objet, &agrave; condition que cette redistribution respecte les dispositions
                du Contrat dans leur totalit&eacute; et soit accompagn&eacute;e:
              </p>

                  
<ul style="list-style:none">
<li>
                        
<var class="replacable-license-text">1.</var>
                  d'un exemplaire du Contrat,
                </li>
<li>
                        
<var class="replacable-license-text">2.</var>
                  d'un avertissement relatif &agrave; la restriction de garantie et de responsabilit&eacute; du conc&eacute;dant
                     telle que pr&eacute;vue aux articles 8 et 9, 
                     <br />

         et que, dans le cas o&ugrave; seul le Code Objet du Logiciel Modifi&eacute; est redistribu&eacute;, le
                     Licenci&eacute; permette aux futurs Licenci&eacute;s d'acc&eacute;der facilement au Code Source complet
                     du Logiciel Modifi&eacute; en indiquant les modalit&eacute;s d'acc&egrave;s, &eacute;tant entendu que le co&ucirc;t
                     additionnel d'acquisition du Code Source ne devra pas exc&eacute;der le simple co&ucirc;t de
                     transfert des donn&eacute;es. 
                  
                </li>
</ul>
               </li>
<li>
                  
<var class="replacable-license-text">5.3.3.</var>
              REDISTRIBUTION DES MODULES DYNAMIQUES
              <p>Lorsque le Licenci&eacute; a d&eacute;velopp&eacute; un Module Dynamique les conditions du Contrat ne
                  s'appliquent pas &agrave; ce Module Dynamique, qui peut &ecirc;tre distribu&eacute; sous un contrat de
                 licence diff&eacute;rent. 
              </p>

               </li>
<li>
                  
<var class="replacable-license-text">5.3.4.</var>
              COMPATIBILITE AVEC LA LICENCE GPL
              <p>Dans le cas o&ugrave; le Logiciel, Modifi&eacute; ou non, est int&eacute;gr&eacute; &agrave; un code soumis aux
                 dispositions de la licence GPL, le Licenci&eacute; est autoris&eacute; &agrave; redistribuer l'ensemble
                 sous la licence GPL.</p>

                  <p>Dans le cas o&ugrave; le Logiciel Modifi&eacute; int&egrave;gre un code soumis aux dispositions de la
                 licence GPL, le Licenci&eacute; est autoris&eacute; &agrave; redistribuer le Logiciel Modifi&eacute; sous la
                 licence GPL. 
              </p>

               </li>
</ul>
        </li>
</ul>
      <p>Article 6 - PROPRIETE INTELLECTUELLE</p>

      
<ul style="list-style:none">
<li>
            
<var class="replacable-license-text">6.1.</var>
          SUR LE LOGICIEL INITIAL
          <p>Le Titulaire est d&eacute;tenteur des droits patrimoniaux sur le Logiciel Initial. Toute
             utilisation du Logiciel Initial est soumise au respect des conditions dans lesquelles
             le Titulaire a choisi de diffuser son &oelig;uvre et nul autre n'a la facult&eacute; de modifier
             les conditions de diffusion de ce Logiciel Initial. 
             <br />

   Le Titulaire s'engage &agrave; maintenir la diffusion du Logiciel initial sous les conditions du
             Contrat et ce, pour la dur&eacute;e vis&eacute;e &agrave; l'article 4.2. 
          </p>

        </li>
<li>
            
<var class="replacable-license-text">6.2.</var>
          SUR LES CONTRIBUTIONS
          <p>Les droits de propri&eacute;t&eacute; intellectuelle sur les Contributions sont attach&eacute;s au titulaire de
             droits patrimoniaux d&eacute;sign&eacute; par la l&eacute;gislation applicable. 
          </p>

        </li>
<li>
            
<var class="replacable-license-text">6.3.</var>
          SUR LES MODULES DYNAMIQUES
          <p>Le Licenci&eacute; ayant d&eacute;velopp&eacute; un Module Dynamique est titulaire des droits de propri&eacute;t&eacute;
             intellectuelle sur ce Module Dynamique et reste libre du choix du contrat r&eacute;gissant sa
             diffusion. 
          </p>

        </li>
<li>
            
<var class="replacable-license-text">6.4.</var>
          DISPOSITIONS COMMUNES
          
<ul style="list-style:none">
<li>
                  
<var class="replacable-license-text">6.4.1.</var>
              Le Licenci&eacute; s'engage express&eacute;ment:
              
<ul style="list-style:none">
<li>
                        
<var class="replacable-license-text">1.</var>
                  &agrave; ne pas supprimer ou modifier de quelque mani&egrave;re que ce soit les mentions de propri&eacute;t&eacute;
                     intellectuelle appos&eacute;es sur le Logiciel;
                </li>
<li>
                        
<var class="replacable-license-text">2.</var>
                  &agrave; reproduire &agrave; l'identique lesdites mentions de propri&eacute;t&eacute; intellectuelle sur les copies du Logiciel. 
                  
                </li>
</ul>
               </li>
<li>
                  
<var class="replacable-license-text">6.4.2.</var>
              Le Licenci&eacute; s'engage &agrave; ne pas porter atteinte, directement ou indirectement, aux
                 droits de propri&eacute;t&eacute; intellectuelle du Titulaire et/ou des Contributeurs et &agrave;
                 prendre, le cas &eacute;ch&eacute;ant, &agrave; l'&eacute;gard de son personnel toutes les mesures n&eacute;cessaires
                 pour assurer le respect des dits droits de propri&eacute;t&eacute; intellectuelle du Titulaire
                 et/ou des Contributeurs. 
              
            </li>
</ul>
        </li>
</ul>
      <p>Article 7 - SERVICES ASSOCIES</p>

      
<ul style="list-style:none">
<li>
            
<var class="replacable-license-text">7.1.</var>
          Le Contrat n'oblige en aucun cas le Conc&eacute;dant &agrave; la r&eacute;alisation de prestations d'assistance
             technique ou de maintenance du Logiciel. 
             <br />

   Cependant le Conc&eacute;dant reste libre de proposer ce type de services. Les termes et
             conditions d'une telle assistance technique et/ou d'une telle maintenance seront alors
             d&eacute;termin&eacute;s dans un acte s&eacute;par&eacute;. Ces actes de maintenance et/ou assistance technique
             n'engageront que la seule responsabilit&eacute; du Conc&eacute;dant qui les propose. 
          
        </li>
<li>
            
<var class="replacable-license-text">7.2.</var>
          De m&ecirc;me, tout Conc&eacute;dant est libre de proposer, sous sa seule responsabilit&eacute;, &agrave; ses licenci&eacute;s une
             garantie, qui n'engagera que lui, lors de la redistribution du Logiciel et/ou du Logiciel
             Modifi&eacute; et ce, dans les conditions qu'il souhaite. Cette garantie et les modalit&eacute;s financi&egrave;res
             de son application feront l'objet d'un acte s&eacute;par&eacute; entre le Conc&eacute;dant et le Licenci&eacute;.
          
        </li>
</ul>
      <p>Article 8 - RESPONSABILITE</p>

      
<ul style="list-style:none">
<li>
            
<var class="replacable-license-text">8.1.</var>
          Sous r&eacute;serve des dispositions de l'article 8.2, si le Conc&eacute;dant n'ex&eacute;cute pas tout ou partie des
             obligations mises &agrave; sa charge par le Contrat, le Licenci&eacute; a la facult&eacute;, sous r&eacute;serve de
             prouver la faute du Conc&eacute;dant concern&eacute;, de solliciter la r&eacute;paration du pr&eacute;judice direct qu'il
             subit et dont il apportera la preuve.
        </li>
<li>
            
<var class="replacable-license-text">8.2.</var>
          La responsabilit&eacute; du Conc&eacute;dant est limit&eacute;e aux engagements pris en application du Contrat et ne
             saurait &ecirc;tre engag&eacute;e en raison notamment:(i) des dommages dus &agrave; l'inex&eacute;cution, totale ou
             partielle, de ses obligations par le Licenci&eacute;, (ii) des dommages directs ou indirects
             d&eacute;coulant de l'utilisation ou des performances du Logiciel subis par le Licenci&eacute; lorsqu'il
             s'agit d'un professionnel utilisant le Logiciel &agrave; des fins professionnelles et (iii) des
             dommages indirects d&eacute;coulant de l'utilisation ou des performances du Logiciel. Les Parties
             conviennent express&eacute;ment que tout pr&eacute;judice financier ou commercial (par exemple perte de
             donn&eacute;es, perte de b&eacute;n&eacute;fices, perte d'exploitation, perte de client&egrave;le ou de commandes, manque
             &agrave; gagner, trouble commercial quelconque) ou toute action dirig&eacute;e contre le Licenci&eacute; par un
             tiers, constitue un dommage indirect et n'ouvre pas droit &agrave; r&eacute;paration par le Conc&eacute;dant.
        </li>
</ul>
      <p>Article 9 - GARANTIE</p>

      
<ul style="list-style:none">
<li>
            
<var class="replacable-license-text">9.1.</var>
          Le Licenci&eacute; reconna&icirc;t que l'&eacute;tat actuel des connaissances scientifiques et techniques au moment
             de la mise en circulation du Logiciel ne permet pas d'en tester et d'en v&eacute;rifier toutes les
             utilisations ni de d&eacute;tecter l'existence d'&eacute;ventuels d&eacute;fauts. L'attention du Licenci&eacute; a &eacute;t&eacute;
             attir&eacute;e sur ce point sur les risques associ&eacute;s au chargement, &agrave; l'utilisation, la modification
             et/ou au d&eacute;veloppement et &agrave; la reproduction du Logiciel qui sont r&eacute;serv&eacute;s &agrave; des utilisateurs
             avertis. 
             <br />

   Il rel&egrave;ve de la responsabilit&eacute; du Licenci&eacute; de contr&ocirc;ler, par tous moyens, l'ad&eacute;quation du
             produit &agrave; ses besoins, son bon fonctionnement et de s'assurer qu'il ne causera pas de
             dommages aux personnes et aux biens. 
          
        </li>
<li>
            
<var class="replacable-license-text">9.2.</var>
          Le Conc&eacute;dant d&eacute;clare de bonne foi &ecirc;tre en droit de conc&eacute;der l'ensemble des droits attach&eacute;s au
             Logiciel (comprenant notamment les droits vis&eacute;s &agrave; l'article 5).
        </li>
<li>
            
<var class="replacable-license-text">9.3.</var>
          Le Licenci&eacute; reconna&icirc;t que le Logiciel est fourni &laquo;en l'&eacute;tat&raquo; par le Conc&eacute;dant sans autre
             garantie, expresse ou tacite, que celle pr&eacute;vue &agrave; l'article 9.2 et notamment sans aucune
             garantie sur sa valeur commerciale, son caract&egrave;re s&eacute;curis&eacute;, innovant ou pertinent. 
             <br />

   En particulier, le Conc&eacute;dant ne garantit pas que le Logiciel est exempt d'erreur, qu'il
             fonctionnera sans interruption, qu'il sera compatible avec l'&eacute;quipement du Licenci&eacute; et
             sa configuration logicielle ni qu'il remplira les besoins du Licenci&eacute;. 
          
        </li>
<li>
            
<var class="replacable-license-text">9.4.</var>
          Le Conc&eacute;dant ne garantit pas, de mani&egrave;re expresse ou tacite, que le Logiciel ne porte pas
             atteinte &agrave; un quelconque droit de propri&eacute;t&eacute; intellectuelle d'un tiers portant sur un brevet,
             un logiciel ou sur tout autre droit de propri&eacute;t&eacute;. Ainsi, le Conc&eacute;dant exclut toute garantie au
             profit du Licenci&eacute; contre les actions en contrefa&ccedil;on qui pourraient &ecirc;tre diligent&eacute;es au titre
             de l'utilisation, de la modification, et de la redistribution du Logiciel. N&eacute;anmoins, si de
             telles actions sont exerc&eacute;es contre le Licenci&eacute;, le Conc&eacute;dant lui apportera son aide technique
             et juridique pour sa d&eacute;fense. Cette aide technique et juridique est d&eacute;termin&eacute;e au cas par cas
             entre le Conc&eacute;dant concern&eacute; et le Licenci&eacute; dans le cadre d'un protocole d'accord. Le Conc&eacute;dant
             d&eacute;gage toute responsabilit&eacute; quant &agrave; l'utilisation de la d&eacute;nomination du Logiciel par le
             Licenci&eacute;. Aucune garantie n'est apport&eacute;e quant &agrave; l'existence de droits ant&eacute;rieurs sur le nom
             du Logiciel et sur l'existence d'une marque.
        </li>
</ul>
      <p>Article 10 - RESILIATION</p>

      
<ul style="list-style:none">
<li>
            
<var class="replacable-license-text">10.1.</var>
          En cas de manquement par le Licenci&eacute; aux obligations mises &agrave; sa charge par le Contrat, le
             Conc&eacute;dant pourra r&eacute;silier de plein droit le Contrat trente (30) jours apr&egrave;s notification
             adress&eacute;e au Licenci&eacute; et rest&eacute;e sans effet.
        </li>
<li>
            
<var class="replacable-license-text">10.2.</var>
          Le Licenci&eacute; dont le Contrat est r&eacute;sili&eacute; n'est plus autoris&eacute; &agrave; utiliser, modifier ou distribuer le
             Logiciel. Cependant, toutes les licences qu'il aura conc&eacute;d&eacute;es ant&eacute;rieurement &agrave; la r&eacute;siliation
             du Contrat resteront valides sous r&eacute;serve qu'elles aient &eacute;t&eacute; effectu&eacute;es en conformit&eacute; avec le
             Contrat.
        </li>
</ul>
      <p>Article 11 - DISPOSITIONS DIVERSES</p>

      
<ul style="list-style:none">
<li>
            
<var class="replacable-license-text">11.1.</var>
          CAUSE EXTERIEURE
          <p>Aucune des Parties ne sera responsable d'un retard ou d'une d&eacute;faillance d'ex&eacute;cution du
             Contrat qui serait d&ucirc; &agrave; un cas de force majeure, un cas fortuit ou une cause
             ext&eacute;rieure, telle que, notamment, le mauvais fonctionnement ou les interruptions du
             r&eacute;seau &eacute;lectrique ou de t&eacute;l&eacute;communication, la paralysie du r&eacute;seau li&eacute;e &agrave; une attaque
             informatique, l'intervention des autorit&eacute;s gouvernementales, les catastrophes
             naturelles, les d&eacute;g&acirc;ts des eaux, les tremblements de terre, le feu, les explosions,
             les gr&egrave;ves et les conflits sociaux, l'&eacute;tat de guerre&hellip; 
          </p>

        </li>
<li>
            
<var class="replacable-license-text">11.2.</var>
          Le fait, par l'une ou l'autre des Parties, d'omettre en une ou plusieurs occasions de se
             pr&eacute;valoir d'une ou plusieurs dispositions du Contrat, ne pourra en aucun cas impliquer
             renonciation par la Partie int&eacute;ress&eacute;e &agrave; s'en pr&eacute;valoir ult&eacute;rieurement.
        </li>
<li>
            
<var class="replacable-license-text">11.3.</var>
          Le Contrat annule et remplace toute convention ant&eacute;rieure, &eacute;crite ou orale, entre les Parties sur
             le m&ecirc;me objet et constitue l'accord entier entre les Parties sur cet objet. Aucune addition ou
             modification aux termes du Contrat n'aura d'effet &agrave; l'&eacute;gard des Parties &agrave; moins d'&ecirc;tre faite
             par &eacute;crit et sign&eacute;e par leurs repr&eacute;sentants d&ucirc;ment habilit&eacute;s.
        </li>
<li>
            
<var class="replacable-license-text">11.4.</var>
          Dans l'hypoth&egrave;se o&ugrave; une ou plusieurs des dispositions du Contrat s'av&egrave;rerait contraire &agrave; une loi
             ou &agrave; un texte applicable, existants ou futurs, cette loi ou ce texte pr&eacute;vaudrait, et les
             Parties feraient les amendements n&eacute;cessaires pour se conformer &agrave; cette loi ou &agrave; ce texte.
             Toutes les autres dispositions resteront en vigueur. De m&ecirc;me, la nullit&eacute;, pour quelque raison
             que ce soit, d'une des dispositions du Contrat ne saurait entra&icirc;ner la nullit&eacute; de l'ensemble
             du Contrat.
        </li>
<li>
            
<var class="replacable-license-text">11.5.</var>
          LANGUE 
          <p>Le Contrat est r&eacute;dig&eacute; en langue fran&ccedil;aise et en langue anglaise. En cas de divergence
             d'interpr&eacute;tation, seule la version fran&ccedil;aise fait foi. 
          </p>

        </li>
</ul>
      <p>Article 12 - NOUVELLES VERSIONS DU CONTRAT</p>

      
<ul style="list-style:none">
<li>
            
<var class="replacable-license-text">12.1.</var>
          Toute personne est autoris&eacute;e &agrave; copier et distribuer des copies de ce Contrat.
        </li>
<li>
            
<var class="replacable-license-text">12.2.</var>
          Afin d'en pr&eacute;server la coh&eacute;rence, le texte du Contrat est prot&eacute;g&eacute; et ne peut &ecirc;tre modifi&eacute; que par
             les auteurs de la licence, lesquels se r&eacute;servent le droit de publier p&eacute;riodiquement des mises
             &agrave; jour ou de nouvelles versions du Contrat, qui poss&egrave;deront chacune un num&eacute;ro distinct. Ces
             versions ult&eacute;rieures seront susceptibles de prendre en compte de nouvelles probl&eacute;matiques
             rencontr&eacute;es par les logiciels libres.
        </li>
<li>
            
<var class="replacable-license-text">12.3.</var>
          Tout Logiciel diffus&eacute; sous une version donn&eacute;e du Contrat ne pourra faire l'objet d'une diffusion
             ult&eacute;rieure que sous la m&ecirc;me version du Contrat ou une version post&eacute;rieure, sous r&eacute;serve des
             dispositions de l'article 5.3.4.
        </li>
</ul>
      <p>Article 13 - LOI APPLICABLE ET COMPETENCE TERRITORIALE</p>

      
<ul style="list-style:none">
<li>
            
<var class="replacable-license-text">13.1.</var>
          Le Contrat est r&eacute;gi par la loi fran&ccedil;aise. Les Parties conviennent de tenter de r&eacute;gler &agrave; l'amiable
             les diff&eacute;rends ou litiges qui viendraient &agrave; se produire par suite ou &agrave; l'occasion du
             Contrat.
        </li>
<li>
            
<var class="replacable-license-text">13.2.</var>
          A d&eacute;faut d'accord amiable dans un d&eacute;lai de deux (2) mois &agrave; compter de leur survenance et sauf
             situation relevant d'une proc&eacute;dure d'urgence, les diff&eacute;rends ou litiges seront port&eacute;s par la
             Partie la plus diligente devant les Tribunaux comp&eacute;tents de Paris.
        </li>
</ul>
      <p>1 Ce: CEA, C: CNRS, I: INRIA, LL: Logiciel Libre</p>


      <div class="optional-license-text">
         <p>Version 1 du 21/06/2004</p>

      </div>
    