
      <div class="optional-license-text">
         <p>Licence Art Libre 1.3 (LAL 1.3)</p>

      </div>
      <p>Pr&eacute;ambule :</p>

      <p>Avec la Licence Art Libre, l'autorisation est donn&eacute;e de copier,
       de diffuser et de transformer librement les &oelig;uvres dans le
       respect des droits de l'auteur.</p>

      <p>Loin d'ignorer ces droits, la Licence Art Libre les reconna&icirc;t et
       les prot&egrave;ge. Elle en reformule l'exercice en permettant &agrave; tout
       un chacun de faire un usage cr&eacute;atif des productions de
       l'esprit quels que soient leur genre et leur forme
       d'expression.</p>

      <p>Si, en r&egrave;gle g&eacute;n&eacute;rale, l'application du droit d'auteur conduit &agrave;
       restreindre l'acc&egrave;s aux &oelig;uvres de l'esprit, la Licence Art
       Libre, au contraire, le favorise. L'intention est d'autoriser
       l'utilisation des ressources d'une &oelig;uvre ; cr&eacute;er de nouvelles
       conditions de cr&eacute;ation pour amplifier les possibilit&eacute;s de
       cr&eacute;ation. La Licence Art Libre permet d'avoir jouissance des
       &oelig;uvres tout en reconnaissant les droits et les responsabilit&eacute;s
       de chacun.</p>

      <p>Avec le d&eacute;veloppement du num&eacute;rique, l'invention d'internet et des
       logiciels libres, les modalit&eacute;s de cr&eacute;ation ont &eacute;volu&eacute; : les
       productions de l'esprit s'offrent naturellement &agrave; la
       circulation, &agrave; l'&eacute;change et aux transformations. Elles se
       pr&ecirc;tent favorablement &agrave; la r&eacute;alisation d'&oelig;uvres communes que
       chacun peut augmenter pour l'avantage de tous.</p>

      <p>C'est la raison essentielle de la Licence Art Libre : promouvoir
       et prot&eacute;ger ces productions de l'esprit selon les principes du
       copyleft : libert&eacute; d'usage, de copie, de diffusion, de
       transformation et interdiction d'appropriation exclusive.</p>

      <p>D&eacute;finitions :</p>

      <p>Nous d&eacute;signons par &laquo; &oelig;uvre &raquo;, autant l'&oelig;uvre initiale, les &oelig;uvres
       cons&eacute;quentes, que l'&oelig;uvre commune telles que d&eacute;finies ci-apr&egrave;s
       :</p>

      <p>L'&oelig;uvre commune : Il s'agit d'une &oelig;uvre qui comprend l'&oelig;uvre initiale 
    ainsi que toutes les contributions post&eacute;rieures (les originaux cons&eacute;quents 
    et les copies). Elle est cr&eacute;&eacute;e &agrave; l'initiative de l'auteur initial qui par 
    cette licence d&eacute;finit les conditions selon lesquelles les contributions 
    sont faites.
    </p>

    
      <p>L'&oelig;uvre initiale : C'est-&agrave;-dire l'&oelig;uvre cr&eacute;&eacute;e par l'initiateur 
    de l'&oelig;uvre commune dont les copies vont &ecirc;tre modifi&eacute;es par qui le souhaite.
    </p>

      <p>Les &oelig;uvres cons&eacute;quentes : C'est-&agrave;-dire les contributions 
    des auteurs qui participent &agrave; la formation de l'&oelig;uvre commune en 
    faisant usage des droits de reproduction, de diffusion et de 
    modification que leur conf&egrave;re la licence.
    </p>

      <p>Originaux (sources ou ressources de l'&oelig;uvre) : Chaque exemplaire 
    dat&eacute; de l'&oelig;uvre initiale ou cons&eacute;quente que leurs auteurs pr&eacute;sentent comme 
    r&eacute;f&eacute;rence pour toutes actualisations, interpr&eacute;tations, 
    copies ou reproductions ult&eacute;rieures.</p>

    
      <p>Copie : Toute reproduction d'un original au sens de cette licence.
    </p>

      
<ul style="list-style:none">
<li>
            
<var class="replacable-license-text">1-</var>
        OBJET.
            <br />

   Cette licence a pour objet de d&eacute;finir les
                 conditions selon lesquelles vous pouvez jouir
                 librement de l'&oelig;uvre.
          
        </li>
<li>
            
<var class="replacable-license-text">2.</var>
          L'&Eacute;TENDUE DE LA JOUISSANCE.
            <br />

   Cette &oelig;uvre est soumise au droit d'auteur, et
                 l'auteur par cette licence vous indique
                 quelles sont vos libert&eacute;s pour la copier, la
                 diffuser et la modifier.
          
        
<ul style="list-style:none">
<li>
                  
<var class="replacable-license-text">2.1</var>
          LA LIBERT&Eacute; DE COPIER (OU DE REPRODUCTION).
            <br />

      Vous avez la libert&eacute; de copier cette &oelig;uvre pour
                 vous, vos amis ou toute autre personne, quelle
                 que soit la technique employ&eacute;e.
          
        </li>
<li>
                  
<var class="replacable-license-text">2.2</var>
          LA LIBERT&Eacute; DE DIFFUSER (INTERPR&Eacute;TER, REPR&Eacute;SENTER, DISTRIBUER).
            <br />

      Vous pouvez diffuser librement les copies de ces
                 &oelig;uvres, modifi&eacute;es ou non, quel que soit le
                 support, quel que soit le lieu, &agrave; titre
                 on&eacute;reux ou gratuit, si vous respectez toutes
                 les conditions suivantes :
                
          
<ul style="list-style:none">
<li>
                        
<var class="replacable-license-text">1.</var>
              joindre aux copies cette licence &agrave; l'identique ou
                 indiquer pr&eacute;cis&eacute;ment o&ugrave; se trouve la licence ;
            </li>
<li>
                        
<var class="replacable-license-text">2.</var>
              indiquer au destinataire le nom de chaque auteur des
                 originaux, y compris le v&ocirc;tre si vous avez modifi&eacute;
                 l'&oelig;uvre ;
            </li>
<li>
                        
<var class="replacable-license-text">3.</var>
              indiquer au destinataire o&ugrave; il pourrait avoir acc&egrave;s aux
                 originaux (initiaux et/ou cons&eacute;quents).
            </li>
</ul>     
                  <p>Les auteurs des originaux pourront, s'ils le souhaitent,
             vous autoriser &agrave; diffuser l'original dans les m&ecirc;mes
             conditions que les copies.</p>

               </li>
<li>
                  
<var class="replacable-license-text">2.3</var>
          LA LIBERT&Eacute; DE MODIFIER.
            <br />

      Vous avez la libert&eacute; de modifier les copies des
                 originaux (initiaux et cons&eacute;quents) dans le
                 respect des conditions suivantes :
          
          
<ul style="list-style:none">
<li>
                        
<var class="replacable-license-text">1.</var>
              celles pr&eacute;vues &agrave; l'article 2.2 en cas de diffusion de la
                 copie modifi&eacute;e ;
            </li>
<li>
                        
<var class="replacable-license-text">2.</var>
              indiquer qu'il s'agit d'une &oelig;uvre modifi&eacute;e et, si
                 possible, la nature de la modification ;
            </li>
<li>
                        
<var class="replacable-license-text">3.</var>
              diffuser cette &oelig;uvre cons&eacute;quente avec la m&ecirc;me licence ou
                 avec toute licence compatible ;
            </li>
<li>
                        
<var class="replacable-license-text">4.</var>
              Les auteurs des originaux pourront, s'ils le souhaitent,
                 vous autoriser &agrave; modifier l'original dans les m&ecirc;mes
                 conditions que les copies.
            </li>
</ul>
               </li>
</ul>
        </li>
<li>
            
<var class="replacable-license-text">3.</var>
          DROITS CONNEXES.
            <br />

   Les actes donnant lieu &agrave; des droits d'auteur ou des
                 droits voisins ne doivent pas constituer un
                 obstacle aux libert&eacute;s conf&eacute;r&eacute;es par cette
                 licence.
          C'est pourquoi, par exemple, les interpr&eacute;tations doivent &ecirc;tre soumises &agrave; la m&ecirc;me licence ou une licence compatible. De m&ecirc;me, l'int&eacute;gration de l'&oelig;uvre &agrave; une base de donn&eacute;es, une compilation ou une anthologie ne doit pas faire obstacle &agrave; la jouissance de l'&oelig;uvre telle que d&eacute;finie par cette licence.
        </li>
<li>
            
<var class="replacable-license-text">4.</var>
          L' INT&Eacute;GRATION DE L'&OElig;UVRE.
            <br />

   Toute int&eacute;gration de cette &oelig;uvre &agrave; un ensemble non
                 soumis &agrave; la LAL doit assurer l'exercice des
                 libert&eacute;s conf&eacute;r&eacute;es par cette licence.
            <br />

   Si l'&oelig;uvre n'est plus accessible ind&eacute;pendamment de
                 l'ensemble, alors l'int&eacute;gration n'est possible
                 qu'&agrave; condition que l'ensemble soit soumis &agrave; la
                 LAL ou une licence compatible.
          
        </li>
<li>
            
<var class="replacable-license-text">5.</var>
          CRIT&Egrave;RES DE COMPATIBILIT&Eacute;.
            <br />

   Une licence est compatible avec la LAL si et seulement si :
          
        
<ul style="list-style:none">
<li>
                  
<var class="replacable-license-text">1.</var>
          elle accorde l'autorisation de copier, diffuser et
             modifier des copies de l'&oelig;uvre, y compris &agrave; des fins
             lucratives, et sans autres restrictions que celles
             qu'impose le respect des autres crit&egrave;res de
             compatibilit&eacute; ;
        </li>
<li>
                  
<var class="replacable-license-text">2.</var>
          elle garantit la paternit&eacute; de l'&oelig;uvre et l'acc&egrave;s aux
             versions ant&eacute;rieures de l'&oelig;uvre quand cet acc&egrave;s est
             possible ;
        </li>
<li>
                  
<var class="replacable-license-text">3.</var>
          elle reconna&icirc;t la LAL &eacute;galement compatible (r&eacute;ciprocit&eacute;) ;
        </li>
<li>
                  
<var class="replacable-license-text">4.</var>
          elle impose que les modifications faites sur l'&oelig;uvre
             soient soumises &agrave; la m&ecirc;me licence ou encore &agrave; une
             licence r&eacute;pondant aux crit&egrave;res de compatibilit&eacute; pos&eacute;s
             par la LAL.
         </li>
</ul>
        </li>
<li>
            
<var class="replacable-license-text">6.</var>
          VOS DROITS INTELLECTUELS.
            <br />

   La LAL n'a pas pour objet de nier vos droits
                 d'auteur sur votre contribution ni vos droits
                 connexes. En choisissant de contribuer &agrave;
                 l'&eacute;volution de cette &oelig;uvre commune, vous
                 acceptez seulement d'offrir aux autres les
                 m&ecirc;mes autorisations sur votre contribution que
                 celles qui vous ont &eacute;t&eacute; accord&eacute;es par cette
                 licence. Ces autorisations n'entra&icirc;nent pas un
                 dessaisissement de vos droits intellectuels.
          
        </li>
<li>
            
<var class="replacable-license-text">7.</var>
          VOS RESPONSABILIT&Eacute;S.
            <br />

   La libert&eacute; de jouir de l'&oelig;uvre tel que permis par
                 la LAL (libert&eacute; de copier, diffuser, modifier)
                 implique pour chacun la responsabilit&eacute; de ses
                 propres faits.
          
        </li>
<li>
            
<var class="replacable-license-text">8.</var>
          LA DUR&Eacute;E DE LA LICENCE.
            <br />

   Cette licence prend effet d&egrave;s votre acceptation de
                 ses dispositions. Le fait de copier, de
                 diffuser, ou de modifier l'&oelig;uvre constitue une
                 acceptation tacite.
            <br />

   Cette licence a pour dur&eacute;e la dur&eacute;e des droits
                 d'auteur attach&eacute;s &agrave; l'&oelig;uvre. Si vous ne
                 respectez pas les termes de cette licence,
                 vous perdez automatiquement les droits qu'elle
                 vous conf&egrave;re.
			<br />

   Si le r&eacute;gime juridique auquel vous &ecirc;tes soumis ne vous permet pas de respecter les termes de cette licence, vous ne pouvez pas vous pr&eacute;valoir des libert&eacute;s qu'elle conf&egrave;re.
          
        </li>
<li>
            
<var class="replacable-license-text">9.</var>
          LES DIFF&Eacute;RENTES VERSIONS DE LA LICENCE.
            <br />

   Cette licence pourra &ecirc;tre modifi&eacute;e r&eacute;guli&egrave;rement,
                 en vue de son am&eacute;lioration, par ses auteurs
                 (les acteurs du mouvement Copyleft Attitude)
                 sous la forme de nouvelles versions
                 num&eacute;rot&eacute;es.
            <br />

   Vous avez toujours le choix entre vous contenter
                 des dispositions contenues dans la version de
                 la LAL sous laquelle la copie vous a &eacute;t&eacute;
                 communiqu&eacute;e ou alors, vous pr&eacute;valoir des
                 dispositions d'une des versions ult&eacute;rieures.
          
        </li>
<li>
            
<var class="replacable-license-text">10.</var>
          LES SOUS-LICENCES.
            <br />

   Les sous-licences ne sont pas autoris&eacute;es par la
                 pr&eacute;sente. Toute personne qui souhaite
                 b&eacute;n&eacute;ficier des libert&eacute;s qu'elle conf&egrave;re sera
                 li&eacute;e directement aux auteurs de l'&oelig;uvre
                 commune.
          
        </li>
<li>
            
<var class="replacable-license-text">11.</var>
          LE CONTEXTE JURIDIQUE.
            <br />

   Cette licence est r&eacute;dig&eacute;e en r&eacute;f&eacute;rence au droit fran&ccedil;ais et &agrave; la
                Convention de Berne relative au droit d'auteur.
         
      </li>
</ul>
    