
      <div class="optional-license-text">
         <p>Licence Art Libre
        <br />

[ Copyleft Attitude ]
      </p>

         <p>Version 1.2</p>

      </div>
         <p>Pr&eacute;ambule :</p>

      <p>Avec cette Licence Art Libre, l'autorisation est donn&eacute;e de
         copier, de diffuser et de transformer librement les oeuvres
         dans le respect des droits de l'auteur.</p>

      <p>Loin d'ignorer les droits de l'auteur, cette licence les
         reconna&icirc;t et les prot&egrave;ge. Elle en reformule le principe en
         permettant au public de faire un usage cr&eacute;atif des oeuvres
         d'art.
        <br />

Alors que l'usage fait du droit de la propri&eacute;t&eacute; litt&eacute;raire
             et artistique conduit &agrave; restreindre l'acc&egrave;s du public
             &agrave; l'oeuvre, la Licence Art Libre a pour but de le
             favoriser.
        <br />

L'intention est d'ouvrir l'acc&egrave;s et d'autoriser
             l'utilisation des ressources d'une oeuvre par le plus
             grand nombre. En avoir jouissance pour en multiplier
             les r&eacute;jouissances, cr&eacute;er de nouvelles conditions de
             cr&eacute;ation pour amplifier les possibilit&eacute;s de cr&eacute;ation.
             Dans le respect des auteurs avec la reconnaissance et
             la d&eacute;fense de leur droit moral.
      </p>

      <p>En effet, avec la venue du num&eacute;rique, l'invention de l'internet
         et des logiciels libres, un nouveau mode de cr&eacute;ation et de
         production est apparu. Il est aussi l'amplification de ce qui
         a &eacute;t&eacute; exp&eacute;riment&eacute; par nombre d'artistes contemporains.
        <br />

Le savoir et la cr&eacute;ation sont des ressources qui doivent
             demeurer libres pour &ecirc;tre encore v&eacute;ritablement du
             savoir et de la cr&eacute;ation. C'est &agrave; dire rester une
             recherche fondamentale qui ne soit pas directement
             li&eacute;e &agrave; une application concr&egrave;te. Cr&eacute;er c'est d&eacute;couvrir
             l'inconnu, c'est inventer le r&eacute;el avant tout souci de
             r&eacute;alisme.
        <br />

Ainsi, l'objet de l'art n'est pas confondu avec l'objet
             d'art fini et d&eacute;fini comme tel.
		<br />

C'est la raison essentielle de cette Licence Art Libre : promouvoir et prot&eacute;ger des pratiques artistiques lib&eacute;r&eacute;es des seules r&egrave;gles de l'&eacute;conomie de march&eacute;.
      </p>

      <p>D&Eacute;FINITIONS</p>

      <p>&ndash; L'oeuvre :
	  <br />

il s'agit d'une oeuvre commune qui comprend l'oeuvre originelle ainsi que toutes les contributions post&eacute;rieures (les originaux cons&eacute;quents et les copies). Elle est cr&eacute;&eacute;e &agrave; l'initiative de l'auteur originel qui par cette licence d&eacute;finit les conditions selon lesquelles les contributions sont faites.
	  </p>

      <p>&ndash; L'oeuvre originelle :
	  <br />

c'est-&agrave;-dire l'oeuvre cr&eacute;&eacute;e par l'initiateur de l'oeuvre commune dont les copies vont &ecirc;tre modifi&eacute;es par qui le souhaite.
	  </p>

      <p>&ndash; Les oeuvres cons&eacute;quentes :
	  <br />

c'est-&agrave;-dire les propositions des auteurs qui contribuent &agrave; la formation de l'oeuvre en faisant usage des droits de reproduction, de diffusion et de modification que leur conf&egrave;re la licence.
	  </p>

      <p>&ndash; Original (source ou ressource de l'oeuvre) :
	  <br />

exemplaire dat&eacute; de l'oeuvre, de sa d&eacute;finition, de sa partition ou de son programme que l'auteur pr&eacute;sente comme r&eacute;f&eacute;rence pour toutes actualisations, interpr&eacute;tations, copies ou reproductions ult&eacute;rieures.
	  </p>

      <p>&ndash; Copie :
	  <br />

toute reproduction d'un original au sens de cette licence.
	  </p>

      <p>&ndash; Auteur de l'oeuvre originelle :
	  <br />

c'est la personne qui a cr&eacute;&eacute; l'oeuvre &agrave; l'origine d'une arborescence de cette oeuvre modifi&eacute;e. Par cette licence, l'auteur d&eacute;termine les conditions dans lesquelles ce travail se fait.
	  </p>

      <p>&ndash; Contributeur :
	  <br />

toute personne qui contribue &agrave; la cr&eacute;ation de l'oeuvre. Il est l'auteur d'une oeuvre originale r&eacute;sultant de la modification d'une copie de l'oeuvre originelle ou de la modification d'une copie d'une oeuvre cons&eacute;quente.
	  </p>

      
<ul style="list-style:none">
<li>
            
<var class="replacable-license-text">1.</var>
          OBJET
            <br />

   Cette licence a pour objet de d&eacute;finir les
                 conditions selon lesquelles vous pouvez jouir
                 librement de cette oeuvre.
          
        </li>
<li>
            
<var class="replacable-license-text">2.</var>
          L'&Eacute;TENDUE DE LA JOUISSANCE
            <br />

   Cette oeuvre est soumise au droit d'auteur, et
                 l'auteur par cette licence vous indique quelles sont vos libert&eacute;s pour la copier, la diffuser et la modifier:
          
        </li>
<li>
            
<var class="replacable-license-text">2.1</var>
          LA LIBERT&Eacute; DE COPIER (OU DE REPRODUCTION)
            <br />

   Vous avez la libert&eacute; de copier cette oeuvre pour un
                 usage personnel, pour vos amis, ou toute autre
                 personne et quelque soit la technique
                 employ&eacute;e.
          
        </li>
<li>
            
<var class="replacable-license-text">2.2</var>
          LA LIBERT&Eacute; DE DIFFUSER, D'INTERPR&Eacute;TER (OU DE REPR&Eacute;SENTATION)
            <br />

   Vous pouvez diffuser librement les copies de ces
                 oeuvres, modifi&eacute;es ou non, quel que soit le support, quel que soit le lieu, &agrave; titre on&eacute;reux ou gratuit si vous respectez toutes les conditions suivantes: 
            <br />

   &ndash; joindre aux copies, cette licence &agrave; l'identique,
                 ou indiquer pr&eacute;cis&eacute;ment o&ugrave; se trouve la licence,
			<br />

   &ndash; indiquer au destinataire le nom de l'auteur des originaux,      
			<br />

   &ndash; indiquer au destinataire o&ugrave; il pourra avoir acc&egrave;s aux originaux 
			<br />

   (originels et/ou cons&eacute;quents). 
			L'auteur de l'original pourra, s'il le souhaite, vous autoriser &agrave; diffuser l'original dans les m&ecirc;mes conditions que les copies.          
        </li>
<li>
            
<var class="replacable-license-text">2.3</var>
          LA LIBERT&Eacute; DE MODIFIER
            <br />

   Vous avez la libert&eacute; de modifier les copies des
                 originaux (originels et cons&eacute;quents), qui peuvent &ecirc;tre partielles ou non, dans le respect des conditions pr&eacute;vues &agrave; l'article 2.2 en cas de diffusion (ou repr&eacute;sentation) de la copie modifi&eacute;e. L'auteur de l'original pourra, s'il le souhaite, vous autoriser &agrave; modifier l'original dans les m&ecirc;mes conditions que les copies.
        </li>
<li>
            
<var class="replacable-license-text">3.</var>
          L'INCORPORATION DE L'OEUVRE
            <br />

   Tous les &eacute;l&eacute;ments de cette oeuvre doivent demeurer
                 libres, c'est pourquoi il ne vous est pas
                 permis d'int&eacute;grer les originaux (originels et
                 cons&eacute;quents) dans une autre oeuvre qui ne
                 serait pas soumise &agrave; cette licence.
          
        </li>
<li>
            
<var class="replacable-license-text">4.</var>
          VOS DROITS D'AUTEUR
            <br />

   Cette licence n'a pas pour objet de nier vos droits
                 d'auteur sur votre contribution. En
                 choisissant de contribuer &agrave; l'&eacute;volution de
                 cette oeuvre, vous acceptez seulement d'offrir
                 aux autres les m&ecirc;mes droits sur votre
                 contribution que ceux qui vous ont &eacute;t&eacute;
                 accord&eacute;s par cette licence.
          
        </li>
<li>
            
<var class="replacable-license-text">5.</var>
          LA DUR&Eacute;E DE LA LICENCE
            <br />

   Cette licence prend effet d&egrave;s votre acceptation de
                 ses dispositions. Le fait de copier, de
                 diffuser, ou de modifier l'oeuvre constitue
                 une acception tacite.
            <br />

   Cette licence a pour dur&eacute;e la dur&eacute;e des droits d'auteur attach&eacute;s &agrave; l'oeuvre. 
			<br />

   Si vous ne respectez pas les termes de cette licence, vous perdez automatiquement les droits qu'elle vous conf&egrave;re. 
			<br />

   Si le r&eacute;gime juridique auquel vous &ecirc;tes soumis ne vous permet pas de respecter les termes de cette licence, vous ne pouvez pas vous pr&eacute;valoir des libert&eacute;s qu'elle conf&egrave;re.
        </li>
<li>
            
<var class="replacable-license-text">6.</var>
          LES DIFF&Eacute;RENTES VERSIONS DE LA LICENCE
            <br />

   Cette licence pourra &ecirc;tre modifi&eacute;e r&eacute;guli&egrave;rement,
                 en vue de son am&eacute;lioration, par ses auteurs
                 (les acteurs du mouvement &laquo;&nbsp;copyleft
                 attitude&nbsp;&raquo;) sous la forme de nouvelles
                 versions num&eacute;rot&eacute;es.
            <br />

   Vous avez toujours le choix entre vous contenter
                 des dispositions contenues dans la version
                 sous laquelle la copie vous a &eacute;t&eacute; communiqu&eacute;e
                 ou alors, vous pr&eacute;valoir des dispositions
                 d'une des versions ult&eacute;rieures.
          
        </li>
<li>
            
<var class="replacable-license-text">7.</var>
          LES SOUS-LICENCES
            <br />

   Les sous licences ne sont pas autoris&eacute;es par la
                 pr&eacute;sente. Toute personne qui souhaite
                 b&eacute;n&eacute;ficier des libert&eacute;s qu'elle conf&egrave;re sera
                 li&eacute;e directement &agrave; l'auteur de l'oeuvre
                 originelle.
          
        </li>
<li>
            
<var class="replacable-license-text">8.</var>
          LA LOI APPLICABLE AU CONTRAT
        </li>
</ul>
      <p>Cette licence est soumise au droit fran&ccedil;ais.</p>

    