
      <div class="optional-license-text">
         <p>Licence Libre du Qu&eacute;bec &ndash; R&eacute;ciprocit&eacute; forte (LiLiQ-R+)</p>

         <p>Version 1.1</p>

      </div>
      
<ul style="list-style:none">
<li>
            
<var class="replacable-license-text">1.</var>
          Pr&eacute;ambule
            <br />

   Cette licence s'applique &agrave; tout logiciel distribu&eacute;
                 dont le titulaire du droit d'auteur pr&eacute;cise
                 qu'il est sujet aux termes de la Licence Libre
                 du Qu&eacute;bec &ndash; R&eacute;ciprocit&eacute; forte (LiLiQ-R+)
                 (ci-apr&egrave;s appel&eacute;e la &laquo;&nbsp;licence&nbsp;&raquo;).
        
        </li>
<li>
            
<var class="replacable-license-text">2.</var>
          D&eacute;finitions
            <br />

   Dans la pr&eacute;sente licence, &agrave; moins que le contexte
                 n'indique un sens diff&eacute;rent, on entend par:
          
          <p>&laquo; conc&eacute;dant &raquo; : le titulaire du droit d'auteur sur le
             logiciel, ou toute personne d&ucirc;ment autoris&eacute;e par ce
             dernier &agrave; accorder la pr&eacute;sente licence;
            <br />

   &laquo; contributeur &raquo; : le titulaire du droit d'auteur
                 ou toute personne autoris&eacute;e par ce dernier &agrave;
                 soumettre au conc&eacute;dant une contribution. Un
                 contributeur dont sa contribution est
                 incorpor&eacute;e au logiciel est consid&eacute;r&eacute; comme un
                 conc&eacute;dant en regard de sa contribution;
            <br />

   &laquo; contribution &raquo; : tout logiciel original, ou
                 partie de logiciel original soumis et destin&eacute;
                 &agrave; &ecirc;tre incorpor&eacute; dans le logiciel;
            <br />

   &laquo; distribution &raquo; : le fait de d&eacute;livrer une copie du logiciel;
            <br />

   &laquo; licenci&eacute; &raquo; : toute personne qui poss&egrave;de une copie
                 du logiciel et qui exerce les droits conc&eacute;d&eacute;s
                 par la licence;
            <br />

   &laquo; logiciel &raquo; : une &oelig;uvre prot&eacute;g&eacute;e par le droit
                 d'auteur, telle qu'un programme d'ordinateur
                 et sa documentation, pour laquelle le
                 titulaire du droit d'auteur a pr&eacute;cis&eacute; qu'elle
                 est sujette aux termes de la pr&eacute;sente licence;
            <br />

   &laquo; logiciel d&eacute;riv&eacute; &raquo; : tout logiciel original
                 r&eacute;alis&eacute; par un licenci&eacute;, autre que le logiciel
                 ou un logiciel modifi&eacute;, qui produit ou
                 reproduit la totalit&eacute; ou une partie importante
                 du logiciel;
            <br />

   &laquo; logiciel modifi&eacute; &raquo; : toute modification par un
                 licenci&eacute; de l'un des fichiers source du
                 logiciel ou encore tout nouveau fichier source
                 qui incorpore le logiciel ou une partie
                 importante de ce dernier.
          </p>

        </li>
<li>
            
<var class="replacable-license-text">3.</var>
          Licence de droit d'auteur
            <br />

   Sous r&eacute;serve des termes de la licence, le conc&eacute;dant
                 accorde au licenci&eacute; une licence non exclusive
                 et libre de redevances lui permettant
                 d'exercer les droits suivants sur le
                 logiciel:
          
          
<ul style="list-style:none">
<li>
                  
<var class="replacable-license-text">1</var>
            Produire ou reproduire la totalit&eacute; ou une partie importante;</li>
<li>
                  
<var class="replacable-license-text">2</var>
            Ex&eacute;cuter ou repr&eacute;senter la totalit&eacute; ou une partie
                 importante en public;</li>
<li>
                  
<var class="replacable-license-text">3</var>
            Publier la totalit&eacute; ou une partie importante.
         </li>
</ul>
            <p>Cette licence est accord&eacute;e sans limite territoriale et
             sans limite de temps.</p>

            <p>L'exercice complet de ces droits est sujet &agrave; la
             distribution par le conc&eacute;dant du code source du
             logiciel, lequel doit &ecirc;tre sous une forme permettant
             d'y apporter des modifications. Le conc&eacute;dant peut
             aussi distribuer le logiciel accompagn&eacute; d'une offre de
             distribuer le code source du logiciel, sans frais
             suppl&eacute;mentaires, autres que ceux raisonnables afin de
             permettre la livraison du code source. Cette offre
             doit &ecirc;tre valide pendant une dur&eacute;e raisonnable.</p>

        </li>
<li>
            
<var class="replacable-license-text">4.</var>
          Distribution
            <br />

   Le licenci&eacute; peut distribuer des copies du logiciel,
                 d'un logiciel modifi&eacute; ou d&eacute;riv&eacute;, sous r&eacute;serve
                 de respecter les conditions suivantes :
          
            
<ul style="list-style:none">
<li>
                  
<var class="replacable-license-text">1</var>
          Le logiciel doit &ecirc;tre accompagn&eacute; d'un exemplaire de
             cette licence;</li>
<li>
                  
<var class="replacable-license-text">2</var>
          Si le logiciel a &eacute;t&eacute; modifi&eacute;, le licenci&eacute; doit en
                 faire la mention, de pr&eacute;f&eacute;rence dans chacun
                 des fichiers modifi&eacute;s dont la nature permet
                 une telle mention;</li>
<li>
                  
<var class="replacable-license-text">3</var>
          Les &eacute;tiquettes ou mentions faisant &eacute;tat des
                 droits d'auteur, des marques de commerce, des
                 garanties ou de la paternit&eacute; concernant le
                 logiciel ne doivent pas &ecirc;tre modifi&eacute;es ou
                 supprim&eacute;es, &agrave; moins que ces &eacute;tiquettes ou
                 mentions ne soient inapplicables &agrave; un logiciel
                 modifi&eacute; ou d&eacute;riv&eacute; donn&eacute;. </li>
</ul>
        </li>
<li>
            
<var class="replacable-license-text">4.1.</var>
          R&eacute;ciprocit&eacute;
            <br />

   Chaque fois que le licenci&eacute; distribue le logiciel,
                 le conc&eacute;dant offre au r&eacute;cipiendaire une
                 concession sur le logiciel selon les termes de
                 la pr&eacute;sente licence. Le licenci&eacute; doit offrir
                 une concession selon les termes de la pr&eacute;sente
                 licence pour tout logiciel modifi&eacute; ou d&eacute;riv&eacute;
                 qu'il distribue.
          
          <p>Chaque fois que le licenci&eacute; distribue le logiciel, un
             logiciel modifi&eacute;, ou un logiciel d&eacute;riv&eacute;, ce dernier
             doit assumer l'obligation d'en distribuer le code
             source, de la mani&egrave;re pr&eacute;vue au troisi&egrave;me alin&eacute;a de
             l'article 3.</p>

        </li>
<li>
            
<var class="replacable-license-text">4.2.</var>
          Compatibilit&eacute;
            <br />

   Dans la mesure o&ugrave; le licenci&eacute; souhaite distribuer
                 un logiciel modifi&eacute; ou d&eacute;riv&eacute; combin&eacute; &agrave; un
                 logiciel assujetti &agrave; une licence compatible,
                 mais dont il ne serait pas possible d'en
                 respecter les termes, le conc&eacute;dant offre, en
                 plus de la pr&eacute;sente concession, une concession
                 selon les termes de cette licence compatible.
          
          <p>Un licenci&eacute; qui est titulaire exclusif du droit d'auteur
             sur le logiciel assujetti &agrave; une licence compatible ne
             peut pas se pr&eacute;valoir de cette offre. Il en est de
             m&ecirc;me pour toute autre personne d&ucirc;ment autoris&eacute;e &agrave;
             sous-licencier par le titulaire exclusif du droit
             d'auteur sur le logiciel assujetti &agrave; une licence
             compatible.</p>

            <p>Est consid&eacute;r&eacute;e comme une licence compatible toute licence
             libre approuv&eacute;e ou certifi&eacute;e par la Free Software
             Foundation ou l'Open Source Initiative, dont le niveau
             de r&eacute;ciprocit&eacute; est comparable &agrave; celui de la pr&eacute;sente
             licence, sans toutefois &ecirc;tre moindre, notamment:</p>

            
<ul style="list-style:none">
<li>
                  
<var class="replacable-license-text">1</var>
                Common Public License Version 1.0 (CPL-1.0)</li>
<li>
                  
<var class="replacable-license-text">2</var>
                Contrat de licence de logiciel libre CeCILL,
                 version 2.1 (CECILL-2.1)</li>
<li>
                  
<var class="replacable-license-text">3</var>
                Eclipse Public License - v 1.0 (EPL-1.0)</li>
<li>
                  
<var class="replacable-license-text">4</var>
                European Union Public License, version 1.1 (EUPL v. 1.1)</li>
<li>
                  
<var class="replacable-license-text">5</var>
                GNU General Public License Version 2 (GNU GPLv2)</li>
<li>
                  
<var class="replacable-license-text">6</var>
                GNU General Public License Version 3 (GNU GPLv3)</li>
</ul>
        </li>
<li>
            
<var class="replacable-license-text">5.</var>
          Contributions
            <br />

   Sous r&eacute;serve d'une entente distincte, toute
                 contribution soumise par un contributeur au
                 conc&eacute;dant pour inclusion dans le logiciel sera
                 soumise aux termes de cette licence.
          
        </li>
<li>
            
<var class="replacable-license-text">6.</var>
          Marques de commerce
            <br />

   La licence n'accorde aucune permission particuli&egrave;re
                 qui permettrait d'utiliser les marques de
                 commerce du conc&eacute;dant, autre que celle requise
                 permettant d'identifier la provenance du
                 logiciel.
          
        </li>
<li>
            
<var class="replacable-license-text">7.</var>
          Garanties
            <br />

   Sauf mention contraire, le conc&eacute;dant distribue le
                 logiciel sans aucune garantie, aux risques et
                 p&eacute;rils de l'acqu&eacute;reur de la copie du logiciel,
                 et ce, sans assurer que le logiciel puisse
                 r&eacute;pondre &agrave; un besoin particulier ou puisse
                 donner un r&eacute;sultat quelconque.
          
          <p>Sans lier le conc&eacute;dant d'une quelconque mani&egrave;re, rien
             n'emp&ecirc;che un licenci&eacute; d'offrir ou d'exclure des
             garanties ou du support.</p>

        </li>
<li>
            
<var class="replacable-license-text">8.</var>
          Responsabilit&eacute;
            <br />

   Le licenci&eacute; est responsable de tout pr&eacute;judice
                 r&eacute;sultant de l'exercice des droits accord&eacute;s
                 par la licence.
          
          <p>Le conc&eacute;dant ne saurait &ecirc;tre tenu responsable du
             pr&eacute;judice subi par le licenci&eacute; ou par des tiers, pour
             quelque cause que ce soit en lien avec la licence et
             les droits qui y sont accord&eacute;s.</p>

        </li>
<li>
            
<var class="replacable-license-text">9.</var>
          R&eacute;siliation
            <br />

   La pr&eacute;sente licence est r&eacute;sili&eacute;e de plein droit d&egrave;s
                 que les droits qui y sont accord&eacute;s ne sont pas
                 exerc&eacute;s conform&eacute;ment aux termes qui y sont
                 stipul&eacute;s.
          
          <p>Toutefois, si le d&eacute;faut est corrig&eacute; dans un d&eacute;lai de 30
             jours de sa prise de connaissance par la personne en
             d&eacute;faut, et qu'il s'agit du premier d&eacute;faut, la licence
             est accord&eacute;e de nouveau.</p>

            <p>Pour tout d&eacute;faut subs&eacute;quent, le consentement expr&egrave;s du
             conc&eacute;dant est n&eacute;cessaire afin que la licence soit
             accord&eacute;e de nouveau.</p>

        </li>
<li>
            
<var class="replacable-license-text">10.</var>
          Version de la licence
            <br />

   Le Centre de services partag&eacute;s du Qu&eacute;bec, ses
                 ayants cause ou toute personne qu'il d&eacute;signe,
                 peuvent diffuser des versions r&eacute;vis&eacute;es ou
                 modifi&eacute;es de cette licence. Chaque version
                 recevra un num&eacute;ro unique. Si un logiciel est
                 d&eacute;j&agrave; soumis aux termes d'une version
                 sp&eacute;cifique, c'est seulement cette version qui
                 liera les parties &agrave; la licence.
          
          <p>Le conc&eacute;dant peut aussi choisir de conc&eacute;der la licence
             sous la version actuelle ou toute version ult&eacute;rieure,
             auquel cas le licenci&eacute; peut choisir sous quelle
             version la licence lui est accord&eacute;e.</p>

        </li>
<li>
            
<var class="replacable-license-text">11.</var>
          Divers
            <br />

   Dans la mesure o&ugrave; le conc&eacute;dant est un minist&egrave;re, un organisme
         public ou une personne morale de droit public, cr&eacute;&eacute;s en vertu
         d'une loi de l'Assembl&eacute;e nationale du Qu&eacute;bec, la licence est
         r&eacute;gie par le droit applicable au Qu&eacute;bec et en cas de
         contestation, les tribunaux du Qu&eacute;bec seront seuls
         comp&eacute;tents.
         
      <p>La pr&eacute;sente licence peut &ecirc;tre distribu&eacute;e sans conditions
         particuli&egrave;res. Toutefois, une version modifi&eacute;e doit &ecirc;tre
         distribu&eacute;e sous un nom diff&eacute;rent. Toute r&eacute;f&eacute;rence au Centre de
         services partag&eacute;s du Qu&eacute;bec, et, le cas &eacute;ch&eacute;ant, ses ayant
         cause, doit &ecirc;tre retir&eacute;e, autre que celle permettant
         d'identifier la provenance de la licence.</p>

         </li>
</ul>
    