{
  "@context" : "https://spdx.org/rdf/3.0.1/spdx-context.jsonld",
  "@graph" : [ {
    "@id" : "_:creationInfo_0",
    "type" : "CreationInfo",
    "specVersion" : "3.0.1",
    "createdBy" : [ "https://spdx.org/licenses/creatoragent/f8acf30" ],
    "createdUsing" : [ "https://spdx.org/tools/licenselistpublisher" ],
    "created" : "2025-01-05T00:00:00Z",
    "comment" : "This object is created and maintained by the SPDX legal team (https://spdx.dev/engage/participate/legal-team/) using the LicenseListPublisher (https://github.com/spdx/licenselistpublisher)"
  }, {
    "spdxId" : "http://spdx.org/licenses/AML-glslang_document",
    "type" : "SpdxDocument",
    "rootElement" : [ "http://spdx.org/licenses/AML-glslang" ],
    "name" : "AML-glslang document",
    "comment" : "SPDX Document For AML-glslang",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "https://spdx.org/tools/licenselistpublisher",
    "type" : "Tool",
    "name" : "SPDX License List Publisher",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "https://spdx.org/licenses/creatoragent/f8acf30",
    "type" : "Organization",
    "name" : "SPDX Legal Team",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "http://spdx.org/licenses/AML-glslang",
    "type" : "expandedlicensing_ListedLicense",
    "expandedlicensing_isOsiApproved" : false,
    "expandedlicensing_seeAlso" : [ "https://github.com/KhronosGroup/glslang/blob/main/LICENSE.txt#L949", "https://docs.omniverse.nvidia.com/install-guide/latest/common/licenses.html" ],
    "simplelicensing_licenseText" : "Copyright (c) 2002, NVIDIA Corporation.\n\nNVIDIA Corporation(\"NVIDIA\") supplies this software to you in\nconsideration of your agreement to the following terms, and your use,\ninstallation, modification or redistribution of this NVIDIA software\nconstitutes acceptance of these terms.  If you do not agree with these\nterms, please do not use, install, modify or redistribute this NVIDIA\nsoftware.\n\nIn consideration of your agreement to abide by the following terms, and\nsubject to these terms, NVIDIA grants you a personal, non-exclusive\nlicense, under NVIDIA's copyrights in this original NVIDIA software (the\n\"NVIDIA Software\"), to use, reproduce, modify and redistribute the\nNVIDIA Software, with or without modifications, in source and/or binary\nforms; provided that if you redistribute the NVIDIA Software, you must\nretain the copyright notice of NVIDIA, this notice and the following\ntext and disclaimers in all such redistributions of the NVIDIA Software.\nNeither the name, trademarks, service marks nor logos of NVIDIA\nCorporation may be used to endorse or promote products derived from the\nNVIDIA Software without specific prior written permission from NVIDIA.\nExcept as expressly stated in this notice, no other rights or licenses\nexpress or implied, are granted by NVIDIA herein, including but not\nlimited to any patent rights that may be infringed by your derivative\nworks or by other works in which the NVIDIA Software may be\nincorporated. No hardware is licensed hereunder.\n\nTHE NVIDIA SOFTWARE IS BEING PROVIDED ON AN \"AS IS\" BASIS, WITHOUT\nWARRANTIES OR CONDITIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED,\nINCLUDING WITHOUT LIMITATION, WARRANTIES OR CONDITIONS OF TITLE,\nNON-INFRINGEMENT, MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR\nITS USE AND OPERATION EITHER ALONE OR IN COMBINATION WITH OTHER\nPRODUCTS.\n\nIN NO EVENT SHALL NVIDIA BE LIABLE FOR ANY SPECIAL, INDIRECT,\nINCIDENTAL, EXEMPLARY, CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED\nTO, LOST PROFITS; PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF\nUSE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) OR ARISING IN ANY WAY\nOUT OF THE USE, REPRODUCTION, MODIFICATION AND/OR DISTRIBUTION OF THE\nNVIDIA SOFTWARE, HOWEVER CAUSED AND WHETHER UNDER THEORY OF CONTRACT,\nTORT (INCLUDING NEGLIGENCE), STRICT LIABILITY OR OTHERWISE, EVEN IF\nNVIDIA HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n",
    "name" : "AML glslang variant License",
    "expandedlicensing_standardLicenseTemplate" : "<<var;name=\"copyright\";original=\"Copyright (c) 2002, NVIDIA Corporation.  \";match=\".{0,5000}\">>\n<<var;name=\"author\";original=\"NVIDIA Corporation(\"NVIDIA\")\";match=\".*\">> supplies this software to you in consideration of your agreement to the following terms, and your use, installation, modification or redistribution of this <<var;name=\"author\";original=\"NVIDIA\";match=\".*\">> software constitutes acceptance of these terms. If you do not agree with these terms, please do not use, install, modify or redistribute this <<var;name=\"author\";original=\"NVIDIA\";match=\".*\">> software.\n\nIn consideration of your agreement to abide by the following terms, and subject to these terms, <<var;name=\"author\";original=\"NVIDIA\";match=\".*\">> grants you a personal, non-exclusive license, under <<var;name=\"author\";original=\"NVIDIA's\";match=\".*\">> copyrights in this original <<var;name=\"author\";original=\"NVIDIA\";match=\".*\">> software (the \" <<var;name=\"author\";original=\"NVIDIA\";match=\".*\">> Software\"), to use, reproduce, modify and redistribute the <<var;name=\"author\";original=\"NVIDIA\";match=\".*\">> Software, with or without modifications, in source and/or binary forms; provided that if you redistribute the <<var;name=\"author\";original=\"NVIDIA\";match=\".*\">> Software, you must retain the copyright notice of <<var;name=\"author\";original=\"NVIDIA\";match=\".*\">> , this notice and the following text and disclaimers in all such redistributions of the <<var;name=\"author\";original=\"NVIDIA\";match=\".*\">> Software. Neither the name, trademarks, service marks nor logos of <<var;name=\"author\";original=\"NVIDIA\";match=\".*\">> Corporation may be used to endorse or promote products derived from the <<var;name=\"author\";original=\"NVIDIA\";match=\".*\">> Software without specific prior written permission from <<var;name=\"author\";original=\"NVIDIA\";match=\".*\">> . Except as expressly stated in this notice, no other rights or licenses express or implied, are granted by <<var;name=\"author\";original=\"NVIDIA\";match=\".*\">> herein, including but not limited to any patent rights that may be infringed by your derivative works or by other works in which the <<var;name=\"author\";original=\"NVIDIA\";match=\".*\">> Software may be incorporated. No hardware is licensed hereunder.\n\nTHE <<var;name=\"author\";original=\"NVIDIA\";match=\".*\">> SOFTWARE IS BEING PROVIDED ON AN \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING WITHOUT LIMITATION, WARRANTIES OR CONDITIONS OF TITLE, NON-INFRINGEMENT, MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR ITS USE AND OPERATION EITHER ALONE OR IN COMBINATION WITH OTHER PRODUCTS.\n\nIN NO EVENT SHALL <<var;name=\"author\";original=\"NVIDIA\";match=\".*\">> BE LIABLE FOR ANY SPECIAL, INDIRECT, INCIDENTAL, EXEMPLARY, CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, LOST PROFITS; PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) OR ARISING IN ANY WAY OUT OF THE USE, REPRODUCTION, MODIFICATION AND/OR DISTRIBUTION OF THE <<var;name=\"author\";original=\"NVIDIA\";match=\".*\">> SOFTWARE, HOWEVER CAUSED AND WHETHER UNDER THEORY OF CONTRACT, TORT (INCLUDING NEGLIGENCE), STRICT LIABILITY OR OTHERWISE, EVEN IF <<var;name=\"author\";original=\"NVIDIA\";match=\".*\">> HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n",
    "creationInfo" : "_:creationInfo_0",
    "expandedlicensing_isDeprecatedLicenseId" : false
  } ]
}