{
  "@context" : "https://spdx.org/rdf/3.0.1/spdx-context.jsonld",
  "@graph" : [ {
    "@id" : "_:creationInfo_0",
    "type" : "CreationInfo",
    "specVersion" : "3.0.1",
    "createdBy" : [ "https://spdx.org/licenses/creatoragent/f8acf30" ],
    "createdUsing" : [ "https://spdx.org/tools/licenselistpublisher" ],
    "created" : "2025-01-05T00:00:00Z",
    "comment" : "This object is created and maintained by the SPDX legal team (https://spdx.dev/engage/participate/legal-team/) using the LicenseListPublisher (https://github.com/spdx/licenselistpublisher)"
  }, {
    "spdxId" : "http://spdx.org/licenses/BSD-3-Clause-Sun_document",
    "type" : "SpdxDocument",
    "rootElement" : [ "http://spdx.org/licenses/BSD-3-Clause-Sun" ],
    "name" : "BSD-3-Clause-Sun document",
    "comment" : "SPDX Document For BSD-3-Clause-Sun",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "https://spdx.org/tools/licenselistpublisher",
    "type" : "Tool",
    "name" : "SPDX License List Publisher",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "https://spdx.org/licenses/creatoragent/f8acf30",
    "type" : "Organization",
    "name" : "SPDX Legal Team",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "http://spdx.org/licenses/BSD-3-Clause-Sun",
    "type" : "expandedlicensing_ListedLicense",
    "expandedlicensing_isOsiApproved" : false,
    "expandedlicensing_seeAlso" : [ "https://github.com/xmlark/msv/blob/b9316e2f2270bc1606952ea4939ec87fbba157f3/xsdlib/src/main/java/com/sun/msv/datatype/regexp/InternalImpl.java" ],
    "simplelicensing_licenseText" : "Copyright (c) 2001-2013 Oracle and/or its affiliates. All rights reserved.\n\nRedistribution and  use in  source and binary  forms, with  or without\nmodification, are permitted provided that the following conditions are\nmet:\n\n- Redistributions  of  source code  must  retain  the above  copyright\n  notice, this list of conditions and the following disclaimer.\n\n- Redistribution  in binary  form must  reproduct the  above copyright\n  notice, this list of conditions  and the following disclaimer in the\n  documentation and/or other materials provided with the distribution.\n\nNeither  the  name   of  Sun  Microsystems,  Inc.  or   the  names  of\ncontributors may be  used to endorse or promote  products derived from\nthis software without specific prior written permission.\n\nThis software is provided \"AS IS,\" without a warranty of any kind. ALL\nEXPRESS  OR   IMPLIED  CONDITIONS,  REPRESENTATIONS   AND  WARRANTIES,\nINCLUDING  ANY  IMPLIED WARRANTY  OF  MERCHANTABILITY,  FITNESS FOR  A\nPARTICULAR PURPOSE  OR NON-INFRINGEMENT, ARE HEREBY  EXCLUDED. SUN AND\nITS  LICENSORS SHALL  NOT BE  LIABLE  FOR ANY  DAMAGES OR  LIABILITIES\nSUFFERED BY LICENSEE  AS A RESULT OF OR  RELATING TO USE, MODIFICATION\nOR DISTRIBUTION OF  THE SOFTWARE OR ITS DERIVATIVES.  IN NO EVENT WILL\nSUN OR ITS  LICENSORS BE LIABLE FOR ANY LOST  REVENUE, PROFIT OR DATA,\nOR  FOR  DIRECT,   INDIRECT,  SPECIAL,  CONSEQUENTIAL,  INCIDENTAL  OR\nPUNITIVE  DAMAGES, HOWEVER  CAUSED  AND REGARDLESS  OF  THE THEORY  OF\nLIABILITY, ARISING  OUT OF  THE USE OF  OR INABILITY TO  USE SOFTWARE,\nEVEN IF SUN HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n",
    "name" : "BSD 3-Clause Sun Microsystems",
    "comment" : "This license is very similar to BSD-3-Clause-No-Nuclear-Warranty except it has variations in the disclaimer and omits the no-nuclear-warranty at the end.",
    "expandedlicensing_standardLicenseTemplate" : "<<var;name=\"copyright\";original=\"Copyright (c) 2001-2013 Oracle and/or its affiliates. All rights reserved.  \";match=\".{0,5000}\">>\nRedistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:\n\n   <<var;name=\"bullet\";original=\"-\";match=\".{0,20}\">> Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.\n   <<var;name=\"bullet\";original=\"-\";match=\".{0,20}\">> Redistribution in binary form must reproduct the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.\nNeither the name of Sun Microsystems, Inc. or the names of contributors may be used to endorse or promote products derived from this software without specific prior written permission.\n\nThis software is provided \"AS IS,\" without a warranty of any kind. ALL EXPRESS OR IMPLIED CONDITIONS, REPRESENTATIONS AND WARRANTIES, INCLUDING ANY IMPLIED WARRANTY OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE OR NON-INFRINGEMENT, ARE HEREBY EXCLUDED. SUN AND ITS LICENSORS SHALL NOT BE LIABLE FOR ANY DAMAGES OR LIABILITIES SUFFERED BY LICENSEE AS A RESULT OF OR RELATING TO USE, MODIFICATION OR DISTRIBUTION OF THE SOFTWARE OR ITS DERIVATIVES. IN NO EVENT WILL SUN OR ITS LICENSORS BE LIABLE FOR ANY LOST REVENUE, PROFIT OR DATA, OR FOR DIRECT, INDIRECT, SPECIAL, CONSEQUENTIAL, INCIDENTAL OR PUNITIVE DAMAGES, HOWEVER CAUSED AND REGARDLESS OF THE THEORY OF LIABILITY, ARISING OUT OF THE USE OF OR INABILITY TO USE SOFTWARE, EVEN IF SUN HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n\n",
    "creationInfo" : "_:creationInfo_0",
    "expandedlicensing_isDeprecatedLicenseId" : false
  } ]
}