{
  "@context" : "https://spdx.org/rdf/3.0.1/spdx-context.jsonld",
  "@graph" : [ {
    "@id" : "_:creationInfo_0",
    "type" : "CreationInfo",
    "specVersion" : "3.0.1",
    "createdBy" : [ "https://spdx.org/licenses/creatoragent/f8acf30" ],
    "createdUsing" : [ "https://spdx.org/tools/licenselistpublisher" ],
    "created" : "2025-01-05T00:00:00Z",
    "comment" : "This object is created and maintained by the SPDX legal team (https://spdx.dev/engage/participate/legal-team/) using the LicenseListPublisher (https://github.com/spdx/licenselistpublisher)"
  }, {
    "spdxId" : "http://spdx.org/licenses/BSD-3-Clause-flex_document",
    "type" : "SpdxDocument",
    "rootElement" : [ "http://spdx.org/licenses/BSD-3-Clause-flex" ],
    "name" : "BSD-3-Clause-flex document",
    "comment" : "SPDX Document For BSD-3-Clause-flex",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "https://spdx.org/tools/licenselistpublisher",
    "type" : "Tool",
    "name" : "SPDX License List Publisher",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "https://spdx.org/licenses/creatoragent/f8acf30",
    "type" : "Organization",
    "name" : "SPDX Legal Team",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "http://spdx.org/licenses/BSD-3-Clause-flex",
    "type" : "expandedlicensing_ListedLicense",
    "expandedlicensing_isOsiApproved" : false,
    "expandedlicensing_seeAlso" : [ "https://github.com/westes/flex/blob/master/COPYING" ],
    "simplelicensing_licenseText" : "Flex carries the copyright used for BSD software, slightly modified\nbecause it originated at the Lawrence Berkeley (not Livermore!) Laboratory,\nwhich operates under a contract with the Department of Energy:\n\nCopyright (c) 2001, 2002, 2003, 2004, 2005, 2006, 2007 The Flex Project.\n\nCopyright (c) 1990, 1997 The Regents of the University of California.\nAll rights reserved.\n\nThis code is derived from software contributed to Berkeley by\nVern Paxson.\n\nThe United States Government has rights in this work pursuant\nto contract no. DE-AC03-76SF00098 between the United States\nDepartment of Energy and the University of California.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions\nare met:\n\n1. Redistributions of source code must retain the above copyright\n   notice, this list of conditions and the following disclaimer.\n2. Redistributions in binary form must reproduce the above copyright\n   notice, this list of conditions and the following disclaimer in the\n   documentation and/or other materials provided with the distribution.\n\nNeither the name of the University nor the names of its contributors\nmay be used to endorse or promote products derived from this software\nwithout specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR\nIMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED\nWARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR\nPURPOSE.\n\nThis basically says \"do whatever you please with this software except\nremove this notice or take advantage of the University's (or the flex\nauthors') name\".\n\nNote that the \"flex.skl\" scanner skeleton carries no copyright notice.\nYou are free to do whatever you please with scanners generated using flex;\nfor them, you are not even bound by the above copyright.\n",
    "name" : "BSD 3-Clause Flex variant",
    "expandedlicensing_standardLicenseTemplate" : "<<beginOptional>>Flex carries the copyright used for BSD software, slightly modified because it originated at the Lawrence Berkeley (not Livermore!) Laboratory, which operates under a contract with the Department of Energy:<<endOptional>> <<var;name=\"copyright\";original=\"Copyright (c) 2001, 2002, 2003, 2004, 2005, 2006, 2007 The Flex Project. Copyright (c) 1990, 1997 The Regents of the University of California. All rights reserved.\";match=\".{0,5000}\">>\nThis code is derived from software contributed to Berkeley by Vern Paxson.\n\nThe United States Government has rights in this work pursuant to contract no. DE-AC03-76SF00098 between the United States Department of Energy and the University of California.\n\nRedistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:\n\n   <<var;name=\"bullet\";original=\"1.\";match=\".{0,20}\">> Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.\n   <<var;name=\"bullet\";original=\"2.\";match=\".{0,20}\">> Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.\nNeither the name of the University nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.\n\nThis basically says \"do whatever you please with this software except remove this notice or take advantage of the University's (or the flex authors') name\".\n\nNote that the \"flex.skl\" scanner skeleton carries no copyright notice. You are free to do whatever you please with scanners generated using flex; for them, you are not even bound by the above copyright.\n\n",
    "creationInfo" : "_:creationInfo_0",
    "expandedlicensing_isDeprecatedLicenseId" : false
  } ]
}