{
  "@context" : "https://spdx.org/rdf/3.0.1/spdx-context.jsonld",
  "@graph" : [ {
    "@id" : "_:creationInfo_0",
    "type" : "CreationInfo",
    "specVersion" : "3.0.1",
    "createdBy" : [ "https://spdx.org/licenses/creatoragent/f8acf30" ],
    "createdUsing" : [ "https://spdx.org/tools/licenselistpublisher" ],
    "created" : "2025-01-05T00:00:00Z",
    "comment" : "This object is created and maintained by the SPDX legal team (https://spdx.dev/engage/participate/legal-team/) using the LicenseListPublisher (https://github.com/spdx/licenselistpublisher)"
  }, {
    "spdxId" : "http://spdx.org/licenses/Catharon_document",
    "type" : "SpdxDocument",
    "rootElement" : [ "http://spdx.org/licenses/Catharon" ],
    "name" : "Catharon document",
    "comment" : "SPDX Document For Catharon",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "https://spdx.org/tools/licenselistpublisher",
    "type" : "Tool",
    "name" : "SPDX License List Publisher",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "https://spdx.org/licenses/creatoragent/f8acf30",
    "type" : "Organization",
    "name" : "SPDX Legal Team",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "http://spdx.org/licenses/Catharon",
    "type" : "expandedlicensing_ListedLicense",
    "expandedlicensing_isOsiApproved" : false,
    "expandedlicensing_seeAlso" : [ "https://github.com/scummvm/scummvm/blob/v2.8.0/LICENSES/CatharonLicense.txt" ],
    "simplelicensing_licenseText" : "                  The Catharon Open Source LICENSE\n                    ----------------------------\n\n                            2000-Jul-04\n\n          Copyright (C) 2000 by Catharon Productions, Inc.\n\n\n\nIntroduction\n============\n\n  This  license  applies to  source  files  distributed by  Catharon\n  Productions,  Inc.  in  several  archive packages.   This  license\n  applies  to all files  found in  such packages  which do  not fall\n  under their own explicit license.\n\n  This  license   was  inspired  by  the  BSD,   Artistic,  and  IJG\n  (Independent JPEG  Group) licenses, which  all encourage inclusion\n  and  use of  free  software in  commercial  and freeware  products\n  alike.  As a consequence, its main points are that:\n\n    o We  don't promise that  this software works.  However,  we are\n      interested in any kind of bug reports. (`as is' distribution)\n\n    o You can  use this software for whatever you  want, in parts or\n      full form, without having to pay us. (`royalty-free' usage)\n\n    o You may not pretend that  you wrote this software.  If you use\n      it, or  only parts of it,  in a program,  you must acknowledge\n      somewhere  in  your  documentation  that  you  have  used  the\n      Catharon Code. (`credits')\n\n  We  specifically  permit  and  encourage  the  inclusion  of  this\n  software, with  or without modifications,  in commercial products.\n  We disclaim  all warranties  covering the packages  distributed by\n  Catharon  Productions, Inc.  and  assume no  liability related  to\n  their use.\n\n\nLegal Terms\n===========\n\n0. Definitions\n--------------\n\n  Throughout this license,  the terms `Catharon Package', `package',\n  and  `Catharon  Code'  refer   to  the  set  of  files  originally\n  distributed by Catharon Productions, Inc.\n\n  `You' refers to  the licensee, or person using  the project, where\n  `using' is a generic term including compiling the project's source\n  code as  well as linking it  to form a  `program' or `executable'.\n  This  program  is referred  to  as `a  program  using  one of  the\n  Catharon Packages'.\n\n  This  license applies  to all  files distributed  in  the original\n  Catharon  Package(s),  including  all  source code,  binaries  and\n  documentation,  unless  otherwise  stated   in  the  file  in  its\n  original, unmodified form as  distributed in the original archive.\n  If you are  unsure whether or not a particular  file is covered by\n  this license, you must contact us to verify this.\n\n  The  Catharon   Packages  are  copyright  (C)   2000  by  Catharon\n  Productions, Inc.  All rights reserved except as specified below.\n\n1. No Warranty\n--------------\n\n  THE CATHARON PACKAGES ARE PROVIDED `AS IS' WITHOUT WARRANTY OF ANY\n  KIND, EITHER  EXPRESS OR IMPLIED,  INCLUDING, BUT NOT  LIMITED TO,\n  WARRANTIES  OF  MERCHANTABILITY   AND  FITNESS  FOR  A  PARTICULAR\n  PURPOSE.  IN NO EVENT WILL ANY OF THE AUTHORS OR COPYRIGHT HOLDERS\n  BE LIABLE FOR ANY DAMAGES CAUSED BY THE USE OF OR THE INABILITY TO\n  USE THE CATHARON PACKAGE.\n\n2. Redistribution\n-----------------\n\n  This  license  grants  a  worldwide, royalty-free,  perpetual  and\n  irrevocable right  and license to use,  execute, perform, compile,\n  display,  copy,   create  derivative  works   of,  distribute  and\n  sublicense the  Catharon Packages (in both source  and object code\n  forms)  and  derivative works  thereof  for  any  purpose; and  to\n  authorize others  to exercise  some or all  of the  rights granted\n  herein, subject to the following conditions:\n\n    o Redistribution  of source code  must retain this  license file\n      (`license.txt') unaltered; any additions, deletions or changes\n      to   the  original   files  must   be  clearly   indicated  in\n      accompanying  documentation.   The  copyright notices  of  the\n      unaltered, original  files must be preserved in  all copies of\n      source files.\n\n    o Redistribution  in binary form must provide  a disclaimer that\n      states  that the  software is  based in  part on  the  work of\n      Catharon Productions, Inc. in the distribution documentation.\n\n  These conditions  apply to any  software derived from or  based on\n  the Catharon Packages, not just  the unmodified files.  If you use\n  our work, you  must acknowledge us.  However, no  fee need be paid\n  to us.\n\n3. Advertising\n--------------\n\n  Neither Catharon Productions, Inc.  and contributors nor you shall\n  use  the  name  of  the  other  for  commercial,  advertising,  or\n  promotional purposes without specific prior written permission.\n\n  We suggest, but do not  require, that you use the following phrase\n  to refer to this software in your documentation: 'this software is\n  based in part on the Catharon Typography Project'.\n\n  As  you have  not signed  this license,  you are  not  required to\n  accept  it.  However,  as  the Catharon  Packages are  copyrighted\n  material, only  this license, or  another one contracted  with the\n  authors, grants you  the right to use, distribute,  and modify it.\n  Therefore,  by  using,  distributing,  or modifying  the  Catharon\n  Packages,  you indicate  that you  understand and  accept  all the\n  terms of this license.\n",
    "name" : "Catharon License",
    "expandedlicensing_standardLicenseTemplate" : "<<beginOptional>>The Catharon Open Source LICENSE\n----------------------------\n\n<<endOptional>> <<var;name=\"copyright\";original=\"2000-Jul-04   Copyright (C) 2000 by Catharon Productions, Inc.  \";match=\".{0,5000}\">>\n\nIntroduction\n============\n\nThis license applies to source files distributed by Catharon Productions, Inc. in several archive packages. This license applies to all files found in such packages which do not fall under their own explicit license.\n\nThis license was inspired by the BSD, Artistic, and IJG (Independent JPEG Group) licenses, which all encourage inclusion and use of free software in commercial and freeware products alike. As a consequence, its main points are that:\n\n   <<var;name=\"bullet\";original=\"o\";match=\".{0,20}\">>\n   We don't promise that this software works. However, we are interested in any kind of bug reports. (`as is' distribution)\n\n   <<var;name=\"bullet\";original=\"o\";match=\".{0,20}\">>\n   You can use this software for whatever you want, in parts or full form, without having to pay us. (`royalty-free' usage)\n\n   <<var;name=\"bullet\";original=\"o\";match=\".{0,20}\">>\n   You may not pretend that you wrote this software. If you use it, or only parts of it, in a program, you must acknowledge somewhere in your documentation that you have used the Catharon Code. (`credits')\n\nWe specifically permit and encourage the inclusion of this software, with or without modifications, in commercial products. We disclaim all warranties covering the packages distributed by Catharon Productions, Inc. and assume no liability related to their use.\n\nLegal Terms\n===========\n\n   <<var;name=\"bullet\";original=\"0.\";match=\".{0,20}\">>\n   Definitions\n   --------------\n\n   Throughout this license, the terms `Catharon Package', `package', and `Catharon Code' refer to the set of files originally distributed by Catharon Productions, Inc.\n\n   `You' refers to the licensee, or person using the project, where `using' is a generic term including compiling the project's source code as well as linking it to form a `program' or `executable'. This program is referred to as `a program using one of the Catharon Packages'.\n\n   This license applies to all files distributed in the original Catharon Package(s), including all source code, binaries and documentation, unless otherwise stated in the file in its original, unmodified form as distributed in the original archive. If you are unsure whether or not a particular file is covered by this license, you must contact us to verify this.\n\n   The Catharon Packages are copyright (C) 2000 by Catharon Productions, Inc. All rights reserved except as specified below.\n\n   <<var;name=\"bullet\";original=\"1.\";match=\".{0,20}\">>\n   No Warranty\n   --------------\n\n   THE CATHARON PACKAGES ARE PROVIDED `AS IS' WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL ANY OF THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY DAMAGES CAUSED BY THE USE OF OR THE INABILITY TO USE THE CATHARON PACKAGE.\n\n   <<var;name=\"bullet\";original=\"2.\";match=\".{0,20}\">>\n   Redistribution\n   -----------------\n\n   This license grants a worldwide, royalty-free, perpetual and irrevocable right and license to use, execute, perform, compile, display, copy, create derivative works of, distribute and sublicense the Catharon Packages (in both source and object code forms) and derivative works thereof for any purpose; and to authorize others to exercise some or all of the rights granted herein, subject to the following conditions:\n\n      <<var;name=\"bullet\";original=\"o\";match=\".{0,20}\">>\n      Redistribution of source code must retain this license file (`license.txt') unaltered; any additions, deletions or changes to the original files must be clearly indicated in accompanying documentation. The copyright notices of the unaltered, original files must be preserved in all copies of source files.\n\n      <<var;name=\"bullet\";original=\"o\";match=\".{0,20}\">>\n      Redistribution in binary form must provide a disclaimer that states that the software is based in part on the work of Catharon Productions, Inc. in the distribution documentation.\n\n   These conditions apply to any software derived from or based on the Catharon Packages, not just the unmodified files. If you use our work, you must acknowledge us. However, no fee need be paid to us.\n\n   <<var;name=\"bullet\";original=\"3.\";match=\".{0,20}\">>\n   Advertising\n   --------------\n\n   Neither Catharon Productions, Inc. and contributors nor you shall use the name of the other for commercial, advertising, or promotional purposes without specific prior written permission.\n\n   We suggest, but do not require, that you use the following phrase to refer to this software in your documentation: 'this software is based in part on the Catharon Typography Project'.\n\n   As you have not signed this license, you are not required to accept it. However, as the Catharon Packages are copyrighted material, only this license, or another one contracted with the authors, grants you the right to use, distribute, and modify it. Therefore, by using, distributing, or modifying the Catharon Packages, you indicate that you understand and accept all the terms of this license.\n   \n   ",
    "creationInfo" : "_:creationInfo_0",
    "expandedlicensing_isDeprecatedLicenseId" : false
  } ]
}