{
  "@context" : "https://spdx.org/rdf/3.0.1/spdx-context.jsonld",
  "@graph" : [ {
    "@id" : "_:creationInfo_0",
    "type" : "CreationInfo",
    "specVersion" : "3.0.1",
    "createdBy" : [ "https://spdx.org/licenses/creatoragent/f8acf30" ],
    "createdUsing" : [ "https://spdx.org/tools/licenselistpublisher" ],
    "created" : "2025-01-05T00:00:00Z",
    "comment" : "This object is created and maintained by the SPDX legal team (https://spdx.dev/engage/participate/legal-team/) using the LicenseListPublisher (https://github.com/spdx/licenselistpublisher)"
  }, {
    "spdxId" : "http://spdx.org/licenses/CC-BY-3.0-AU_document",
    "type" : "SpdxDocument",
    "rootElement" : [ "http://spdx.org/licenses/CC-BY-3.0-AU" ],
    "name" : "CC-BY-3.0-AU document",
    "comment" : "SPDX Document For CC-BY-3.0-AU",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "https://spdx.org/tools/licenselistpublisher",
    "type" : "Tool",
    "name" : "SPDX License List Publisher",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "https://spdx.org/licenses/creatoragent/f8acf30",
    "type" : "Organization",
    "name" : "SPDX Legal Team",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "http://spdx.org/licenses/CC-BY-3.0-AU",
    "type" : "expandedlicensing_ListedLicense",
    "expandedlicensing_isOsiApproved" : false,
    "expandedlicensing_seeAlso" : [ "https://creativecommons.org/licenses/by/3.0/au/legalcode" ],
    "simplelicensing_licenseText" : "Creative Commons Attribution 3.0 Australia\n\nCREATIVE COMMONS CORPORATION IS NOT A LAW FIRM AND DOES NOT PROVIDE LEGAL SERVICES. DISTRIBUTION OF THIS LICENCE DOES NOT CREATE AN ATTORNEY-CLIENT RELATIONSHIP. CREATIVE COMMONS PROVIDES THIS INFORMATION ON AN \"AS-IS\" BASIS. CREATIVE COMMONS MAKES NO WARRANTIES REGARDING THE INFORMATION PROVIDED, AND DISCLAIMS LIABILITY FOR DAMAGES RESULTING FROM ITS USE.\nLicence\n\nTHE WORK (AS DEFINED BELOW) IS PROVIDED UNDER THE TERMS OF THIS CREATIVE COMMONS PUBLIC LICENCE (\"LICENCE\"). THE WORK IS PROTECTED BY COPYRIGHT AND/OR OTHER APPLICABLE LAW. ANY USE OF THE WORK OTHER THAN AS AUTHORISED UNDER THIS LICENCE OR COPYRIGHT LAW IS PROHIBITED.\n\nBY EXERCISING ANY RIGHTS TO THE WORK PROVIDED HERE, YOU ACCEPT AND AGREE TO BE BOUND BY THE TERMS OF THIS LICENCE. THE LICENSOR GRANTS YOU THE RIGHTS CONTAINED HERE IN CONSIDERATION OF YOUR ACCEPTANCE OF SUCH TERMS AND CONDITIONS.\n\n1. Definitions\n\n    a. \"Collection\" means the Work in its entirety in unmodified form along with one or more other separate and independent works, assembled into a collective whole. A Collection may, for example, include a periodical, encyclopedia or anthology. A Collection will not be considered a Derivative Work for the purposes of this Licence.\n    b. \"Derivative Work\" means material in any form that is created by editing, modifying or adapting the Work, a substantial part of the Work, or the Work and other pre-existing works. Derivative Works may, for example, include a translation, adaptation, musical arrangement, dramatisation, motion picture version, sound recording, art reproduction, abridgment, condensation, or any other form in which the Work may be transformed or adapted, except that a Collection will not be considered a Derivative Work for the purpose of this Licence. For the avoidance of doubt, where the Work is a musical composition or sound recording, the synchronization of the Work in timed-relation with a moving image (\"synching\") will be considered a Derivative Work for the purpose of this Licence.\n    c. \"Distribute\" means to make available to the public by any means, including publication, electronic communication, or broadcast.\n    d. \"Licensor\" means the individual, individuals, entity or entities that offer(s) the Work under the terms of this Licence.\n    e. \"Original Author\" means the individual, individuals, entity or entities who created the Work.\n    f. \"Reproduce\" means to make a copy of the Work in any material form (eg storage in digital form).\n    g. \"Work\" means the material (including any work or other subject matter) protected by copyright which is offered under the terms of this Licence. This may include (without limitation) a literary, dramatic, musical or artistic work; a sound recording or cinematograph film; a published edition of a literary, dramatic, musical or artistic work; or a television or sound broadcast.\n    h. \"You\" means an individual or entity exercising rights under this Licence who has not previously violated the terms of this Licence with respect to the Work, or who has received express permission from the Licensor to exercise rights under this Licence despite a previous violation.\n\n2. Fair Dealing and Other Rights\n\nNothing in this Licence is intended to reduce, limit, or restrict any uses free from copyright or rights arising from limitations or exceptions under copyright law or any other applicable laws.\n\n3. Licence Grant\n\n3A Grant of Rights\n\nProvided that the terms set out in this Licence are satisfied, the Licensor grants to You a worldwide, royalty-free, non-exclusive, perpetual (for the duration of the applicable copyright) licence to exercise the following rights:\n    a. Reproduce the Work;\n    b. incorporate the Work into one or more Collections;\n    c. Reproduce the Work as incorporated in any Collection;\n    d. create and Reproduce one or more Derivative Works; and\n    e. Distribute and publicly perform the Work, a Derivative Work or the Work as incorporated in any Collection.\n\n3B Media and Formats\n\nThe above rights may be exercised in any media or format whether now known or hereafter created. They include the right to make modifications that are technically necessary to exercise the rights in other media and formats.\n\n3C Other Rights Reserved\n\nAll rights not expressly granted by the Licensor are reserved. The Licensor waives the right to collect royalties for any exercise by You of the rights granted under this Licence.\n\n4. Restrictions\n\nThe licence granted above is limited by the following restrictions.\n\n4A Restrictions on Distribution and Public Performance of the Work\n\n    a. You may Distribute and publicly perform the Work only under the terms of this Licence.\n    b. You must include a copy of, or the Uniform Resource Identifier (such as a web link) for, this Licence with every copy of the Work You Distribute or publicly perform.\n    c. You must not offer or impose any terms on the Work that restrict this Licence or the ability of a recipient of the Work from You to exercise the rights granted to them by this Licence.\n    d. You are not granted the right to sublicense the Work. The rights of recipients of the Work from You are governed by clause 9.\n    e. You must keep intact all notices that refer to this Licence and to the disclaimer of warranties with every copy of the Work You Distribute or publicly perform.\n    f. When You Distribute or publicly perform the Work, You must not impose any technological measures on it that restrict the ability of a recipient of the Work from You to exercise the rights granted to them by this Licence.\n    g. For the avoidance of doubt, while this clause 4A applies to the Work as incorporated into a Collection, it does not require other material within the Collection, or the Collection apart from the Work itself, to be made subject to this Licence.\n\n4B Attribution and Notice Requirements\n\n    a. When You Distribute or publicly perform the Work or any Derivative Work or Collection You must keep intact all copyright notices for the Work.\n    b. When You Distribute or publicly perform the Work or any Derivative Work or Collection You must provide, in a manner reasonable to the medium or means You are using:\n        i. the name or pseudonym (if provided) of the Original Author and/or of any other party (such as a sponsor institute, publishing entity or journal) that the Original Author or Licensor has requested be attributed (such as in the copyright notice or terms of use). In this clause 4B these parties are referred to as \"Attribution Parties\";\n        ii. the title of the Work (if provided); and\n        iii. to the extent reasonably practicable, any Uniform Resource Identifier (such as a web link) that the Licensor specifies should be associated with the Work that refers to the copyright notice or licensing information for the Work.\n    c. For any Derivative Work You Distribute or publicly perform, You must take reasonable steps to clearly identify that changes were made to the Work. For example, a translation could be marked \"The original work was translated from English to Spanish\".\n    d. In the case of a Derivative Work or Collection, the above attribution should, at a minimum, appear as part of any credits for other contributing authors and be as prominent as the credits for those other authors.\n    e. You must, to the extent practicable, remove the above attribution from any Collection or Derivative Work if requested to do so by the Licensor or Original Author.\n    f. For the avoidance of doubt, You may only use the credit required by this clause 4B for the purpose of attribution in the manner set out above. By exercising Your rights under this Licence, You must not assert or imply:\n        i. any connection between the Original Author, Licensor or any other Attribution Party and You or Your use of the Work; or\n        ii. sponsorship or endorsement by the Original Author, Licensor or any other Attribution Party of You or Your use of the Work,\n    without their separate, express prior written permission.\n\n4C Moral Rights\n\nMoral rights remain unaffected to the extent they are recognised and nonwaivable at law. In this clause 4C, \"moral rights\" means the personal rights granted by law to the Original Author of a copyright work. For example, Part IX of the Copyright Act 1968 (Cth) grants authors the right of integrity of authorship, the right of attribution of authorship, and the right not to have authorship falsely attributed.\n\n5. Representations, Warranties and Disclaimer\n\nExcept as expressly stated in this Licence or otherwise agreed to by the parties in writing, and to the full extent permitted by applicable law, the Licensor offers the Work \"as-is\" and makes no representations, warranties or conditions of any kind concerning the Work, express, implied, statutory or otherwise. This includes, without limitation, any representations, warranties or conditions regarding:\n    a. the contents or accuracy of the Work;\n        i. title, merchantability, or fitness for a particular purpose;\n        ii. non-infringement;\n        iii. the absence of latent or other defects; or\n        iv. the presence or absence of errors, whether or not discoverable.\n    b. The Trade Practices Act 1974 (Cth), and the corresponding State and Territory fair trading legislation, imply certain warranties and conditions in certain circumstances, such as the right to supply or fitness for purpose of goods or services supplied to a consumer. Clause 5(a) cannot and is not intended to exclude, restrict or modify these warranties.\n\n6. Limit of Liability\n\n    a. To the full extent permitted by applicable law, and except for any liability arising from contrary agreement, in no event will the Licensor be liable to You on any legal basis (including without limitation, negligence) for any loss or damage whatsoever, including (without limitation):\n        i. loss of production or operation time, loss, damage or corruption of data or records; or\n        ii. loss of anticipated savings, opportunity, revenue, profit or goodwill, or other economic loss; or\n        iii. any special, incidental, consequential, punitive or exemplary damages arising out of or in connection with this Licence or the use of the Work, even if the Licensor has been advised of the possibility of such damages.\n    b. If applicable legislation implies warranties or conditions, or imposes obligations or liability on the Licensor in respect of this Licence that cannot be wholly or partly excluded, restricted or modified, the Licensor’s liability is limited, to the full extent permitted by the applicable legislation, at its option, to:\n        i. in the case of goods, any one or more of the following:\n            * the replacement of the goods or the supply of equivalent goods;\n            * the repair of the goods;\n            * the payment of the cost of replacing the goods or of acquiring equivalent goods;\n            * the payment of the cost of having the goods repaired; or\n        ii. in the case of services:\n            * the supplying of the services again; or\n            * the payment of the cost of having the services supplied again.\n    c. The Trade Practices Act 1974 (Cth), and the corresponding State and Territory fair trading legislation, restrict the limitation of liability in certain circumstances, such as a contract for the supply of goods or services of a kind ordinarily acquired for personal, domestic, or household use. Clauses 6(a) and 6(b) cannot and are not intended to apply in circumstances where it is prohibited by law.\n\n7. Termination\n\nThis Licence and the rights granted to You under this Licence shall terminate automatically upon any breach by You of the terms of the Licence. Individuals or entities who have received a Derivative Work or a Collection from You pursuant to this Licence, however, will not have their licences terminated provided they remain in full compliance with those licences. Clauses 1, 2, 5, 6, 7, 8, 9, 10, 11, 12 and 13 shall survive any termination of this Licence.\n\n8. Licensor’s Rights Retained\n\nSubject to the above terms, the Licence granted here is perpetual (for the duration of the applicable copyright in the Work). Notwithstanding this, the Licensor reserves the right to release the Work under different licence terms or to stop distributing the Work at any time. However, any such release will not serve to withdraw this Licence (or any other licence that has been granted under the terms of this Licence), and this Licence will continue in full force and effect unless terminated as stated above.\n\n9. Licence Grant to Recipients of the Work from You\n\nEach time You Distribute or publicly perform the Work, a Derivative Work or a Collection the Licensor offers the recipient a licence to the Work on the same terms as are granted to You under this Licence.\n\n10. Severability\n\nIf any provision of this Licence is invalid or unenforceable under applicable law, it shall not affect the validity or enforceability of the remainder of the terms of this Licence. Without further action by the parties to this agreement, such provision shall be reformed to the minimum extent necessary to make such provision valid and enforceable.\n\n11. Waivers and Consents\n\nNo term of this Licence shall be deemed waived and no breach consented to unless such waiver or consent is in writing and signed by the relevant party.\n\n12. Entire Agreement\n\nThis Licence constitutes the entire agreement between the parties. To the full extent permitted by law, there are no understandings, agreements or representations with respect to the Work not specified here. The Licensor shall not be bound by any additional provisions that may appear in any communication from You. This Licence may not be modified without the written agreement of the Licensor and You.\n\n13. Governing Law\n\nThe construction, validity and performance of this Licence shall be governed by the laws in force in the Australian Capital Territory, Australia.\n\nCreative Commons Notice\n\nCreative Commons is not a party to this Licence, and, to the full extent permitted by applicable law, makes no representation or warranty whatsoever in connection with the Work. To the full extent permitted by applicable law, Creative Commons will not be liable to You or any party on any legal theory (including, without limitation, negligence) for any damages whatsoever, including without limitation any general, special, incidental or consequential damages arising in connection to this licence. Notwithstanding the foregoing two (2) sentences, if Creative Commons has expressly identified itself as the Licensor hereunder, it shall have all rights and obligations of Licensor. Except for the limited purpose of indicating to the public that the Work is licensed under the Licence, neither party will use the trademark \"Creative Commons\" or any related trademark or logo of Creative Commons without the prior written consent of Creative Commons. Any permitted use will be in compliance with Creative Commons’ then-current trademark usage guidelines, as may be published on its website or otherwise made available upon request from time to time.\n\nCreative Commons may be contacted at https://creativecommons.org/ .\n",
    "name" : "Creative Commons Attribution 3.0 Australia",
    "expandedlicensing_standardLicenseTemplate" : "<<beginOptional>>Creative Commons Attribution 3.0 Australia\n\n<<endOptional>><<beginOptional>> CREATIVE COMMONS CORPORATION IS NOT A LAW FIRM AND DOES NOT PROVIDE LEGAL SERVICES. DISTRIBUTION OF THIS LICENCE DOES NOT CREATE AN ATTORNEY-CLIENT RELATIONSHIP. CREATIVE COMMONS PROVIDES THIS INFORMATION ON AN \"AS-IS\" BASIS. CREATIVE COMMONS MAKES NO WARRANTIES REGARDING THE INFORMATION PROVIDED, AND DISCLAIMS LIABILITY FOR DAMAGES RESULTING FROM ITS USE.\n\nLicense\n\n<<endOptional>>\nTHE WORK (AS DEFINED BELOW) IS PROVIDED UNDER THE TERMS OF THIS CREATIVE COMMONS PUBLIC LICENCE (\"LICENCE\"). THE WORK IS PROTECTED BY COPYRIGHT AND/OR OTHER APPLICABLE LAW. ANY USE OF THE WORK OTHER THAN AS AUTHORISED UNDER THIS LICENCE OR COPYRIGHT LAW IS PROHIBITED.\n\nBY EXERCISING ANY RIGHTS TO THE WORK PROVIDED HERE, YOU ACCEPT AND AGREE TO BE BOUND BY THE TERMS OF THIS LICENCE. THE LICENSOR GRANTS YOU THE RIGHTS CONTAINED HERE IN CONSIDERATION OF YOUR ACCEPTANCE OF SUCH TERMS AND CONDITIONS.\n\n   <<var;name=\"bullet\";original=\"1.\";match=\".{0,20}\">> Definitions\n      <<var;name=\"bullet\";original=\"a.\";match=\".{0,20}\">> \"Collection\" means the Work in its entirety in unmodified form along with one or more other separate and independent works, assembled into a collective whole. A Collection may, for example, include a periodical, encyclopedia or anthology. A Collection will not be considered a Derivative Work for the purposes of this Licence.\n      <<var;name=\"bullet\";original=\"b.\";match=\".{0,20}\">> \"Derivative Work\" means material in any form that is created by editing, modifying or adapting the Work, a substantial part of the Work, or the Work and other pre-existing works. Derivative Works may, for example, include a translation, adaptation, musical arrangement, dramatisation, motion picture version, sound recording, art reproduction, abridgment, condensation, or any other form in which the Work may be transformed or adapted, except that a Collection will not be considered a Derivative Work for the purpose of this Licence. For the avoidance of doubt, where the Work is a musical composition or sound recording, the synchronization of the Work in timed-relation with a moving image (\"synching\") will be considered a Derivative Work for the purpose of this Licence.\n      <<var;name=\"bullet\";original=\"c.\";match=\".{0,20}\">> \"Distribute\" means to make available to the public by any means, including publication, electronic communication, or broadcast.\n      <<var;name=\"bullet\";original=\"d.\";match=\".{0,20}\">> \"Licensor\" means the individual, individuals, entity or entities that offer(s) the Work under the terms of this Licence.\n      <<var;name=\"bullet\";original=\"e.\";match=\".{0,20}\">> \"Original Author\" means the individual, individuals, entity or entities who created the Work.\n      <<var;name=\"bullet\";original=\"f.\";match=\".{0,20}\">> \"Reproduce\" means to make a copy of the Work in any material form (eg storage in digital form).\n      <<var;name=\"bullet\";original=\"g.\";match=\".{0,20}\">> \"Work\" means the material (including any work or other subject matter) protected by copyright which is offered under the terms of this Licence. This may include (without limitation) a literary, dramatic, musical or artistic work; a sound recording or cinematograph film; a published edition of a literary, dramatic, musical or artistic work; or a television or sound broadcast.\n      <<var;name=\"bullet\";original=\"h.\";match=\".{0,20}\">> \"You\" means an individual or entity exercising rights under this Licence who has not previously violated the terms of this Licence with respect to the Work, or who has received express permission from the Licensor to exercise rights under this Licence despite a previous violation.\n   <<var;name=\"bullet\";original=\"2.\";match=\".{0,20}\">> Fair Dealing and Other Rights Nothing in this Licence is intended to reduce, limit, or restrict any uses free from copyright or rights arising from limitations or exceptions under copyright law or any other applicable laws.\n   <<var;name=\"bullet\";original=\"3.\";match=\".{0,20}\">> License Grant\n   3A Grant of Rights\n\n   Provided that the terms set out in this Licence are satisfied, the Licensor grants to You a worldwide, royalty-free, non-exclusive, perpetual (for the duration of the applicable copyright) licence to exercise the following rights:\n\n      <<var;name=\"bullet\";original=\"a.\";match=\".{0,20}\">> Reproduce the Work;\n      <<var;name=\"bullet\";original=\"b.\";match=\".{0,20}\">> incorporate the Work into one or more Collections;\n      <<var;name=\"bullet\";original=\"c.\";match=\".{0,20}\">> Reproduce the Work as incorporated in any Collection;\n      <<var;name=\"bullet\";original=\"d.\";match=\".{0,20}\">> create and Reproduce one or more Derivative Works; and\n      <<var;name=\"bullet\";original=\"e.\";match=\".{0,20}\">> Distribute and publicly perform the Work, a Derivative Work or the Work as incorporated in any Collection.\n   3B Media and Formats\n\n   The above rights may be exercised in any media or format whether now known or hereafter created. They include the right to make modifications that are technically necessary to exercise the rights in other media and formats.\n\n   3C Other Rights Reserved\n\n   All rights not expressly granted by the Licensor are reserved. The Licensor waives the right to collect royalties for any exercise by You of the rights granted under this Licence.\n\n   <<var;name=\"bullet\";original=\"4.\";match=\".{0,20}\">> Restrictions\n   The licence granted above is limited by the following restrictions.\n\n      4A Restrictions on Distribution and Public Performance of the Work\n      \n         <<var;name=\"bullet\";original=\"a.\";match=\".{0,20}\">> You may Distribute and publicly perform the Work only under the terms of this Licence.\n         <<var;name=\"bullet\";original=\"b.\";match=\".{0,20}\">> You must include a copy of, or the Uniform Resource Identifier (such as a web link) for, this Licence with every copy of the Work You Distribute or publicly perform.\n         <<var;name=\"bullet\";original=\"c.\";match=\".{0,20}\">> You must not offer or impose any terms on the Work that restrict this Licence or the ability of a recipient of the Work from You to exercise the rights granted to them by this Licence.\n         <<var;name=\"bullet\";original=\"d.\";match=\".{0,20}\">> You are not granted the right to sublicense the Work. The rights of recipients of the Work from You are governed by clause 9.\n         <<var;name=\"bullet\";original=\"e.\";match=\".{0,20}\">> You must keep intact all notices that refer to this Licence and to the disclaimer of warranties with every copy of the Work You Distribute or publicly perform.\n         <<var;name=\"bullet\";original=\"f.\";match=\".{0,20}\">> When You Distribute or publicly perform the Work, You must not impose any technological measures on it that restrict the ability of a recipient of the Work from You to exercise the rights granted to them by this Licence.\n         <<var;name=\"bullet\";original=\"g.\";match=\".{0,20}\">> For the avoidance of doubt, while this clause 4A applies to the Work as incorporated into a Collection, it does not require other material within the Collection, or the Collection apart from the Work itself, to be made subject to this Licence.\n      4B Attribution and Notice Requirements\n      \n         <<var;name=\"bullet\";original=\"a.\";match=\".{0,20}\">> When You Distribute or publicly perform the Work or any Derivative Work or Collection You must keep intact all copyright notices for the Work.\n         <<var;name=\"bullet\";original=\"b.\";match=\".{0,20}\">> When You Distribute or publicly perform the Work or any Derivative Work or Collection You must provide, in a manner reasonable to the medium or means You are using:\n            <<var;name=\"bullet\";original=\"i.\";match=\".{0,20}\">> the name or pseudonym (if provided) of the Original Author and/or of any other party (such as a sponsor institute, publishing entity or journal) that the Original Author or Licensor has requested be attributed (such as in the copyright notice or terms of use). In this clause 4B these parties are referred to as \"Attribution Parties\";\n            <<var;name=\"bullet\";original=\"ii.\";match=\".{0,20}\">> the title of the Work (if provided); and\n            <<var;name=\"bullet\";original=\"iii.\";match=\".{0,20}\">> to the extent reasonably practicable, any Uniform Resource Identifier (such as a web link) that the Licensor specifies should be associated with the Work that refers to the copyright notice or licensing information for the Work.\n         <<var;name=\"bullet\";original=\"c.\";match=\".{0,20}\">> For any Derivative Work You Distribute or publicly perform, You must take reasonable steps to clearly identify that changes were made to the Work. For example, a translation could be marked \"The original work was translated from English to Spanish\".\n         <<var;name=\"bullet\";original=\"d.\";match=\".{0,20}\">> In the case of a Derivative Work or Collection, the above attribution should, at a minimum, appear as part of any credits for other contributing authors and be as prominent as the credits for those other authors.\n         <<var;name=\"bullet\";original=\"e.\";match=\".{0,20}\">> You must, to the extent practicable, remove the above attribution from any Collection or Derivative Work if requested to do so by the Licensor or Original Author.\n         <<var;name=\"bullet\";original=\"f.\";match=\".{0,20}\">> For the avoidance of doubt, You may only use the credit required by this clause 4B for the purpose of attribution in the manner set out above. By exercising Your rights under this Licence, You must not assert or imply:\n            <<var;name=\"bullet\";original=\"i.\";match=\".{0,20}\">> any connection between the Original Author, Licensor or any other Attribution Party and You or Your use of the Work; or\n            <<var;name=\"bullet\";original=\"ii.\";match=\".{0,20}\">> sponsorship or endorsement by the Original Author, Licensor or any other Attribution Party of You or Your use of the Work,\n         without their separate, express prior written permission.\n\n      4C Moral Rights\n      Moral rights remain unaffected to the extent they are recognised and nonwaivable at law. In this clause 4C, \"moral rights\" means the personal rights granted by law to the Original Author of a copyright work. For example, Part IX of the Copyright Act 1968 (Cth) grants authors the right of integrity of authorship, the right of attribution of authorship, and the right not to have authorship falsely attributed.\n\n   <<var;name=\"bullet\";original=\"5.\";match=\".{0,20}\">> Representations, Warranties and Disclaimer\n      <<var;name=\"bullet\";original=\"a.\";match=\".{0,20}\">> Except as expressly stated in this Licence or otherwise agreed to by the parties in writing, and to the full extent permitted by applicable law, the Licensor offers the Work \"as-is\" and makes no representations, warranties or conditions of any kind concerning the Work, express, implied, statutory or otherwise. This includes, without limitation, any representations, warranties or conditions regarding:\n      \n         <<var;name=\"bullet\";original=\"i.\";match=\".{0,20}\">> the contents or accuracy of the Work;\n         <<var;name=\"bullet\";original=\"ii.\";match=\".{0,20}\">> title, merchantability, or fitness for a particular purpose;\n         <<var;name=\"bullet\";original=\"iii.\";match=\".{0,20}\">> non-infringement;\n         <<var;name=\"bullet\";original=\"iv.\";match=\".{0,20}\">> the absence of latent or other defects; or\n         <<var;name=\"bullet\";original=\"v.\";match=\".{0,20}\">> the presence or absence of errors, whether or not discoverable.\n      <<var;name=\"bullet\";original=\"b.\";match=\".{0,20}\">> The Trade Practices Act 1974 (Cth), and the corresponding State and Territory fair trading legislation, imply certain warranties and conditions in certain circumstances, such as the right to supply or fitness for purpose of goods or services supplied to a consumer. Clause 5(a) cannot and is not intended to exclude, restrict or modify these warranties.\n   <<var;name=\"bullet\";original=\"6.\";match=\".{0,20}\">> Limit of Liability\n      <<var;name=\"bullet\";original=\"a.\";match=\".{0,20}\">> To the full extent permitted by applicable law, and except for any liability arising from contrary agreement, in no event will the Licensor be liable to You on any legal basis (including without limitation, negligence) for any loss or damage whatsoever, including (without limitation):\n      \n         <<var;name=\"bullet\";original=\"i.\";match=\".{0,20}\">> loss of production or operation time, loss, damage or corruption of data or records; or\n         <<var;name=\"bullet\";original=\"ii.\";match=\".{0,20}\">> loss of anticipated savings, opportunity, revenue, profit or goodwill, or other economic loss; or\n         <<var;name=\"bullet\";original=\"iii.\";match=\".{0,20}\">> any special, incidental, consequential, punitive or exemplary damages arising out of or in connection with this Licence or the use of the Work, even if the Licensor has been advised of the possibility of such damages.\n      <<var;name=\"bullet\";original=\"b.\";match=\".{0,20}\">> If applicable legislation implies warranties or conditions, or imposes obligations or liability on the Licensor in respect of this Licence that cannot be wholly or partly excluded, restricted or modified, the Licensor's liability is limited, to the full extent permitted by the applicable legislation, at its option, to:\n      \n         <<var;name=\"bullet\";original=\"i.\";match=\".{0,20}\">> in the case of goods, any one or more of the following:\n         \n            <<var;name=\"bullet\";original=\"*\";match=\".{0,20}\">> the replacement of the goods or the supply of equivalent goods;\n            <<var;name=\"bullet\";original=\"*\";match=\".{0,20}\">> the repair of the goods;\n            <<var;name=\"bullet\";original=\"*\";match=\".{0,20}\">> the payment of the cost of replacing the goods or of acquiring equivalent goods;\n            <<var;name=\"bullet\";original=\"*\";match=\".{0,20}\">> the payment of the cost of having the goods repaired; or\n         <<var;name=\"bullet\";original=\"ii.\";match=\".{0,20}\">> in the case of services:\n         \n            <<var;name=\"bullet\";original=\"*\";match=\".{0,20}\">> the supplying of the services again; or\n            <<var;name=\"bullet\";original=\"*\";match=\".{0,20}\">> the payment of the cost of having the services supplied again.\n      <<var;name=\"bullet\";original=\"c.\";match=\".{0,20}\">> The Trade Practices Act 1974 (Cth), and the corresponding State and Territory fair trading legislation, restrict the limitation of liability in certain circumstances, such as a contract for the supply of goods or services of a kind ordinarily acquired for personal, domestic, or household use. Clauses 6(a) and 6(b) cannot and are not intended to apply in circumstances where it is prohibited by law.\n   <<var;name=\"bullet\";original=\"7.\";match=\".{0,20}\">> Termination\n   This Licence and the rights granted to You under this Licence shall terminate automatically upon any breach by You of the terms of the Licence. Individuals or entities who have received a Derivative Work or a Collection from You pursuant to this Licence, however, will not have their licences terminated provided they remain in full compliance with those licences. Clauses 1, 2, 5, 6, 7, 8, 9, 10, 11, 12 and 13 shall survive any termination of this Licence.\n\n   <<var;name=\"bullet\";original=\"8.\";match=\".{0,20}\">> Licensor's Rights Retained\n   Subject to the above terms, the Licence granted here is perpetual (for the duration of the applicable copyright in the Work). Notwithstanding this, the Licensor reserves the right to release the Work under different licence terms or to stop distributing the Work at any time. However, any such release will not serve to withdraw this Licence (or any other licence that has been granted under the terms of this Licence), and this Licence will continue in full force and effect unless terminated as stated above.\n\n   <<var;name=\"bullet\";original=\"9.\";match=\".{0,20}\">> Licence Grant to Recipients of the Work from You\n   Each time You Distribute or publicly perform the Work, a Derivative Work or a Collection the Licensor offers the recipient a licence to the Work on the same terms as are granted to You under this Licence.\n\n   <<var;name=\"bullet\";original=\"10.\";match=\".{0,20}\">> Severability\n   If any provision of this Licence is invalid or unenforceable under applicable law, it shall not affect the validity or enforceability of the remainder of the terms of this Licence. Without further action by the parties to this agreement, such provision shall be reformed to the minimum extent necessary to make such provision valid and enforceable.\n\n   <<var;name=\"bullet\";original=\"11.\";match=\".{0,20}\">> Waivers and Consents\n   No term of this Licence shall be deemed waived and no breach consented to unless such waiver or consent is in writing and signed by the relevant party.\n\n   <<var;name=\"bullet\";original=\"12.\";match=\".{0,20}\">> Entire Agreement\n   This Licence constitutes the entire agreement between the parties. To the full extent permitted by law, there are no understandings, agreements or representations with respect to the Work not specified here. The Licensor shall not be bound by any additional provisions that may appear in any communication from You. This Licence may not be modified without the written agreement of the Licensor and You.\n\n   <<var;name=\"bullet\";original=\"13.\";match=\".{0,20}\">> Governing Law\n   The construction, validity and performance of this Licence shall be governed by the laws in force in the Australian Capital Territory, Australia.\n   \n   <<beginOptional>>Creative Commons Notice\n\nCreative Commons is not a party to this Licence, and, to the full extent permitted by applicable law, makes no representation or warranty whatsoever in connection with the Work. To the full extent permitted by applicable law, Creative Commons will not be liable to You or any party on any legal theory (including, without limitation, negligence) for any damages whatsoever, including without limitation any general, special, incidental or consequential damages arising in connection to this licence.\n\nNotwithstanding the foregoing two (2) sentences, if Creative Commons has expressly identified itself as the Licensor hereunder, it shall have all rights and obligations of Licensor. Except for the limited purpose of indicating to the public that the Work is licensed under the Licence, neither party will use the trademark \"Creative Commons\" or any related trademark or logo of Creative Commons without the prior written consent of Creative Commons. Any permitted use will be in compliance with Creative Commons' then-current trademark usage guidelines, as may be published on its website or otherwise made available upon request from time to time.\n\nCreative Commons may be contacted at https://creativecommons.org/ .\n\n<<endOptional>>",
    "creationInfo" : "_:creationInfo_0",
    "expandedlicensing_isDeprecatedLicenseId" : false
  } ]
}