{
  "@context" : "https://spdx.org/rdf/3.0.1/spdx-context.jsonld",
  "@graph" : [ {
    "@id" : "_:creationInfo_0",
    "type" : "CreationInfo",
    "specVersion" : "3.0.1",
    "createdBy" : [ "https://spdx.org/licenses/creatoragent/f8acf30" ],
    "createdUsing" : [ "https://spdx.org/tools/licenselistpublisher" ],
    "created" : "2025-01-05T00:00:00Z",
    "comment" : "This object is created and maintained by the SPDX legal team (https://spdx.dev/engage/participate/legal-team/) using the LicenseListPublisher (https://github.com/spdx/licenselistpublisher)"
  }, {
    "spdxId" : "http://spdx.org/licenses/CC-PDM-1.0_document",
    "type" : "SpdxDocument",
    "rootElement" : [ "http://spdx.org/licenses/CC-PDM-1.0" ],
    "name" : "CC-PDM-1.0 document",
    "comment" : "SPDX Document For CC-PDM-1.0",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "https://spdx.org/tools/licenselistpublisher",
    "type" : "Tool",
    "name" : "SPDX License List Publisher",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "https://spdx.org/licenses/creatoragent/f8acf30",
    "type" : "Organization",
    "name" : "SPDX Legal Team",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "http://spdx.org/licenses/CC-PDM-1.0",
    "type" : "expandedlicensing_ListedLicense",
    "expandedlicensing_isOsiApproved" : false,
    "expandedlicensing_seeAlso" : [ "https://creativecommons.org/publicdomain/mark/1.0/", "https://creativecommons.org/share-your-work/cclicenses/" ],
    "simplelicensing_licenseText" : "No Copyright\n\nThis work has been identified as being free of known restrictions under\ncopyright law, including all related and neighboring rights.\n\n\nYou can copy, modify, distribute and perform the work, even for commercial\npurposes, all without asking permission. See Other Information below.\n\nOther Information\n\nThe work may not be free of known copyright restrictions in all jurisdictions .\n\nPersons may have other rights in or related to the work, such as patent or\ntrademark rights, and others may have rights in how the work is used, such as\npublicity or privacy rights.\n\nIn some jurisdictions moral rights of the author may persist beyond the term of\ncopyright. These rights may include the right to be identified as the author\nand the right to object to derogatory treatments.\n\nUnless expressly stated otherwise, the person who identified the work makes no\nwarranties about the work, and disclaims liability for all uses of the work, to\nthe fullest extent permitted by applicable law.\n\nWhen using or citing the work, you should not imply endorsement by the author\nor the person who identified the work.\n",
    "name" : "Creative    Commons Public Domain Mark 1.0 Universal",
    "comment" : "As per Creative Commons, this is intended to provide a standard way to mark works that are no longer restricted by copyright to be marked as such in a standard and simple way. See https://creativecommons.org/public-domain/pdm/ for more information.",
    "expandedlicensing_standardLicenseTemplate" : "No Copyright\n\nThis work has been identified as being free of known restrictions under copyright law, including all related and neighboring rights.\n\nYou can copy, modify, distribute and perform the work, even for commercial purposes, all without asking permission. See Other Information below.\n\nOther Information\n\nThe work may not be free of known copyright restrictions in all jurisdictions.\n\nPersons may have other rights in or related to the work, such as patent or trademark rights, and others may have rights in how the work is used, such as publicity or privacy rights.\n\nIn some jurisdictions moral rights of the author may persist beyond the term of copyright. These rights may include the right to be identified as the author and the right to object to derogatory treatments.\n\nUnless expressly stated otherwise, the person who identified the work makes no warranties about the work, and disclaims liability for all uses of the work, to the fullest extent permitted by applicable law.\n\nWhen using or citing the work, you should not imply endorsement by the author or the person who identified the work.\n\n",
    "creationInfo" : "_:creationInfo_0",
    "expandedlicensing_isDeprecatedLicenseId" : false
  } ]
}