{
  "@context" : "https://spdx.org/rdf/3.0.1/spdx-context.jsonld",
  "@graph" : [ {
    "@id" : "_:creationInfo_0",
    "type" : "CreationInfo",
    "specVersion" : "3.0.1",
    "createdBy" : [ "https://spdx.org/licenses/creatoragent/f8acf30" ],
    "createdUsing" : [ "https://spdx.org/tools/licenselistpublisher" ],
    "created" : "2025-01-05T00:00:00Z",
    "comment" : "This object is created and maintained by the SPDX legal team (https://spdx.dev/engage/participate/legal-team/) using the LicenseListPublisher (https://github.com/spdx/licenselistpublisher)"
  }, {
    "spdxId" : "http://spdx.org/licenses/COIL-1.0_document",
    "type" : "SpdxDocument",
    "rootElement" : [ "http://spdx.org/licenses/COIL-1.0" ],
    "name" : "COIL-1.0 document",
    "comment" : "SPDX Document For COIL-1.0",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "https://spdx.org/tools/licenselistpublisher",
    "type" : "Tool",
    "name" : "SPDX License List Publisher",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "https://spdx.org/licenses/creatoragent/f8acf30",
    "type" : "Organization",
    "name" : "SPDX Legal Team",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "http://spdx.org/licenses/COIL-1.0",
    "type" : "expandedlicensing_ListedLicense",
    "expandedlicensing_isOsiApproved" : false,
    "expandedlicensing_seeAlso" : [ "https://coil.apotheon.org/plaintext/01.0.txt" ],
    "simplelicensing_licenseText" : "# Copyfree Open Innovation License\n\nThis is version 1.0 of the Copyfree Open Innovation License.\n\n## Terms and Conditions\n\nRedistributions, modified or unmodified, in whole or in part, must retain\napplicable notices of copyright or other legal privilege, these conditions, and\nthe following license terms and disclaimer.  Subject to these conditions, each\nholder of copyright or other legal privileges, author or assembler, and\ncontributor of this work, henceforth \"licensor\", hereby grants to any person\nwho obtains a copy of this work in any form:\n\n1. Permission to reproduce, modify, distribute, publish, sell, sublicense, use,\nand/or otherwise deal in the licensed material without restriction.\n\n2. A perpetual, worldwide, non-exclusive, royalty-free, gratis, irrevocable\npatent license to make, have made, provide, transfer, import, use, and/or\notherwise deal in the licensed material without restriction, for any and all\npatents held by such licensor and necessarily infringed by the form of the work\nupon distribution of that licensor's contribution to the work under the terms\nof this license.\n\nNO WARRANTY OF ANY KIND IS IMPLIED BY, OR SHOULD BE INFERRED FROM, THIS LICENSE\nOR THE ACT OF DISTRIBUTION UNDER THE TERMS OF THIS LICENSE, INCLUDING BUT NOT\nLIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE,\nAND NONINFRINGEMENT.  IN NO EVENT SHALL THE AUTHORS, ASSEMBLERS, OR HOLDERS OF\nCOPYRIGHT OR OTHER LEGAL PRIVILEGE BE LIABLE FOR ANY CLAIM, DAMAGES, OR OTHER\nLIABILITY, WHETHER IN ACTION OF CONTRACT, TORT, OR OTHERWISE ARISING FROM, OUT\nOF, OR IN CONNECTION WITH THE WORK OR THE USE OF OR OTHER DEALINGS IN THE WORK.\n",
    "name" : "Copyfree Open Innovation License",
    "expandedlicensing_standardLicenseTemplate" : "<<beginOptional>>Copyfree Open Innovation License\n\n<<endOptional>>\nThis is version 1.0 of the Copyfree Open Innovation License.\n\nTerms and Conditions\n\nRedistributions, modified or unmodified, in whole or in part, must retain applicable notices of copyright or other legal privilege, these conditions, and the following license terms and disclaimer. Subject to these conditions, each holder of copyright or other legal privileges, author or assembler, and contributor of this work, henceforth \"licensor\", hereby grants to any person who obtains a copy of this work in any form:\n\n   <<var;name=\"bullet\";original=\"1.\";match=\".{0,20}\">> Permission to reproduce, modify, distribute, publish, sell, sublicense, use, and/or otherwise deal in the licensed material without restriction.\n   <<var;name=\"bullet\";original=\"2.\";match=\".{0,20}\">> A perpetual, worldwide, non-exclusive, royalty-free, gratis, irrevocable patent license to make, have made, provide, transfer, import, use, and/or otherwise deal in the licensed material without restriction, for any and all patents held by such licensor and necessarily infringed by the form of the work upon distribution of that licensor's contribution to the work under the terms of this license.\nNO WARRANTY OF ANY KIND IS IMPLIED BY, OR SHOULD BE INFERRED FROM, THIS LICENSE OR THE ACT OF DISTRIBUTION UNDER THE TERMS OF THIS LICENSE, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS, ASSEMBLERS, OR HOLDERS OF COPYRIGHT OR OTHER LEGAL PRIVILEGE BE LIABLE FOR ANY CLAIM, DAMAGES, OR OTHER LIABILITY, WHETHER IN ACTION OF CONTRACT, TORT, OR OTHERWISE ARISING FROM, OUT OF, OR IN CONNECTION WITH THE WORK OR THE USE OF OR OTHER DEALINGS IN THE WORK.\n\n",
    "creationInfo" : "_:creationInfo_0",
    "expandedlicensing_isDeprecatedLicenseId" : false
  } ]
}