{
  "@context" : "https://spdx.org/rdf/3.0.1/spdx-context.jsonld",
  "@graph" : [ {
    "@id" : "_:creationInfo_0",
    "type" : "CreationInfo",
    "specVersion" : "3.0.1",
    "createdBy" : [ "https://spdx.org/licenses/creatoragent/f8acf30" ],
    "createdUsing" : [ "https://spdx.org/tools/licenselistpublisher" ],
    "created" : "2025-01-05T00:00:00Z",
    "comment" : "This object is created and maintained by the SPDX legal team (https://spdx.dev/engage/participate/legal-team/) using the LicenseListPublisher (https://github.com/spdx/licenselistpublisher)"
  }, {
    "spdxId" : "http://spdx.org/licenses/HPND-export2-US_document",
    "type" : "SpdxDocument",
    "rootElement" : [ "http://spdx.org/licenses/HPND-export2-US" ],
    "name" : "HPND-export2-US document",
    "comment" : "SPDX Document For HPND-export2-US",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "https://spdx.org/tools/licenselistpublisher",
    "type" : "Tool",
    "name" : "SPDX License List Publisher",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "https://spdx.org/licenses/creatoragent/f8acf30",
    "type" : "Organization",
    "name" : "SPDX Legal Team",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "http://spdx.org/licenses/HPND-export2-US",
    "type" : "expandedlicensing_ListedLicense",
    "expandedlicensing_isOsiApproved" : false,
    "expandedlicensing_seeAlso" : [ "https://github.com/krb5/krb5/blob/krb5-1.21.2-final/NOTICE#L111-L133", "https://web.mit.edu/kerberos/krb5-1.21/doc/mitK5license.html" ],
    "simplelicensing_licenseText" : "Copyright 2004-2008 Apple Inc.  All Rights Reserved.\n\n   Export of this software from the United States of America may\n   require a specific license from the United States Government.\n   It is the responsibility of any person or organization\n   contemplating export to obtain such a license before exporting.\n\nWITHIN THAT CONSTRAINT, permission to use, copy, modify, and\ndistribute this software and its documentation for any purpose and\nwithout fee is hereby granted, provided that the above copyright\nnotice appear in all copies and that both that copyright notice and\nthis permission notice appear in supporting documentation, and that\nthe name of Apple Inc. not be used in advertising or publicity\npertaining to distribution of the software without specific,\nwritten prior permission.  Apple Inc. makes no representations\nabout the suitability of this software for any purpose.  It is\nprovided \"as is\" without express or implied warranty.\n\nTHIS SOFTWARE IS PROVIDED \"AS IS\" AND WITHOUT ANY EXPRESS OR\nIMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED\nWARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.\n",
    "name" : "HPND with US Government export control and 2 disclaimers",
    "comment" : "This license is very similar to HPND-export-US, but adds a second disclaimer.",
    "expandedlicensing_standardLicenseTemplate" : "<<var;name=\"copyright\";original=\"Copyright 2004-2008 Apple Inc. All Rights Reserved.\";match=\".{0,5000}\">>\nExport of this software from the United States of America may require a specific license from the United States Government. It is the responsibility of any person or organization contemplating export to obtain such a license before exporting.\n\nWITHIN THAT CONSTRAINT, permission to use, copy, modify, and distribute this software and its documentation for any purpose and without fee is hereby granted, provided that the above copyright notice appear in all copies and that both that copyright notice and this permission notice appear in supporting documentation, and that the name of <<var;name=\"copyrightHolder0\";original=\"Apple Inc.\";match=\".*\">> not be used in advertising or publicity pertaining to distribution of the software without specific, written prior permission. <<var;name=\"copyrightHolder1\";original=\"Apple Inc.\";match=\".*\">> . makes no representations about the suitability of this software for any purpose. It is provided \"as is\" without express or implied warranty.\n\nTHIS SOFTWARE IS PROVIDED \"AS IS\" AND WITHOUT ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.\n\n",
    "creationInfo" : "_:creationInfo_0",
    "expandedlicensing_isDeprecatedLicenseId" : false
  } ]
}