{
  "@context" : "https://spdx.org/rdf/3.0.1/spdx-context.jsonld",
  "@graph" : [ {
    "@id" : "_:creationInfo_0",
    "type" : "CreationInfo",
    "specVersion" : "3.0.1",
    "createdBy" : [ "https://spdx.org/licenses/creatoragent/297da51" ],
    "createdUsing" : [ "https://spdx.org/tools/licenselistpublisher" ],
    "created" : "2026-01-30T00:00:00Z",
    "comment" : "This object is created and maintained by the SPDX legal team (https://spdx.dev/engage/participate/legal-team/) using the LicenseListPublisher (https://github.com/spdx/licenselistpublisher)"
  }, {
    "spdxId" : "http://spdx.org/licenses/kvirc-openssl-exception_document",
    "type" : "SpdxDocument",
    "rootElement" : [ "http://spdx.org/licenses/kvirc-openssl-exception" ],
    "name" : "kvirc-openssl-exception document",
    "comment" : "SPDX Document For kvirc-openssl-exception",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "https://spdx.org/tools/licenselistpublisher",
    "type" : "Tool",
    "name" : "SPDX License List Publisher",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "http://spdx.org/licenses/kvirc-openssl-exception",
    "type" : "expandedlicensing_ListedLicenseException",
    "expandedlicensing_seeAlso" : [ "https://github.com/kvirc/KVIrc/blob/ba18690abb4f5ce77bb10164ee0835cc150f4a2a/doc/ABOUT-LICENSE#L34" ],
    "expandedlicensing_isDeprecatedAdditionId" : false,
    "expandedlicensing_standardAdditionTemplate" : "<<beginOptional>>_OpenSSL Exception_\n\n<<endOptional>>\n   <<var;name=\"bullet\";original=\"0.\";match=\".{0,20}\">>\n   Definitions\n\n   \"KVIrc\" means KVIrc software licensed under version 2 or any later version of the GNU General Public License (collectively, \"GPL\"), or a work based on such software and licensed under the GPL.\n\n   \"OpenSSL\" means OpenSSL toolkit software distributed by the OpenSSL Project and licensed under the OpenSSL Licenses, or a work based on such software and licensed under the OpenSSL Licenses.\n\n   \"OpenSSL Licenses\" means the OpenSSL License and Original SSLeay License under which the OpenSSL Project distributes the OpenSSL toolkit software, as those licenses appear in the file LICENSE-OPENSSL.\n\n   <<var;name=\"bullet\";original=\"1.\";match=\".{0,20}\">>\n   Exception\n\n   You have permission to copy, modify, propagate, and distribute a work formed by combining OpenSSL with KVIrc, or a work derivative of such a combination, even if such copying, modification, propagation, or distribution would otherwise violate the terms of the GPL. You must comply with the GPL in all respects for all of the code used other than OpenSSL.\n\n   You may include this OpenSSL Exception and its grant of permissions when you distribute KVIrc. Inclusion of this notice with such a distribution constitutes a grant of such permission. If you do not wish to grant these permissions, remove this section entitled \"OpenSSL Exception\" from your distribution.\n   \n   ",
    "name" : "kvirc OpenSSL Exception",
    "expandedlicensing_additionText" : "                       _OpenSSL Exception_\n\n0. Definitions\n\n\"KVIrc\" means KVIrc software licensed under version 2 or any later\nversion of the GNU General Public License (collectively, \"GPL\"), or a\nwork based on such software and licensed under the GPL.\n\n\"OpenSSL\" means OpenSSL toolkit software distributed by the OpenSSL\nProject and licensed under the OpenSSL Licenses, or a work based on such\nsoftware and licensed under the OpenSSL Licenses.\n\n\"OpenSSL Licenses\" means the OpenSSL License and Original SSLeay License\nunder which the OpenSSL Project distributes the OpenSSL toolkit software,\nas those licenses appear in the file LICENSE-OPENSSL.\n\n1. Exception\n\nYou have permission to copy, modify, propagate, and distribute a work\nformed by combining OpenSSL with KVIrc, or a work derivative of such a\ncombination, even if such copying, modification, propagation, or\ndistribution would otherwise violate the terms of the GPL. You must\ncomply with the GPL in all respects for all of the code used other than\nOpenSSL.\n\nYou may include this OpenSSL Exception and its grant of permissions when\nyou distribute KVIrc. Inclusion of this notice with such a\ndistribution constitutes a grant of such permission. If you do not wish\nto grant these permissions, remove this section entitled \"OpenSSL\nException\" from your distribution.\n",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "https://spdx.org/licenses/creatoragent/297da51",
    "type" : "Organization",
    "name" : "SPDX Legal Team",
    "creationInfo" : "_:creationInfo_0"
  } ]
}