{
  "@context" : "https://spdx.org/rdf/3.0.1/spdx-context.jsonld",
  "@graph" : [ {
    "@id" : "_:creationInfo_0",
    "type" : "CreationInfo",
    "specVersion" : "3.0.1",
    "createdBy" : [ "https://spdx.org/licenses/creatoragent/f8acf30" ],
    "createdUsing" : [ "https://spdx.org/tools/licenselistpublisher" ],
    "created" : "2025-01-05T00:00:00Z",
    "comment" : "This object is created and maintained by the SPDX legal team (https://spdx.dev/engage/participate/legal-team/) using the LicenseListPublisher (https://github.com/spdx/licenselistpublisher)"
  }, {
    "spdxId" : "http://spdx.org/licenses/LLGPL_document",
    "type" : "SpdxDocument",
    "rootElement" : [ "http://spdx.org/licenses/LLGPL" ],
    "name" : "LLGPL document",
    "comment" : "SPDX Document For LLGPL",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "https://spdx.org/tools/licenselistpublisher",
    "type" : "Tool",
    "name" : "SPDX License List Publisher",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "http://spdx.org/licenses/LLGPL",
    "type" : "expandedlicensing_ListedLicenseException",
    "expandedlicensing_seeAlso" : [ "http://opensource.franz.com/preamble.html" ],
    "expandedlicensing_isDeprecatedAdditionId" : false,
    "expandedlicensing_standardAdditionTemplate" : "<<beginOptional>>Preamble to the Gnu Lesser General Public License<<endOptional>> <<var;name=\"copyright\";original=\"Copyright (c) 2000 Franz Incorporated, Berkeley, CA 94704\";match=\".{0,5000}\">>\n<<beginOptional>>Franz Inc. has adopted the concept of the GNU Lesser General Public License version 2.1 (\"LGPL\") to govern the use and distribution of AllegroServe.<<endOptional>><<beginOptional>> The concept of the GNU Lesser General Public License version 2.1 (\"LGPL\") has been adopted to govern the use and distribution of above-mentioned application<<endOptional>> . However,<<beginOptional>> the<<endOptional>> LGPL uses terminology that is more appropriate for a program written in C than one written in Lisp. Nevertheless,<<beginOptional>> the<<endOptional>> LGPL can still be applied to a Lisp program if certain clarifications are made. This document details those clarifications. Accordingly, the license for <<var;name=\"app\";original=\"the open-source Lisp applications\";match=\"the open-source Lisp applications|AllegroServe\">> consists of this document plus<<beginOptional>> the<<endOptional>> LGPL. Wherever there is a conflict between this document and the LGPL, this document takes precedence over<<beginOptional>> the<<endOptional>> LGPL.\n\nA \"Library\" in Lisp is a collection of Lisp functions, data and foreign modules. The form of the Library can be Lisp source code (for processing by an interpreter) or object code (usually the result of compilation of source code or built with some other mechanisms). Foreign modules are object code in a form that can be linked into a Lisp executable. When we speak of functions we do so in the most general way to include, in addition, methods and unnamed functions. Lisp \"data\" is also a general term that includes the data structures resulting from defining Lisp classes. A Lisp application may include the same set of Lisp objects as does a Library, but this does not mean that the application is necessarily a \"work based on the Library\" it contains.\n\nThe <<var;name=\"library1\";original=\"Library\";match=\"Library|AllegroServe Library\">> consists of everything in the distribution file set before any modifications are made to the files. If any of the functions or classes in the <<var;name=\"library2\";original=\"Library\";match=\"Library|AllegroServe Library\">> are redefined in other files, then those redefinitions ARE considered a work based on the <<var;name=\"library3\";original=\"Library\";match=\"Library|AllegroServe Library\">> . If additional methods are added to generic functions in the <<var;name=\"library4\";original=\"Library\";match=\"Library|AllegroServe Library\">> , those additional methods are NOT considered a work based on the <<var;name=\"library5\";original=\"Library\";match=\"Library|AllegroServe Library\">> . If <<var;name=\"library6\";original=\"Library\";match=\"Library|AllegroServe Library\">> classes are subclassed, these subclasses are NOT considered a work based on the <<var;name=\"library7\";original=\"Library\";match=\"Library|AllegroServe Library\">> . If the Library is modified to explicitly call other functions that are neither part of Lisp itself nor an available add-on module to Lisp, then the functions called by the modified <<var;name=\"library8\";original=\"Library\";match=\"Library|AllegroServe Library\">> ARE considered a work based on the <<var;name=\"library9\";original=\"Library\";match=\"Library|AllegroServe Library\">> . The goal is to ensure that the <<var;name=\"library10\";original=\"Library\";match=\"Library|AllegroServe Library\">> will compile and run without getting undefined function errors.\n\nIt is permitted to add proprietary source code to the <<var;name=\"library11\";original=\"Library\";match=\"Library|AllegroServe Library\">> , but it must be done in a way such that the <<var;name=\"library12\";original=\"Library\";match=\"Library|AllegroServe Library\">> will still run without that proprietary code present. Section 5 of the LGPL distinguishes between the case of a library being dynamically linked at runtime and one being statically linked at build time. Section 5 of the LGPL states that the former results in an executable that is a \"work that uses the Library.\" Section 5 of the LGPL states that the latter results in one that is a \"derivative of the Library\", which is therefore covered by<<beginOptional>> the<<endOptional>> LGPL. Since Lisp only offers one choice, which is to link the Library into an executable at build time, we declare that, for the purpose applying the LGPL to the <<var;name=\"library13\";original=\"Library\";match=\"Library|AllegroServe Library\">> , an executable that results from linking a \"work that uses the <<var;name=\"library14\";original=\"Library\";match=\"Library|AllegroServe Library\">> \" with the Library is considered a \"work that uses the Library\" and is therefore NOT covered by the LGPL.\n\nBecause of this declaration, section 6 of LGPL is not applicable to the <<var;name=\"library15\";original=\"Library\";match=\"Library|AllegroServe Library\">> . However, in connection with each distribution of this executable, you must also deliver, in accordance with the terms and conditions of the LGPL, the source code of <<var;name=\"library16\";original=\"Library\";match=\"Library|AllegroServe Library\">> (or your derivative thereof) that is incorporated into this executable.\n\n",
    "name" : "LLGPL Preamble",
    "expandedlicensing_additionText" : "Preamble to the Gnu Lesser General Public License\n\nCopyright (c) 2016 Franz Inc., Berkeley, CA 94704\n\nThe concept of the GNU Lesser General Public License version 2.1 (\"LGPL\") \nhas been adopted to govern the use and distribution of above-mentioned \napplication. However, the LGPL uses terminology that is more appropriate \nfor a program written in C than one written in Lisp. Nevertheless, the\nLGPL can still be applied to a Lisp program if certain clarifications \nare made. This document details those clarifications. Accordingly, the \nlicense for the open-source Lisp applications consists of this document \nplus the LGPL. Wherever there is a conflict between this document and \nthe LGPL, this document takes precedence over the LGPL.\n\nA \"Library\" in Lisp is a collection of Lisp functions, data and foreign \nmodules. The form of the Library can be Lisp source code (for processing \nby an interpreter) or object code (usually the result of compilation of \nsource code or built with some other mechanisms). Foreign modules are \nobject code in a form that can be linked into a Lisp executable. When \nwe speak of functions we do so in the most general way to include, in \naddition, methods and unnamed functions. Lisp \"data\" is also a general \nterm that includes the data structures resulting from defining Lisp \nclasses. A Lisp application may include the same set of Lisp objects \nas does a Library, but this does not mean that the application is \nnecessarily a \"work based on the Library\" it contains.\n\nThe Library consists of everything in the distribution file set before \nany modifications are made to the files. If any of the functions or \nclasses in the Library are redefined in other files, then those \nredefinitions ARE considered a work based on the Library. If additional \nmethods are added to generic functions in the Library, those additional \nmethods are NOT considered a work based on the Library. If Library classes \nare subclassed, these subclasses are NOT considered a work based on the Library. \nIf the Library is modified to explicitly call other functions that are neither \npart of Lisp itself nor an available add-on module to Lisp, then the functions \ncalled by the modified Library ARE considered a work based on the Library. \nThe goal is to ensure that the Library will compile and run without getting \nundefined function errors.\n\nIt is permitted to add proprietary source code to the Library, but it must \nbe done in a way such that the Library will still run without that proprietary \ncode present. Section 5 of the LGPL distinguishes between the case of a \nlibrary being dynamically linked at runtime and one being statically linked \nat build time. Section 5 of the LGPL states that the former results in an \nexecutable that is a \"work that uses the Library.\" Section 5 of the LGPL \nstates that the latter results in one that is a \"derivative of the Library\", \nwhich is therefore covered by the LGPL. Since Lisp only offers one choice, \nwhich is to link the Library into an executable at build time, we declare that, \nfor the purpose applying the LGPL to the Library, an executable that results \nfrom linking a \"work that uses the Library\" with the Library is considered a \n\"work that uses the Library\" and is therefore NOT covered by the LGPL.\n\nBecause of this declaration, section 6 of LGPL is not applicable to the Library. \nHowever, in connection with each distribution of this executable, you must also \ndeliver, in accordance with the terms and conditions of the LGPL, the source code \nof Library (or your derivative thereof) that is incorporated into this executable.\n",
    "comment" : "Typically used with LGPL-2.1",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "https://spdx.org/licenses/creatoragent/f8acf30",
    "type" : "Organization",
    "name" : "SPDX Legal Team",
    "creationInfo" : "_:creationInfo_0"
  } ]
}