{
  "@context" : "https://spdx.org/rdf/3.0.1/spdx-context.jsonld",
  "@graph" : [ {
    "@id" : "_:creationInfo_0",
    "type" : "CreationInfo",
    "specVersion" : "3.0.1",
    "createdBy" : [ "https://spdx.org/licenses/creatoragent/f8acf30" ],
    "createdUsing" : [ "https://spdx.org/tools/licenselistpublisher" ],
    "created" : "2025-01-05T00:00:00Z",
    "comment" : "This object is created and maintained by the SPDX legal team (https://spdx.dev/engage/participate/legal-team/) using the LicenseListPublisher (https://github.com/spdx/licenselistpublisher)"
  }, {
    "spdxId" : "http://spdx.org/licenses/MPEG-SSG_document",
    "type" : "SpdxDocument",
    "rootElement" : [ "http://spdx.org/licenses/MPEG-SSG" ],
    "name" : "MPEG-SSG document",
    "comment" : "SPDX Document For MPEG-SSG",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "https://spdx.org/tools/licenselistpublisher",
    "type" : "Tool",
    "name" : "SPDX License List Publisher",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "https://spdx.org/licenses/creatoragent/f8acf30",
    "type" : "Organization",
    "name" : "SPDX Legal Team",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "http://spdx.org/licenses/MPEG-SSG",
    "type" : "expandedlicensing_ListedLicense",
    "expandedlicensing_isOsiApproved" : false,
    "expandedlicensing_seeAlso" : [ "https://sourceforge.net/p/netpbm/code/HEAD/tree/super_stable/converter/ppm/ppmtompeg/jrevdct.c#l1189" ],
    "simplelicensing_licenseText" : "Copyright (C) 1994, MPEG Software Simulation Group. All Rights Reserved. */\n\nDisclaimer of Warranty\n    \nThese software programs are available to the user without any license fee or\nroyalty on an \"as is\" basis. The MPEG Software Simulation Group disclaims\nany and all warranties, whether express, implied, or statuary, including any\nimplied warranties or merchantability or of fitness for a particular\npurpose. In no event shall the copyright-holder be liable for any\nincidental, punitive, or consequential damages of any kind whatsoever\narising from the use of these programs.\n    \nThis disclaimer of warranty extends to the user of these programs and user's\ncustomers, employees, agents, transferees, successors, and assigns.\n    \nThe MPEG Software Simulation Group does not represent or warrant that the\nprograms furnished hereunder are free of infringement of any third-party\npatents.\n    \nCommercial implementations of MPEG-1 and MPEG-2 video, including shareware,\nare subject to royalty fees to patent holders. Many of these patents are\ngeneral enough such that they are unavoidable regardless of implementation\ndesign.\n\n\n",
    "name" : "MPEG Software Simulation",
    "expandedlicensing_standardLicenseTemplate" : "<<var;name=\"copyright\";original=\"Copyright (C) 1994, MPEG Software Simulation Group. All Rights Reserved.  \";match=\".{0,5000}\">>\nDisclaimer of Warranty\n\nThese software programs are available to the user without any license fee or royalty on an \"as is\" basis. The MPEG Software Simulation Group disclaims any and all warranties, whether express, implied, or statuary, including any implied warranties or merchantability or of fitness for a particular purpose. In no event shall the copyright-holder be liable for any incidental, punitive, or consequential damages of any kind whatsoever arising from the use of these programs.\n\nThis disclaimer of warranty extends to the user of these programs and user's customers, employees, agents, transferees, successors, and assigns.\n\nThe MPEG Software Simulation Group does not represent or warrant that the programs furnished hereunder are free of infringement of any third-party patents.\n\nCommercial implementations of MPEG-1 and MPEG-2 video, including shareware, are subject to royalty fees to patent holders. Many of these patents are * general enough such that they are unavoidable regardless of implementation design.\n\n",
    "creationInfo" : "_:creationInfo_0",
    "expandedlicensing_isDeprecatedLicenseId" : false
  } ]
}