{
  "@context" : "https://spdx.org/rdf/3.0.1/spdx-context.jsonld",
  "@graph" : [ {
    "@id" : "_:creationInfo_0",
    "type" : "CreationInfo",
    "specVersion" : "3.0.1",
    "createdBy" : [ "https://spdx.org/licenses/creatoragent/f8acf30" ],
    "createdUsing" : [ "https://spdx.org/tools/licenselistpublisher" ],
    "created" : "2025-01-05T00:00:00Z",
    "comment" : "This object is created and maintained by the SPDX legal team (https://spdx.dev/engage/participate/legal-team/) using the LicenseListPublisher (https://github.com/spdx/licenselistpublisher)"
  }, {
    "spdxId" : "http://spdx.org/licenses/NICTA-1.0_document",
    "type" : "SpdxDocument",
    "rootElement" : [ "http://spdx.org/licenses/NICTA-1.0" ],
    "name" : "NICTA-1.0 document",
    "comment" : "SPDX Document For NICTA-1.0",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "https://spdx.org/tools/licenselistpublisher",
    "type" : "Tool",
    "name" : "SPDX License List Publisher",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "https://spdx.org/licenses/creatoragent/f8acf30",
    "type" : "Organization",
    "name" : "SPDX Legal Team",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "http://spdx.org/licenses/NICTA-1.0",
    "type" : "expandedlicensing_ListedLicense",
    "expandedlicensing_isOsiApproved" : false,
    "expandedlicensing_seeAlso" : [ "https://opensource.apple.com/source/mDNSResponder/mDNSResponder-320.10/mDNSPosix/nss_ReadMe.txt" ],
    "simplelicensing_licenseText" : "NICTA Public Software Licence\nVersion 1.0\n\nCopyright © 2004 National ICT Australia Ltd\n\nAll rights reserved.\n\nBy this licence, National ICT Australia Ltd (NICTA) grants permission,\nfree of charge, to any person who obtains a copy of this software\nand any associated documentation files (\"the Software\") to use and\ndeal with the Software in source code and binary forms without\nrestriction, with or without modification, and to permit persons\nto whom the Software is furnished to do so, provided that the\nfollowing conditions are met:\n\n- Redistributions of source code must retain the above copyright\n  notice, this list of conditions and the following disclaimers.\n- Redistributions in binary form must reproduce the above copyright\n  notice, this list of conditions and the following disclaimers in\n  the documentation and/or other materials provided with the\n  distribution.\n- The name of NICTA may not be used to endorse or promote products\n  derived from this Software without specific prior written permission.\n\nEXCEPT AS EXPRESSLY STATED IN THIS LICENCE AND TO THE FULL EXTENT\nPERMITTED BY APPLICABLE LAW, THE SOFTWARE IS PROVIDED \"AS-IS\" AND\nNICTA MAKES NO REPRESENTATIONS, WARRANTIES OR CONDITIONS OF ANY\nKIND, EXPRESS OR IMPLIED, INCLUDING, WITHOUT LIMITATION, ANY\nREPRESENTATIONS, WARRANTIES OR CONDITIONS REGARDING THE CONTENTS\nOR ACCURACY OF THE SOFTWARE, OR OF TITLE, MERCHANTABILITY, FITNESS\nFOR A PARTICULAR PURPOSE, NONINFRINGEMENT, THE ABSENCE OF LATENT\nOR OTHER DEFECTS, OR THE PRESENCE OR ABSENCE OF ERRORS, WHETHER OR\nNOT DISCOVERABLE.\n\nTO THE FULL EXTENT PERMITTED BY APPLICABLE LAW, IN NO EVENT WILL\nNICTA BE LIABLE ON ANY LEGAL THEORY (INCLUDING, WITHOUT LIMITATION,\nNEGLIGENCE) FOR ANY LOSS OR DAMAGE WHATSOEVER, INCLUDING (WITHOUT\nLIMITATION) LOSS OF PRODUCTION OR OPERATION TIME, LOSS, DAMAGE OR\nCORRUPTION OF DATA OR RECORDS; OR LOSS OF ANTICIPATED SAVINGS,\nOPPORTUNITY, REVENUE, PROFIT OR GOODWILL, OR OTHER ECONOMIC LOSS;\nOR ANY SPECIAL, INCIDENTAL, INDIRECT, CONSEQUENTIAL, PUNITIVE OR\nEXEMPLARY DAMAGES ARISING OUT OF OR IN CONNECTION WITH THIS LICENCE,\nTHE SOFTWARE OR THE USE OF THE SOFTWARE, EVEN IF NICTA HAS BEEN\nADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n\nIf applicable legislation implies warranties or conditions, or\nimposes obligations or liability on NICTA in respect of the Software\nthat cannot be wholly or partly excluded, restricted or modified,\nNICTA's liability is limited, to the full extent permitted by the\napplicable legislation, at its option, to:\n\na. in the case of goods, any one or more of the following:\n  i.   the replacement of the goods or the supply of equivalent goods;\n  ii.  the repair of the goods;\n  iii. the payment of the cost of replacing the goods or of acquiring\n       equivalent goods;\n  iv.  the payment of the cost of having the goods repaired; or\nb. in the case of services:\n  i.   the supplying of the services again; or \n  ii.  the payment of the cost of having the services supplied\n       again.\n",
    "name" : "NICTA Public Software License, Version 1.0",
    "expandedlicensing_standardLicenseTemplate" : "<<beginOptional>>NICTA Public Software Licence\n\nVersion 1.0\n\n<<endOptional>> <<var;name=\"copyright\";original=\"Copyright © 2004 National ICT Australia Ltd   All rights reserved.  \";match=\".{0,5000}\">>\nBy this licence, National ICT Australia Ltd (NICTA) grants permission, free of charge, to any person who obtains a copy of this software and any associated documentation files (\"the Software\") to use and deal with the Software in source code and binary forms without restriction, with or without modification, and to permit persons to whom the Software is furnished to do so, provided that the following conditions are met:\n\n   <<var;name=\"bullet\";original=\"-\";match=\".{0,20}\">> Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimers.\n   <<var;name=\"bullet\";original=\"-\";match=\".{0,20}\">> Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimers in the documentation and/or other materials provided with the distribution.\n   <<var;name=\"bullet\";original=\"-\";match=\".{0,20}\">> The name of NICTA may not be used to endorse or promote products derived from this Software without specific prior written permission.\nEXCEPT AS EXPRESSLY STATED IN THIS LICENCE AND TO THE FULL EXTENT PERMITTED BY APPLICABLE LAW, THE SOFTWARE IS PROVIDED \"AS-IS\" AND NICTA MAKES NO REPRESENTATIONS, WARRANTIES OR CONDITIONS OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING, WITHOUT LIMITATION, ANY REPRESENTATIONS, WARRANTIES OR CONDITIONS REGARDING THE CONTENTS OR ACCURACY OF THE SOFTWARE, OR OF TITLE, MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, NONINFRINGEMENT, THE ABSENCE OF LATENT OR OTHER DEFECTS, OR THE PRESENCE OR ABSENCE OF ERRORS, WHETHER OR NOT DISCOVERABLE.\n\nTO THE FULL EXTENT PERMITTED BY APPLICABLE LAW, IN NO EVENT WILL NICTA BE LIABLE ON ANY LEGAL THEORY (INCLUDING, WITHOUT LIMITATION, NEGLIGENCE) FOR ANY LOSS OR DAMAGE WHATSOEVER, INCLUDING (WITHOUT LIMITATION) LOSS OF PRODUCTION OR OPERATION TIME, LOSS, DAMAGE OR CORRUPTION OF DATA OR RECORDS; OR LOSS OF ANTICIPATED SAVINGS, OPPORTUNITY, REVENUE, PROFIT OR GOODWILL, OR OTHER ECONOMIC LOSS; OR ANY SPECIAL, INCIDENTAL, INDIRECT, CONSEQUENTIAL, PUNITIVE OR EXEMPLARY DAMAGES ARISING OUT OF OR IN CONNECTION WITH THIS LICENCE, THE SOFTWARE OR THE USE OF THE SOFTWARE, EVEN IF NICTA HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n\nIf applicable legislation implies warranties or conditions, or imposes obligations or liability on NICTA in respect of the Software that cannot be wholly or partly excluded, restricted or modified, NICTA's liability is limited, to the full extent permitted by the applicable legislation, at its option, to:\n\n   <<var;name=\"bullet\";original=\"a.\";match=\".{0,20}\">> in the case of goods, any one or more of the following:\n      <<var;name=\"bullet\";original=\"i.\";match=\".{0,20}\">> the replacement of the goods or the supply of equivalent goods;\n      <<var;name=\"bullet\";original=\"ii.\";match=\".{0,20}\">> the repair of the goods;\n      <<var;name=\"bullet\";original=\"iii.\";match=\".{0,20}\">> the payment of the cost of replacing the goods or of acquiring equivalent goods;\n      <<var;name=\"bullet\";original=\"iv.\";match=\".{0,20}\">> the payment of the cost of having the goods repaired; or\n   <<var;name=\"bullet\";original=\"b.\";match=\".{0,20}\">> in the case of services:\n      <<var;name=\"bullet\";original=\"i.\";match=\".{0,20}\">> the supplying of the services again; or\n      <<var;name=\"bullet\";original=\"ii.\";match=\".{0,20}\">> the payment of the cost of having the services supplied again.",
    "creationInfo" : "_:creationInfo_0",
    "expandedlicensing_isDeprecatedLicenseId" : false
  } ]
}