{
  "@context" : "https://spdx.org/rdf/3.0.1/spdx-context.jsonld",
  "@graph" : [ {
    "@id" : "_:creationInfo_0",
    "type" : "CreationInfo",
    "specVersion" : "3.0.1",
    "createdBy" : [ "https://spdx.org/licenses/creatoragent/f8acf30" ],
    "createdUsing" : [ "https://spdx.org/tools/licenselistpublisher" ],
    "created" : "2025-01-05T00:00:00Z",
    "comment" : "This object is created and maintained by the SPDX legal team (https://spdx.dev/engage/participate/legal-team/) using the LicenseListPublisher (https://github.com/spdx/licenselistpublisher)"
  }, {
    "spdxId" : "http://spdx.org/licenses/OpenVision_document",
    "type" : "SpdxDocument",
    "rootElement" : [ "http://spdx.org/licenses/OpenVision" ],
    "name" : "OpenVision document",
    "comment" : "SPDX Document For OpenVision",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "https://spdx.org/tools/licenselistpublisher",
    "type" : "Tool",
    "name" : "SPDX License List Publisher",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "https://spdx.org/licenses/creatoragent/f8acf30",
    "type" : "Organization",
    "name" : "SPDX Legal Team",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "http://spdx.org/licenses/OpenVision",
    "type" : "expandedlicensing_ListedLicense",
    "expandedlicensing_isOsiApproved" : false,
    "expandedlicensing_seeAlso" : [ "https://github.com/krb5/krb5/blob/krb5-1.21.2-final/NOTICE#L66-L98", "https://web.mit.edu/kerberos/krb5-1.21/doc/mitK5license.html", "https://fedoraproject.org/wiki/Licensing:MIT#OpenVision_Variant" ],
    "simplelicensing_licenseText" : "Copyright, OpenVision Technologies, Inc., 1993-1996, All Rights\nReserved\n\nWARNING:  Retrieving the OpenVision Kerberos Administration system\nsource code, as described below, indicates your acceptance of the\nfollowing terms.  If you do not agree to the following terms, do\nnot retrieve the OpenVision Kerberos administration system.\n\nYou may freely use and distribute the Source Code and Object Code\ncompiled from it, with or without modification, but this Source\nCode is provided to you \"AS IS\" EXCLUSIVE OF ANY WARRANTY,\nINCLUDING, WITHOUT LIMITATION, ANY WARRANTIES OF MERCHANTABILITY OR\nFITNESS FOR A PARTICULAR PURPOSE, OR ANY OTHER WARRANTY, WHETHER\nEXPRESS OR IMPLIED. IN NO EVENT WILL OPENVISION HAVE ANY LIABILITY\nFOR ANY LOST PROFITS, LOSS OF DATA OR COSTS OF PROCUREMENT OF\nSUBSTITUTE GOODS OR SERVICES, OR FOR ANY SPECIAL, INDIRECT, OR\nCONSEQUENTIAL DAMAGES ARISING OUT OF THIS AGREEMENT, INCLUDING,\nWITHOUT LIMITATION, THOSE RESULTING FROM THE USE OF THE SOURCE\nCODE, OR THE FAILURE OF THE SOURCE CODE TO PERFORM, OR FOR ANY\nOTHER REASON.\n\nOpenVision retains all copyrights in the donated Source Code.\nOpenVision also retains copyright to derivative works of the Source\nCode, whether created by OpenVision or by a third party. The\nOpenVision copyright notice must be preserved if derivative works\nare made based on the donated Source Code.\n\nOpenVision Technologies, Inc. has donated this Kerberos\nAdministration system to MIT for inclusion in the standard Kerberos\n5 distribution. This donation underscores our commitment to\ncontinuing Kerberos technology development and our gratitude for\nthe valuable work which has been performed by MIT and the Kerberos\ncommunity.\n",
    "name" : "OpenVision License",
    "expandedlicensing_standardLicenseTemplate" : "<<var;name=\"copyright\";original=\"Copyright, OpenVision Technologies, Inc., 1993-1996, All Rights Reserved\";match=\".{0,5000}\">>\nWARNING: Retrieving the OpenVision Kerberos Administration system source code, as described below, indicates your acceptance of the following terms. If you do not agree to the following terms, do not retrieve the OpenVision Kerberos administration system.\n\nYou may freely use and distribute the Source Code and Object Code compiled from it, with or without modification, but this Source Code is provided to you \"AS IS\" EXCLUSIVE OF ANY WARRANTY, INCLUDING, WITHOUT LIMITATION, ANY WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE, OR ANY OTHER WARRANTY, WHETHER EXPRESS OR IMPLIED. IN NO EVENT WILL OPENVISION HAVE ANY LIABILITY FOR ANY LOST PROFITS, LOSS OF DATA OR COSTS OF PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES, OR FOR ANY SPECIAL, INDIRECT, OR CONSEQUENTIAL DAMAGES ARISING OUT OF THIS AGREEMENT, INCLUDING, WITHOUT LIMITATION, THOSE RESULTING FROM THE USE OF THE SOURCE CODE, OR THE FAILURE OF THE SOURCE CODE TO PERFORM, OR FOR ANY OTHER REASON.\n\nOpenVision retains all copyrights in the donated Source Code. OpenVision also retains copyright to derivative works of the Source Code, whether created by OpenVision or by a third party. The OpenVision copyright notice must be preserved if derivative works are made based on the donated Source Code.\n\nOpenVision Technologies, Inc. has donated this Kerberos Administration system to MIT for inclusion in the standard Kerberos 5 distribution. This donation underscores our commitment to continuing Kerberos technology development and our gratitude for the valuable work which has been performed by MIT and the Kerberos community.\n\n",
    "creationInfo" : "_:creationInfo_0",
    "expandedlicensing_isDeprecatedLicenseId" : false
  } ]
}