{
  "@context" : "https://spdx.org/rdf/3.0.1/spdx-context.jsonld",
  "@graph" : [ {
    "@id" : "_:creationInfo_0",
    "type" : "CreationInfo",
    "specVersion" : "3.0.1",
    "createdBy" : [ "https://spdx.org/licenses/creatoragent/f8acf30" ],
    "createdUsing" : [ "https://spdx.org/tools/licenselistpublisher" ],
    "created" : "2025-01-05T00:00:00Z",
    "comment" : "This object is created and maintained by the SPDX legal team (https://spdx.dev/engage/participate/legal-team/) using the LicenseListPublisher (https://github.com/spdx/licenselistpublisher)"
  }, {
    "spdxId" : "http://spdx.org/licenses/OpenPBS-2.3_document",
    "type" : "SpdxDocument",
    "rootElement" : [ "http://spdx.org/licenses/OpenPBS-2.3" ],
    "name" : "OpenPBS-2.3 document",
    "comment" : "SPDX Document For OpenPBS-2.3",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "https://spdx.org/tools/licenselistpublisher",
    "type" : "Tool",
    "name" : "SPDX License List Publisher",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "https://spdx.org/licenses/creatoragent/f8acf30",
    "type" : "Organization",
    "name" : "SPDX Legal Team",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "http://spdx.org/licenses/OpenPBS-2.3",
    "type" : "expandedlicensing_ListedLicense",
    "expandedlicensing_isOsiApproved" : false,
    "expandedlicensing_seeAlso" : [ "https://github.com/adaptivecomputing/torque/blob/master/PBS_License.txt", "https://www.mcs.anl.gov/research/projects/openpbs/PBS_License.txt" ],
    "simplelicensing_licenseText" : "\n        OpenPBS (Portable Batch System) v2.3 Software License\n\nCopyright (c) 1999-2000 Veridian Information Solutions, Inc.\nAll rights reserved.\n\n---------------------------------------------------------------------------\nFor a license to use or redistribute the OpenPBS software under conditions\nother than those described below, or to purchase support for this software,\nplease contact Veridian Systems, PBS Products Department (\"Licensor\") at:\n\n   www.OpenPBS.org  +1 650 967-4675                  sales@OpenPBS.org\n                       877 902-4PBS (US toll-free)\n---------------------------------------------------------------------------\n\nThis license covers use of the OpenPBS v2.3 software (the \"Software\") at\nyour site or location, and, for certain users, redistribution of the\nSoftware to other sites and locations.  Use and redistribution of\nOpenPBS v2.3 in source and binary forms, with or without modification,\nare permitted provided that all of the following conditions are met.\nAfter December 31, 2001, only conditions 3-6 must be met:\n\n1. Commercial and/or non-commercial use of the Software is permitted\n   provided a current software registration is on file at www.OpenPBS.org.\n   If use of this software contributes to a publication, product, or\n   service, proper attribution must be given; see www.OpenPBS.org/credit.html\n\n2. Redistribution in any form is only permitted for non-commercial,\n   non-profit purposes.  There can be no charge for the Software or any\n   software incorporating the Software.  Further, there can be no\n   expectation of revenue generated as a consequence of redistributing\n   the Software.\n\n3. Any Redistribution of source code must retain the above copyright notice\n   and the acknowledgment contained in paragraph 6, this list of conditions\n   and the disclaimer contained in paragraph 7.\n\n4. Any Redistribution in binary form must reproduce the above copyright\n   notice and the acknowledgment contained in paragraph 6, this list of\n   conditions and the disclaimer contained in paragraph 7 in the\n   documentation and/or other materials provided with the distribution.\n\n5. Redistributions in any form must be accompanied by information on how to\n   obtain complete source code for the OpenPBS software and any\n   modifications and/or additions to the OpenPBS software.  The source code\n   must either be included in the distribution or be available for no more\n   than the cost of distribution plus a nominal fee, and all modifications\n   and additions to the Software must be freely redistributable by any party\n   (including Licensor) without restriction.\n\n6. All advertising materials mentioning features or use of the Software must\n   display the following acknowledgment:\n\n    \"This product includes software developed by NASA Ames Research Center,\n    Lawrence Livermore National Laboratory, and Veridian Information Solutions,\n    Inc.  Visit www.OpenPBS.org for OpenPBS software support,\n    products, and information.\"\n\n7. DISCLAIMER OF WARRANTY\n\nTHIS SOFTWARE IS PROVIDED \"AS IS\" WITHOUT WARRANTY OF ANY KIND. ANY EXPRESS\nOR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES\nOF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, AND NON-INFRINGEMENT\nARE EXPRESSLY DISCLAIMED.\n\nIN NO EVENT SHALL VERIDIAN CORPORATION, ITS AFFILIATED COMPANIES, OR THE\nU.S. GOVERNMENT OR ANY OF ITS AGENCIES BE LIABLE FOR ANY DIRECT OR INDIRECT,\nINCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT\nLIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,\nOR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF\nLIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING\nNEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,\nEVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\nThis license will be governed by the laws of the Commonwealth of Virginia,\nwithout reference to its choice of law rules.\n\n",
    "name" : "OpenPBS v2.3 Software License",
    "expandedlicensing_standardLicenseTemplate" : "<<beginOptional>>OpenPBS (Portable Batch System) v2.3 Software License<<endOptional>> <<var;name=\"copyright\";original=\"Copyright (c) 1999-2000 Veridian Information Solutions, Inc. All rights reserved.  \";match=\".{0,5000}\">><<beginOptional>> ---------------------------------------------------------------------------\nFor a license to use or redistribute the OpenPBS software under conditions other than those described below, or to purchase support for this software, please contact Veridian Systems, PBS Products Department (\"Licensor\") at:\n\nwww.OpenPBS.org +1 650 967-4675 sales@OpenPBS.org 877 902-4PBS (US toll-free)\n\n---------------------------------------------------------------------------<<endOptional>>\nThis license covers use of the OpenPBS v2.3 software (the \"Software\") at your site or location, and, for certain users, redistribution of the Software to other sites and locations. Use and redistribution of OpenPBS v2.3 in source and binary forms, with or without modification, are permitted provided that all of the following conditions are met. After December 31, 2001, only conditions 3-6 must be met:\n\n   <<var;name=\"bullet\";original=\"1.\";match=\".{0,20}\">> Commercial and/or non-commercial use of the Software is permitted provided a current software registration is on file at www.OpenPBS.org. If use of this software contributes to a publication, product, or service, proper attribution must be given; see www.OpenPBS.org/credit.html\n\n   <<var;name=\"bullet\";original=\"2.\";match=\".{0,20}\">> Redistribution in any form is only permitted for non-commercial, non-profit purposes. There can be no charge for the Software or any software incorporating the Software. Further, there can be no expectation of revenue generated as a consequence of redistributing the Software.\n\n   <<var;name=\"bullet\";original=\"3.\";match=\".{0,20}\">> Any Redistribution of source code must retain the above copyright notice and the acknowledgment contained in paragraph 6, this list of conditions and the disclaimer contained in paragraph 7.\n\n   <<var;name=\"bullet\";original=\"4.\";match=\".{0,20}\">>\n   Any Redistribution in binary form must reproduce the above copyright notice and the acknowledgment contained in paragraph 6, this list of conditions and the disclaimer contained in paragraph 7 in the documentation and/or other materials provided with the distribution.\n\n   <<var;name=\"bullet\";original=\"5.\";match=\".{0,20}\">>\n   Redistributions in any form must be accompanied by information on how to obtain complete source code for the OpenPBS software and any modifications and/or additions to the OpenPBS software. The source code must either be included in the distribution or be available for no more than the cost of distribution plus a nominal fee, and all modifications and additions to the Software must be freely redistributable by any party (including Licensor) without restriction.\n\n   <<var;name=\"bullet\";original=\"6.\";match=\".{0,20}\">> All advertising materials mentioning features or use of the Software must display the following acknowledgment:\n\n   \"This product includes software developed by NASA Ames Research Center, Lawrence Livermore National Laboratory, and Veridian Information Solutions, Inc. Visit www.OpenPBS.org for OpenPBS software support, products, and information.\"\n\n   <<var;name=\"bullet\";original=\"7.\";match=\".{0,20}\">> DISCLAIMER OF WARRANTY\n\n   THIS SOFTWARE IS PROVIDED \"AS IS\" WITHOUT WARRANTY OF ANY KIND. ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, AND NON-INFRINGEMENT ARE EXPRESSLY DISCLAIMED.\n\nIN NO EVENT SHALL VERIDIAN CORPORATION, ITS AFFILIATED COMPANIES, OR THE U.S. GOVERNMENT OR ANY OF ITS AGENCIES BE LIABLE FOR ANY DIRECT OR INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\nThis license will be governed by the laws of the Commonwealth of Virginia, without reference to its choice of law rules.\n\n",
    "creationInfo" : "_:creationInfo_0",
    "expandedlicensing_isDeprecatedLicenseId" : false
  } ]
}