{
  "@context" : "https://spdx.org/rdf/3.0.1/spdx-context.jsonld",
  "@graph" : [ {
    "@id" : "_:creationInfo_0",
    "type" : "CreationInfo",
    "specVersion" : "3.0.1",
    "createdBy" : [ "https://spdx.org/licenses/creatoragent/f8acf30" ],
    "createdUsing" : [ "https://spdx.org/tools/licenselistpublisher" ],
    "created" : "2025-01-05T00:00:00Z",
    "comment" : "This object is created and maintained by the SPDX legal team (https://spdx.dev/engage/participate/legal-team/) using the LicenseListPublisher (https://github.com/spdx/licenselistpublisher)"
  }, {
    "spdxId" : "http://spdx.org/licenses/QPL-1.0-INRIA-2004_document",
    "type" : "SpdxDocument",
    "rootElement" : [ "http://spdx.org/licenses/QPL-1.0-INRIA-2004" ],
    "name" : "QPL-1.0-INRIA-2004 document",
    "comment" : "SPDX Document For QPL-1.0-INRIA-2004",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "https://spdx.org/tools/licenselistpublisher",
    "type" : "Tool",
    "name" : "SPDX License List Publisher",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "https://spdx.org/licenses/creatoragent/f8acf30",
    "type" : "Organization",
    "name" : "SPDX Legal Team",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "http://spdx.org/licenses/QPL-1.0-INRIA-2004",
    "type" : "expandedlicensing_ListedLicense",
    "expandedlicensing_isOsiApproved" : false,
    "expandedlicensing_seeAlso" : [ "https://github.com/maranget/hevea/blob/master/LICENSE" ],
    "simplelicensing_licenseText" : "                   THE Q PUBLIC LICENSE version 1.0\n\n              Copyright (C) 1999 Troll Tech AS, Norway.\n                  Everyone is permitted to copy and\n                  distribute this license document.\n\nThe intent of this license is to establish freedom to share and change\nthe software regulated by this license under the open source model.\n\nThis license applies to any software containing a notice placed by the\ncopyright holder saying that it may be distributed under the terms of\nthe Q Public License version 1.0. Such software is herein referred to\nas the Software. This license covers modification and distribution of\nthe Software, use of third-party application programs based on the\nSoftware, and development of free software which uses the Software.\n\n                            Granted Rights\n\n1. You are granted the non-exclusive rights set forth in this license\nprovided you agree to and comply with any and all conditions in this\nlicense. Whole or partial distribution of the Software, or software\nitems that link with the Software, in any form signifies acceptance of\nthis license.\n\n2. You may copy and distribute the Software in unmodified form\nprovided that the entire package, including - but not restricted to -\ncopyright, trademark notices and disclaimers, as released by the\ninitial developer of the Software, is distributed.\n\n3. You may make modifications to the Software and distribute your\nmodifications, in a form that is separate from the Software, such as\npatches. The following restrictions apply to modifications:\n\n      a. Modifications must not alter or remove any copyright notices\n      in the Software.\n\n      b. When modifications to the Software are released under this\n      license, a non-exclusive royalty-free right is granted to the\n      initial developer of the Software to distribute your\n      modification in future versions of the Software provided such\n      versions remain available under these terms in addition to any\n      other license(s) of the initial developer.\n\n4. You may distribute machine-executable forms of the Software or\nmachine-executable forms of modified versions of the Software,\nprovided that you meet these restrictions:\n\n      a. You must include this license document in the distribution.\n\n      b. You must ensure that all recipients of the machine-executable\n      forms are also able to receive the complete machine-readable\n      source code to the distributed Software, including all\n      modifications, without any charge beyond the costs of data\n      transfer, and place prominent notices in the distribution\n      explaining this.\n\n      c. You must ensure that all modifications included in the\n      machine-executable forms are available under the terms of this\n      license.\n\n5. You may use the original or modified versions of the Software to\ncompile, link and run application programs legally developed by you or\nby others.\n\n6. You may develop application programs, reusable components and other\nsoftware items that link with the original or modified versions of the\nSoftware. These items, when distributed, are subject to the following\nrequirements:\n\n      a. You must ensure that all recipients of machine-executable\n      forms of these items are also able to receive and use the\n      complete machine-readable source code to the items without any\n      charge beyond the costs of data transfer.\n\n      b. You must explicitly license all recipients of your items to\n      use and re-distribute original and modified versions of the\n      items in both machine-executable and source code forms. The\n      recipients must be able to do so without any charges whatsoever,\n      and they must be able to re-distribute to anyone they choose.\n\n      c. If the items are not available to the general public, and the\n      initial developer of the Software requests a copy of the items,\n      then you must supply one.\n\n                       Limitations of Liability\n\nIn no event shall the initial developers or copyright holders be\nliable for any damages whatsoever, including - but not restricted to -\nlost revenue or profits or other direct, indirect, special, incidental\nor consequential damages, even if they have been advised of the\npossibility of such damages, except to the extent invariable law, if\nany, provides otherwise.\n\n                             No Warranty\n\nThe Software and this license document are provided AS IS with NO\nWARRANTY OF ANY KIND, INCLUDING THE WARRANTY OF DESIGN,\nMERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.\n\n                            Choice of Law\n\nThis license is governed by the Laws of France.\n",
    "name" : "Q Public License 1.0 - INRIA 2004 variant",
    "comment" : "This license is a variant of QPL-1.0 with the choice of law changed to France. This variant appears to be generally used together with QPL-1.0-INRIA-2004-exception.",
    "expandedlicensing_standardLicenseTemplate" : "<<beginOptional>>THE Q PUBLIC LICENSE version 1.0\n\n<<endOptional>> <<var;name=\"copyright\";original=\"Copyright (C) 1999 Troll Tech AS, Norway.  \";match=\".{0,5000}\">>\nEveryone is permitted to copy and distribute this license document.\n\nThe intent of this license is to establish freedom to share and change the software regulated by this license under the open source model.\n\nThis license applies to any software containing a notice placed by the copyright holder saying that it may be distributed under the terms of the Q Public License version 1.0. Such software is herein referred to as the Software. This license covers modification and distribution of the Software, use of third-party application programs based on the Software, and development of free software which uses the Software.\n\nGranted Rights\n\n   <<var;name=\"bullet\";original=\"1.\";match=\".{0,20}\">> You are granted the non-exclusive rights set forth in this license provided you agree to and comply with any and all conditions in this license. Whole or partial distribution of the Software, or software items that link with the Software, in any form signifies acceptance of this license.\n   <<var;name=\"bullet\";original=\"2.\";match=\".{0,20}\">> You may copy and distribute the Software in unmodified form provided that the entire package, including - but not restricted to - copyright, trademark notices and disclaimers, as released by the initial developer of the Software, is distributed.\n   <<var;name=\"bullet\";original=\"3.\";match=\".{0,20}\">> You may make modifications to the Software and distribute your modifications, in a form that is separate from the Software, such as patches. The following restrictions apply to modifications:\n      <<var;name=\"bullet\";original=\"a.\";match=\".{0,20}\">> Modifications must not alter or remove any copyright notices in the Software.\n      <<var;name=\"bullet\";original=\"b.\";match=\".{0,20}\">> When modifications to the Software are released under this license, a non-exclusive royalty-free right is granted to the initial developer of the Software to distribute your modification in future versions of the Software provided such versions remain available under these terms in addition to any other license(s) of the initial developer.\n   <<var;name=\"bullet\";original=\"4.\";match=\".{0,20}\">> You may distribute machine-executable forms of the Software or machine-executable forms of modified versions of the Software, provided that you meet these restrictions:\n      <<var;name=\"bullet\";original=\"a.\";match=\".{0,20}\">> You must include this license document in the distribution.\n      <<var;name=\"bullet\";original=\"b.\";match=\".{0,20}\">> You must ensure that all recipients of the machine-executable forms are also able to receive the complete machine-readable source code to the distributed Software, including all modifications, without any charge beyond the costs of data transfer, and place prominent notices in the distribution explaining this.\n      <<var;name=\"bullet\";original=\"c.\";match=\".{0,20}\">> You must ensure that all modifications included in the machine-executable forms are available under the terms of this license.\n   <<var;name=\"bullet\";original=\"5.\";match=\".{0,20}\">> You may use the original or modified versions of the Software to compile, link and run application programs legally developed by you or by others.\n   <<var;name=\"bullet\";original=\"6.\";match=\".{0,20}\">> You may develop application programs, reusable components and other software items that link with the original or modified versions of the Software. These items, when distributed, are subject to the following requirements:\n      <<var;name=\"bullet\";original=\"a.\";match=\".{0,20}\">> You must ensure that all recipients of machine-executable forms of these items are also able to receive and use the complete machine-readable source code to the items without any charge beyond the costs of data transfer.\n      <<var;name=\"bullet\";original=\"b.\";match=\".{0,20}\">> You must explicitly license all recipients of your items to use and re-distribute original and modified versions of the items in both machine-executable and source code forms. The recipients must be able to do so without any charges whatsoever, and they must be able to re-distribute to anyone they choose.\n      <<var;name=\"bullet\";original=\"c.\";match=\".{0,20}\">> If the items are not available to the general public, and the initial developer of the Software requests a copy of the items, then you must supply one.\nLimitations of Liability\n\nIn no event shall the initial developers or copyright holders be liable for any damages whatsoever, including - but not restricted to - lost revenue or profits or other direct, indirect, special, incidental or consequential damages, even if they have been advised of the possibility of such damages, except to the extent invariable law, if any, provides otherwise.\n\nNo Warranty\n\nThe Software and this license document are provided AS IS with NO WARRANTY OF ANY KIND, INCLUDING THE WARRANTY OF DESIGN, MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.\n\nChoice of Law\n\nThis license is governed by the Laws of France.\n\n",
    "creationInfo" : "_:creationInfo_0",
    "expandedlicensing_isDeprecatedLicenseId" : false
  } ]
}