{
  "@context" : "https://spdx.org/rdf/3.0.1/spdx-context.jsonld",
  "@graph" : [ {
    "@id" : "_:creationInfo_0",
    "type" : "CreationInfo",
    "specVersion" : "3.0.1",
    "createdBy" : [ "https://spdx.org/licenses/creatoragent/297da51" ],
    "createdUsing" : [ "https://spdx.org/tools/licenselistpublisher" ],
    "created" : "2026-01-30T00:00:00Z",
    "comment" : "This object is created and maintained by the SPDX legal team (https://spdx.dev/engage/participate/legal-team/) using the LicenseListPublisher (https://github.com/spdx/licenselistpublisher)"
  }, {
    "spdxId" : "http://spdx.org/licenses/SUL-1.0_document",
    "type" : "SpdxDocument",
    "rootElement" : [ "http://spdx.org/licenses/SUL-1.0" ],
    "name" : "SUL-1.0 document",
    "comment" : "SPDX Document For SUL-1.0",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "https://spdx.org/tools/licenselistpublisher",
    "type" : "Tool",
    "name" : "SPDX License List Publisher",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "https://spdx.org/licenses/creatoragent/297da51",
    "type" : "Organization",
    "name" : "SPDX Legal Team",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "http://spdx.org/licenses/SUL-1.0",
    "type" : "expandedlicensing_ListedLicense",
    "expandedlicensing_isOsiApproved" : false,
    "expandedlicensing_seeAlso" : [ "https://github.com/n8n-io/n8n/blob/master/LICENSE.md" ],
    "simplelicensing_licenseText" : "Sustainable Use License\n\nVersion 1.0\n\nAcceptance\n\nBy using the software, you agree to all of the terms and conditions below.\n\nCopyright License\n\nThe licensor grants you a non-exclusive, royalty-free, worldwide, non-sublicensable, non-transferable license\nto use, copy, distribute, make available, and prepare derivative works of the software, in each case subject\nto the limitations below.\n\nLimitations\n\nYou may use or modify the software only for your own internal business purposes or for non-commercial or\npersonal use. You may distribute the software or provide it to others only if you do so free of charge for\nnon-commercial purposes. You may not alter, remove, or obscure any licensing, copyright, or other notices of\nthe licensor in the software. Any use of the licensor’s trademarks is subject to applicable law.\n\nPatents\n\nThe licensor grants you a license, under any patent claims the licensor can license, or becomes able to\nlicense, to make, have made, use, sell, offer for sale, import and have imported the software, in each case\nsubject to the limitations and conditions in this license. This license does not cover any patent claims that\nyou cause to be infringed by modifications or additions to the software. If you or your company make any\nwritten claim that the software infringes or contributes to infringement of any patent, your patent license\nfor the software granted under these terms ends immediately. If your company makes such a claim, your patent\nlicense ends immediately for work on behalf of your company.\n\nNotices\n\nYou must ensure that anyone who gets a copy of any part of the software from you also gets a copy of these\nterms. If you modify the software, you must include in any modified copies of the software a prominent notice\nstating that you have modified the software.\n\nNo Other Rights\n\nThese terms do not imply any licenses other than those expressly granted in these terms.\n\nTermination\n\nIf you use the software in violation of these terms, such use is not licensed, and your license will\nautomatically terminate. If the licensor provides you with a notice of your violation, and you cease all\nviolation of this license no later than 30 days after you receive that notice, your license will be reinstated\nretroactively. However, if you violate these terms after such reinstatement, any additional violation of these\nterms will cause your license to terminate automatically and permanently.\n\nNo Liability\n\nAs far as the law allows, the software comes as is, without any warranty or condition, and the licensor will\nnot be liable to you for any damages arising out of these terms or the use or nature of the software, under\nany kind of legal claim.\n\nDefinitions\n\nThe “licensor” is the entity offering these terms.\n\nThe “software” is the software the licensor makes available under these terms, including any portion of it.\n\n“You” refers to the individual or entity agreeing to these terms.\n\n“Your company” is any legal entity, sole proprietorship, or other kind of organization that you work for, plus\nall organizations that have control over, are under the control of, or are under common control with that\norganization. Control means ownership of substantially all the assets of an entity, or the power to direct its\nmanagement and policies by vote, contract, or otherwise. Control can be direct or indirect.\n\n“Your license” is the license granted to you for the software under these terms.\n\n“Use” means anything you do with the software requiring your license.\n\n“Trademark” means trademarks, service marks, and similar rights.\n",
    "name" : "Sustainable Use License v1.0",
    "comment" : "This is a source available license with restrictions on use.",
    "expandedlicensing_standardLicenseTemplate" : "<<beginOptional>>Sustainable Use License Version 1.0<<endOptional>>\nAcceptance\n\nBy using the software, you agree to all of the terms and conditions below.\n\nCopyright License\n\nThe licensor grants you a non-exclusive, royalty-free, worldwide, non-sublicensable, non-transferable license to use, copy, distribute, make available, and prepare derivative works of the software, in each case subject to the limitations below.\n\nLimitations\n\nYou may use or modify the software only for your own internal business purposes or for non-commercial or personal use. You may distribute the software or provide it to others only if you do so free of charge for non-commercial purposes. You may not alter, remove, or obscure any licensing, copyright, or other notices of the licensor in the software. Any use of the licensor's trademarks is subject to applicable law.\n\nPatents\n\nThe licensor grants you a license, under any patent claims the licensor can license, or becomes able to license, to make, have made, use, sell, offer for sale, import and have imported the software, in each case subject to the limitations and conditions in this license. This license does not cover any patent claims that you cause to be infringed by modifications or additions to the software. If you or your company make any written claim that the software infringes or contributes to infringement of any patent, your patent license for the software granted under these terms ends immediately. If your company makes such a claim, your patent license ends immediately for work on behalf of your company.\n\nNotices\n\nYou must ensure that anyone who gets a copy of any part of the software from you also gets a copy of these terms. If you modify the software, you must include in any modified copies of the software a prominent notice stating that you have modified the software.\n\nNo Other Rights\n\nThese terms do not imply any licenses other than those expressly granted in these terms.\n\nTermination\n\nIf you use the software in violation of these terms, such use is not licensed, and your license will automatically terminate. If the licensor provides you with a notice of your violation, and you cease all violation of this license no later than 30 days after you receive that notice, your license will be reinstated retroactively. However, if you violate these terms after such reinstatement, any additional violation of these terms will cause your license to terminate automatically and permanently.\n\nNo Liability\n\nAs far as the law allows, the software comes as is, without any warranty or condition, and the licensor will not be liable to you for any damages arising out of these terms or the use or nature of the software, under any kind of legal claim.\n\nDefinitions\n\nThe \"licensor\" is the entity offering these terms.\n\nThe \"software\" is the software the licensor makes available under these terms, including any portion of it.\n\n\"You\" refers to the individual or entity agreeing to these terms.\n\n\"Your company\" is any legal entity, sole proprietorship, or other kind of organization that you work for, plus all organizations that have control over, are under the control of, or are under common control with that organization. Control means ownership of substantially all the assets of an entity, or the power to direct its management and policies by vote, contract, or otherwise. Control can be direct or indirect.\n\n\"Your license\" is the license granted to you for the software under these terms.\n\n\"Use\" means anything you do with the software requiring your license.\n\n\"Trademark\" means trademarks, service marks, and similar rights.\n\n",
    "creationInfo" : "_:creationInfo_0",
    "expandedlicensing_isDeprecatedLicenseId" : false
  } ]
}