{
  "@context" : "https://spdx.org/rdf/3.0.1/spdx-context.jsonld",
  "@graph" : [ {
    "@id" : "_:creationInfo_0",
    "type" : "CreationInfo",
    "specVersion" : "3.0.1",
    "createdBy" : [ "https://spdx.org/licenses/creatoragent/f8acf30" ],
    "createdUsing" : [ "https://spdx.org/tools/licenselistpublisher" ],
    "created" : "2025-01-05T00:00:00Z",
    "comment" : "This object is created and maintained by the SPDX legal team (https://spdx.dev/engage/participate/legal-team/) using the LicenseListPublisher (https://github.com/spdx/licenselistpublisher)"
  }, {
    "spdxId" : "http://spdx.org/licenses/TTYP0_document",
    "type" : "SpdxDocument",
    "rootElement" : [ "http://spdx.org/licenses/TTYP0" ],
    "name" : "TTYP0 document",
    "comment" : "SPDX Document For TTYP0",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "https://spdx.org/tools/licenselistpublisher",
    "type" : "Tool",
    "name" : "SPDX License List Publisher",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "https://spdx.org/licenses/creatoragent/f8acf30",
    "type" : "Organization",
    "name" : "SPDX Legal Team",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "http://spdx.org/licenses/TTYP0",
    "type" : "expandedlicensing_ListedLicense",
    "expandedlicensing_isOsiApproved" : false,
    "expandedlicensing_seeAlso" : [ "https://people.mpi-inf.mpg.de/~uwe/misc/uw-ttyp0/" ],
    "simplelicensing_licenseText" : "THE TTYP0 LICENSE\n\nPermission is hereby granted, free of charge, to any person obtaining\na copy of this font software and associated files (the \"Software\"),\nto deal in the Software without restriction, including without\nlimitation the rights to use, copy, modify, merge, publish,\ndistribute, embed, sublicense, and/or sell copies of the Software,\nand to permit persons to whom the Software is furnished to do so,\nsubject to the following conditions:\n\n(1) The above copyright notice, this permission notice, and the\n    disclaimer below shall be included in all copies or substantial\n    portions of the Software.\n\n(2) If the design of any glyphs in the fonts that are contained in the\n    Software or generated during the installation process is modified\n    or if additional glyphs are added to the fonts, the fonts\n    must be renamed. The new names may not contain the word \"UW\",\n    irrespective of capitalisation; the new names may contain the word\n    \"ttyp0\", irrespective of capitalisation, only if preceded by a\n    foundry name different from \"UW\".\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND,\nEXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.\nIN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY\nCLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT,\nTORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE\nSOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\n",
    "name" : "TTYP0 License",
    "expandedlicensing_standardLicenseTemplate" : "<<beginOptional>>THE TTYP0 LICENSE\n\n<<endOptional>>\nPermission is hereby granted, free of charge, to any person obtaining a copy of this font software and associated files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, embed, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n\n   <<var;name=\"bullet\";original=\"(1)\";match=\".{0,20}\">>\n   The above copyright notice, this permission notice, and the disclaimer below shall be included in all copies or substantial portions of the Software.\n\n   <<var;name=\"bullet\";original=\"(2)\";match=\".{0,20}\">>\n   If the design of any glyphs in the fonts that are contained in the Software or generated during the installation process is modified or if additional glyphs are added to the fonts, the fonts must be renamed. The new names may not contain the word \"UW\", irrespective of capitalisation; the new names may contain the word \"ttyp0\", irrespective of capitalisation, only if preceded by a foundry name different from \"UW\".\n\n   THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n   \n   ",
    "creationInfo" : "_:creationInfo_0",
    "expandedlicensing_isDeprecatedLicenseId" : false
  } ]
}