{
  "@context" : "https://spdx.org/rdf/3.0.1/spdx-context.jsonld",
  "@graph" : [ {
    "@id" : "_:creationInfo_0",
    "type" : "CreationInfo",
    "specVersion" : "3.0.1",
    "createdBy" : [ "https://spdx.org/licenses/creatoragent/f8acf30" ],
    "createdUsing" : [ "https://spdx.org/tools/licenselistpublisher" ],
    "created" : "2025-01-05T00:00:00Z",
    "comment" : "This object is created and maintained by the SPDX legal team (https://spdx.dev/engage/participate/legal-team/) using the LicenseListPublisher (https://github.com/spdx/licenselistpublisher)"
  }, {
    "spdxId" : "http://spdx.org/licenses/Widget-Workshop_document",
    "type" : "SpdxDocument",
    "rootElement" : [ "http://spdx.org/licenses/Widget-Workshop" ],
    "name" : "Widget-Workshop document",
    "comment" : "SPDX Document For Widget-Workshop",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "https://spdx.org/tools/licenselistpublisher",
    "type" : "Tool",
    "name" : "SPDX License List Publisher",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "https://spdx.org/licenses/creatoragent/f8acf30",
    "type" : "Organization",
    "name" : "SPDX Legal Team",
    "creationInfo" : "_:creationInfo_0"
  }, {
    "spdxId" : "http://spdx.org/licenses/Widget-Workshop",
    "type" : "expandedlicensing_ListedLicense",
    "expandedlicensing_isOsiApproved" : false,
    "expandedlicensing_seeAlso" : [ "https://github.com/novnc/noVNC/blob/master/core/crypto/des.js#L24" ],
    "simplelicensing_licenseText" : "Copyright (c) 1996 Widget Workshop, Inc. All Rights Reserved. \n\nPermission to use, copy, modify, and distribute this software and \nits documentation for NON-COMMERCIAL or COMMERCIAL purposes and \nwithout fee is hereby granted, provided that this copyright notice \nis kept intact. WIDGET WORKSHOP MAKES NO REPRESENTATIONS OR WARRANTIES \nABOUT THE SUITABILITY OF THE SOFTWARE, EITHER EXPRESS OR IMPLIED, \nINCLUDING BUT NOT LIMITED TO THE IMPLIED WARRANTIES OF MERCHANTABILITY, \nFITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT. WIDGET WORKSHOP \nSHALL NOT BE LIABLE FOR ANY DAMAGES SUFFERED BY LICENSEE AS A RESULT \nOF USING, MODIFYING OR DISTRIBUTING THIS SOFTWARE OR ITS DERIVATIVES. \nTHIS SOFTWARE IS NOT DESIGNED OR INTENDED FOR USE OR RESALE AS ON-LINE \nCONTROL EQUIPMENT IN HAZARDOUS ENVIRONMENTS REQUIRING FAIL-SAFE PERFORMANCE, \nSUCH AS IN THE OPERATION OF NUCLEAR FACILITIES, AIRCRAFT NAVIGATION OR \nCOMMUNICATION SYSTEMS, AIR TRAFFIC CONTROL, DIRECT LIFE SUPPORT MACHINES, \nOR WEAPONS SYSTEMS, IN WHICH THE FAILURE OF THE SOFTWARE COULD LEAD \nDIRECTLY TO DEATH, PERSONAL INJURY, OR SEVERE PHYSICAL OR ENVIRONMENTAL \nDAMAGE (\"HIGH RISK ACTIVITIES\"). WIDGET WORKSHOP SPECIFICALLY DISCLAIMS \nANY EXPRESS OR IMPLIED WARRANTY OF FITNESS FOR HIGH RISK ACTIVITIES.\n",
    "name" : "Widget Workshop License",
    "expandedlicensing_standardLicenseTemplate" : "<<var;name=\"copyright\";original=\"Copyright (c) 1996 Widget Workshop, Inc. All Rights Reserved.\";match=\".{0,5000}\">>\nPermission to use, copy, modify, and distribute this software and its documentation for NON-COMMERCIAL or COMMERCIAL purposes and without fee is hereby granted, provided that this copyright notice is kept intact. WIDGET WORKSHOP MAKES NO REPRESENTATIONS OR WARRANTIES ABOUT THE SUITABILITY OF THE SOFTWARE, EITHER EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT. WIDGET WORKSHOP SHALL NOT BE LIABLE FOR ANY DAMAGES SUFFERED BY LICENSEE AS A RESULT OF USING, MODIFYING OR DISTRIBUTING THIS SOFTWARE OR ITS DERIVATIVES. THIS SOFTWARE IS NOT DESIGNED OR INTENDED FOR USE OR RESALE AS ON-LINE CONTROL EQUIPMENT IN HAZARDOUS ENVIRONMENTS REQUIRING FAIL-SAFE PERFORMANCE, SUCH AS IN THE OPERATION OF NUCLEAR FACILITIES, AIRCRAFT NAVIGATION OR COMMUNICATION SYSTEMS, AIR TRAFFIC CONTROL, DIRECT LIFE SUPPORT MACHINES, OR WEAPONS SYSTEMS, IN WHICH THE FAILURE OF THE SOFTWARE COULD LEAD DIRECTLY TO DEATH, PERSONAL INJURY, OR SEVERE PHYSICAL OR ENVIRONMENTAL DAMAGE (\"HIGH RISK ACTIVITIES\"). WIDGET WORKSHOP SPECIFICALLY DISCLAIMS ANY EXPRESS OR IMPLIED WARRANTY OF FITNESS FOR HIGH RISK ACTIVITIES.\n\n",
    "creationInfo" : "_:creationInfo_0",
    "expandedlicensing_isDeprecatedLicenseId" : false
  } ]
}